[{"query": "哪些股票的最低价不比航发科技小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航发科技' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"发科\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.05752396583557129], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"发科\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0006639957427978516]]}, {"query": "成交量等于益佰制药股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '益佰制药' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"制药\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.11079144477844238], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.03840780258178711]]}, {"query": "哪些股票的成交量和益佰制药相等", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '益佰制药' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"制药\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.10308051109313965], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.003660440444946289]]}, {"query": "收盘价不大于零售行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"零售\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.09718799591064453], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0815587043762207]]}, {"query": "最高价小于信达地产上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '信达地产' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.10954976081848145], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.022540569305419922]]}, {"query": "哪些上市公司的最高价比信达地产小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '信达地产' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.03984808921813965], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN n.name\nLIMIT 50", 0, 0.007612705230712891]]}, {"query": "最高价小于酒精饮料行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.014806509017944336], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.004386425018310547]]}, {"query": "哪些行业的最高价比酒精饮料小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.008815288543701172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.005940437316894531]]}, {"query": "最高价不大于旅游和酒店行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.033771514892578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.02288508415222168]]}, {"query": "哪些行业的最高价不比旅游和酒店大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0013234615325927734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0005190372467041016]]}, {"query": "哪些股票的成交量比宁波联合小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宁波联合' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宁波联合\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.22870469093322754], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宁波联合\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0706326961517334]]}, {"query": "哪些股票的涨跌幅比明星电力大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '明星电力' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"明星电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.008737802505493164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"明星电力\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.036364078521728516]]}, {"query": "成交量等于佳都科技股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '佳都科技' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.03722071647644043], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.04333949089050293]]}, {"query": "哪些股票的成交量和佳都科技一样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '佳都科技' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.06505918502807617], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.015060186386108398]]}, {"query": "最低价不大于运输和物流行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.062398433685302734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.018373489379882812]]}, {"query": "哪些行业的最低价不比运输和物流大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0010967254638671875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.000431060791015625]]}, {"query": "哪些股票的成交量不比华微电子小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华微电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华微电子\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.004192829132080078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华微电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.00048804283142089844]]}, {"query": "哪些行业的最高价和航空公司一样大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.010478496551513672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0035033226013183594]]}, {"query": "收盘价大于污水处理行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.00744318962097168], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.004866361618041992]]}, {"query": "哪些行业的收盘价比污水处理大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.010279417037963867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.007389545440673828]]}, {"query": "成交量大于凯盛科技上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '凯盛科技' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.03705620765686035], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.006333112716674805]]}, {"query": "哪些上市公司的成交量比凯盛科技大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '凯盛科技' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN n.name\nLIMIT 50", 0, 0.01826024055480957], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.0005726814270019531]]}, {"query": "开盘价大于国发股份股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国发股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.04455208778381348], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.024900197982788086]]}, {"query": "哪些股票的开盘价比国发股份大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国发股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.002687215805053711], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0005373954772949219]]}, {"query": "哪些行业的最低价和化妆品一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化妆品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.1602468490600586], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.08538699150085449]]}, {"query": "哪些股票的最低价比宁波富达大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宁波富达' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宁波富达\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.261995792388916], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宁波富达\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.07860493659973145]]}, {"query": "哪些股票的最低价比冠豪高新小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '冠豪高新' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"冠豪高\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.04757404327392578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"冠豪高\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0025823116302490234]]}, {"query": "哪些股票的最低价不比联创光电小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '联创光电' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"联创光电\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.2452845573425293], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"联创光电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.057480573654174805]]}, {"query": "哪些行业的开盘价和旅游和酒店一样大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.05380415916442871], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.05637192726135254]]}, {"query": "开盘价不小于信息技术行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.006895780563354492], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.006130218505859375]]}, {"query": "哪些行业的开盘价不比信息技术小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.021711111068725586], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.004151105880737305]]}, {"query": "开盘价不小于永鼎股份股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '永鼎股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.004232645034790039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.00945281982421875]]}, {"query": "哪些股票的开盘价不比永鼎股份小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '永鼎股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0007457733154296875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0005466938018798828]]}, {"query": "涨跌幅不大于媒体和娱乐行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.0471196174621582], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.12987422943115234]]}, {"query": "哪些行业的涨跌幅不比媒体和娱乐大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.006818294525146484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0005791187286376953]]}, {"query": "涨跌幅不大于石油和天然气行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.05998420715332031], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.04739570617675781]]}, {"query": "哪些行业的涨跌幅不比石油和天然气大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.04039287567138672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.019654512405395508]]}, {"query": "最低价不小于污水处理行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.02042412757873535], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0025222301483154297]]}, {"query": "哪些行业的最低价不比污水处理小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.018010854721069336], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0030426979064941406]]}, {"query": "哪些上市公司的最低价和四川长虹一样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '四川长虹' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川长虹\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.24171066284179688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"四川长虹\" \nRETURN s.stock\nLIMIT 50", 0, 0.10793638229370117]]}, {"query": "哪些上市公司的成交量不比黄河旋风小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '黄河旋风' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"黄河旋风\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.304398775100708], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"黄河旋风\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.03039407730102539]]}, {"query": "最高价不大于娱乐设备行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.010265350341796875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.006401777267456055]]}]