[{"query": "股票通化东宝2017年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '通化东宝' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"通化东宝\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002584218978881836], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"通化东宝\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.004069089889526367], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"通化东宝\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025784969329833984], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"通化东宝\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002804994583129883], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"通化东宝\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024712085723876953], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"通化东宝\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.005821943283081055]]}, {"query": "2017年1到3月股票通化东宝的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '通化东宝' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"通化东宝\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026807785034179688], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"通化东宝\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002565145492553711]]}, {"query": "股票退市罗顿2016年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '退市罗顿' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0004792213439941406], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 \nRETURN s.stock\nLIMIT 50", 0, 0.0003910064697265625]]}, {"query": "股票妙可蓝多2013年第四季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '妙可蓝多' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.00040411949157714844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 4 \nRETURN s.stock\nLIMIT 50", 0, 0.0003731250762939453]]}, {"query": "股票渤海化学2013年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '渤海化学' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"化学\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014986991882324219], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"化学\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0037276744842529297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"化学\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014414787292480469], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"化学\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015506744384765625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"化学\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015411376953125], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"化学\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015273094177246094]]}, {"query": "2013年1到3月股票渤海化学的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '渤海化学' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"化学\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015721321105957031], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"化学\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015459060668945312]]}, {"query": "股票浙江东日2017年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '浙江东日' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"浙江东日\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023796558380126953], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"浙江东日\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024232864379882812], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"浙江东日\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025634765625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"浙江东日\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023958683013916016], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"浙江东日\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026667118072509766], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"浙江东日\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002444028854370117]]}, {"query": "2017年7到9月股票浙江东日的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '浙江东日' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"浙江东日\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002538442611694336], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"浙江东日\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023288726806640625]]}, {"query": "股票弘业股份2013年第四季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '弘业股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"弘业股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002485036849975586], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"弘业股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002597808837890625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"弘业股份\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025446414947509766], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"弘业股份\" AND sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024831295013427734], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"弘业股份\" AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023686885833740234], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"弘业股份\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002370595932006836]]}, {"query": "2013年10到12月股票弘业股份的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '弘业股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"弘业股份\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002584695816040039], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"弘业股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002798318862915039]]}, {"query": "股票郴电国际2016年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '郴电国际' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 \nRETURN s.stock\nLIMIT 50", 0, 0.0004086494445800781], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.00032138824462890625]]}, {"query": "股票尖峰集团2017年第四季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '尖峰集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"尖峰集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026102066040039062], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"尖峰集团\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002325773239135742], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"尖峰集团\" AND sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002423524856567383], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"尖峰集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024313926696777344], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"尖峰集团\" AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025224685668945312], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"尖峰集团\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023889541625976562]]}, {"query": "2017年10到12月股票尖峰集团的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '尖峰集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"尖峰集团\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024433135986328125], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"尖峰集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023000240325927734]]}, {"query": "股票光明乳业2016年第三季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '光明乳业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025255680084228516], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002535581588745117], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023145675659179688], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"光明乳业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023140907287597656], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023229122161865234], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002540111541748047]]}, {"query": "2016年7到9月股票光明乳业的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '光明乳业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023193359375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002581357955932617]]}, {"query": "股票太极集团2013年第三季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '太极集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"太极集团\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002601146697998047], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"太极集团\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0026319026947021484], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"太极集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002812623977661133], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"太极集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024840831756591797], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"太极集团\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002418041229248047], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"太极集团\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.00225830078125]]}, {"query": "2013年7到9月股票太极集团的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '太极集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"太极集团\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002504587173461914], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"太极集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024976730346679688]]}, {"query": "2016年1到3月股票厦门银行的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '厦门银行' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014491081237792969], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"银行\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014195442199707031]]}, {"query": "股票金杯汽车2013年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '金杯汽车' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"金杯汽车\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002627849578857422], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"金杯汽车\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002582550048828125], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"金杯汽车\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026242733001708984], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"金杯汽车\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025336742401123047], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"金杯汽车\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026290416717529297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"金杯汽车\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026569366455078125]]}, {"query": "2013年1到3月股票金杯汽车的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '金杯汽车' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"金杯汽车\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023736953735351562], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"金杯汽车\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002321958541870117]]}]