[{"query": "航空公司和金融技术产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金融技术' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"航空\" AND ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN temp\nLIMIT 50", 0, 0.00029206275939941406], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"航空\" \nRETURN temp\nLIMIT 50", 0, 0.00026869773864746094]]}, {"query": "航空公司和金融技术产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金融技术' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航空\" AND ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001463174819946289], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.001444101333618164]]}, {"query": "娱乐设备和石油和天然气的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014357566833496094], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013251304626464844]]}, {"query": "娱乐设备和石油和天然气的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003209114074707031], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.0002789497375488281]]}, {"query": "医疗保健和高科技产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0002739429473876953], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.0003139972686767578]]}, {"query": "医疗保健和高科技产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015366077423095703], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"科技\" AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.001409769058227539]]}, {"query": "陶赫连和严澹台的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '陶赫连' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '严澹台' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶赫连\" OR fm.fund_manager.name == \"严澹台\" ) AND fm.fund_manager.name == \"陶赫连\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"严澹台\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004182100296020508], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶赫连\" OR fm.fund_manager.name == \"严澹台\" ) AND fm.fund_manager.name == \"陶赫连\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶赫连\" OR fm.fund_manager.name == \"严澹台\" ) AND fm.fund_manager.name == \"严澹台\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0040683746337890625], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"陶赫连\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"严澹台\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶赫连\" OR fm.fund_manager.name == \"严澹台\" ) \nRETURN temp\nLIMIT 50", 0, 0.004263639450073242], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶赫连\" OR fm.fund_manager.name == \"严澹台\" ) AND fm.fund_manager.name == \"陶赫连\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶赫连\" OR fm.fund_manager.name == \"严澹台\" ) AND fm.fund_manager.name == \"严澹台\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶赫连\" OR fm.fund_manager.name == \"严澹台\" ) \nRETURN temp\nLIMIT 50", 0, 0.004491329193115234]]}, {"query": "冠豪高新和长城军工股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '冠豪高新' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '长城军工' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"军工\" AND s.stock.name == \"冠豪高\" \nRETURN temp\nLIMIT 50", 0, 0.0002913475036621094], ["MATCH (s:stock)\nWHERE s.stock.name == \"冠豪高\" AND s.stock.name == \"军工\" \nRETURN temp\nLIMIT 50", 0, 0.00024175643920898438]]}, {"query": "冠豪高新和长城军工股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '冠豪高新' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '长城军工' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"军工\" AND s.stock.name == \"冠豪高\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012969970703125], ["MATCH (s:stock)\nWHERE s.stock.name == \"冠豪高\" AND s.stock.name == \"军工\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012276172637939453]]}, {"query": "家居用品和汽车的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021657943725585938], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"家居\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014417171478271484]]}, {"query": "家居用品和汽车的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"家居\" \nRETURN temp\nLIMIT 50", 0, 0.00029754638671875], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"家居\" AND indus.industry.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.00024127960205078125]]}, {"query": "家居用品和汽车的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.002146482467651367], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"家居\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.001535654067993164]]}, {"query": "上港集团和中国电影上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '上港集团' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中国电影' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电影\" AND s.stock.name == \"上港集\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013213157653808594], ["MATCH (s:stock)\nWHERE s.stock.name == \"上港集\" AND s.stock.name == \"电影\" \nRETURN s.stock\nLIMIT 50", 0, 0.001302480697631836]]}, {"query": "上港集团和中国电影上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '上港集团' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中国电影' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"上港集\" AND s.stock.name == \"电影\" \nRETURN temp\nLIMIT 50", 0, 0.00033545494079589844], ["MATCH (s:stock)\nWHERE s.stock.name == \"电影\" AND s.stock.name == \"上港集\" \nRETURN temp\nLIMIT 50", 0, 0.0002906322479248047]]}, {"query": "上港集团和中国电影上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '上港集团' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中国电影' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电影\" AND s.stock.name == \"上港集\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013155937194824219], ["MATCH (s:stock)\nWHERE s.stock.name == \"上港集\" AND s.stock.name == \"电影\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012328624725341797]]}, {"query": "周司马和邹皇甫的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '周司马' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '邹皇甫' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"周司马\" OR fm.fund_manager.name == \"邹皇甫\" ) AND fm.fund_manager.name == \"周司马\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"周司马\" OR fm.fund_manager.name == \"邹皇甫\" ) AND fm.fund_manager.name == \"邹皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"周司马\" OR fm.fund_manager.name == \"邹皇甫\" ) \nRETURN temp\nLIMIT 50", 0, 0.00025963783264160156], ["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"周司马\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"邹皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"周司马\" OR fm.fund_manager.name == \"邹皇甫\" ) \nRETURN temp\nLIMIT 50", 0, 0.00021910667419433594], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"周司马\" OR fm.fund_manager.name == \"邹皇甫\" ) AND fm.fund_manager.name == \"周司马\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"周司马\" OR fm.fund_manager.name == \"邹皇甫\" ) AND fm.fund_manager.name == \"邹皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00025010108947753906], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"周司马\" OR fm.fund_manager.name == \"邹皇甫\" ) AND fm.fund_manager.name == \"周司马\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"邹皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00032448768615722656]]}, {"query": "华钰矿业和涪陵电力的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '华钰矿业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '涪陵电力' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"矿业\" AND s.stock.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012929439544677734], ["MATCH (s:stock)\nWHERE s.stock.name == \"电力\" AND s.stock.name == \"矿业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012195110321044922]]}, {"query": "华钰矿业和涪陵电力的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '华钰矿业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '涪陵电力' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电力\" AND s.stock.name == \"矿业\" \nRETURN temp\nLIMIT 50", 0, 0.00031065940856933594], ["MATCH (s:stock)\nWHERE s.stock.name == \"矿业\" AND s.stock.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.00022864341735839844]]}, {"query": "石油和天然气和医疗保健设施产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '医疗保健设施' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013835430145263672], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014240741729736328]]}, {"query": "石油和天然气和医疗保健设施产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '医疗保健设施' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN temp\nLIMIT 50", 0, 0.00029468536376953125], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0002918243408203125]]}, {"query": "石油和天然气和医疗保健设施产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '医疗保健设施' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014984607696533203], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015146732330322266]]}, {"query": "章宰父和严百里的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '章宰父' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '严百里' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"章宰父\" OR fm.fund_manager.name == \"严百里\" ) AND fm.fund_manager.name == \"章宰父\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"严百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00031447410583496094], ["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"章宰父\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"严百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"章宰父\" OR fm.fund_manager.name == \"严百里\" ) \nRETURN temp\nLIMIT 50", 0, 0.00025653839111328125], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"章宰父\" OR fm.fund_manager.name == \"严百里\" ) AND fm.fund_manager.name == \"章宰父\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"章宰父\" OR fm.fund_manager.name == \"严百里\" ) AND fm.fund_manager.name == \"严百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002720355987548828], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"章宰父\" OR fm.fund_manager.name == \"严百里\" ) AND fm.fund_manager.name == \"章宰父\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"章宰父\" OR fm.fund_manager.name == \"严百里\" ) AND fm.fund_manager.name == \"严百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"章宰父\" OR fm.fund_manager.name == \"严百里\" ) \nRETURN temp\nLIMIT 50", 0, 0.00025010108947753906]]}, {"query": "嘉实ESG可持续投资混合C和国泰鑫利一年持有期混合C公募基金的认购结束时间差距", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '嘉实ESG可持续投资混合C' WITH pof.public_offering_fund.subscription_end_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰鑫利一年持有期混合C' WITH ABS(pof.public_offering_fund.subscription_end_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"投资\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013921260833740234], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"投资\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013780593872070312]]}, {"query": "嘉实ESG可持续投资混合C和国泰鑫利一年持有期混合C公募基金的认购结束时间差额是多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '嘉实ESG可持续投资混合C' WITH pof.public_offering_fund.subscription_end_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰鑫利一年持有期混合C' WITH ABS(pof.public_offering_fund.subscription_end_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"投资\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.001283407211303711], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"投资\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012879371643066406]]}, {"query": "嘉实ESG可持续投资混合C和国泰鑫利一年持有期混合C公募基金的认购结束时间差多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '嘉实ESG可持续投资混合C' WITH pof.public_offering_fund.subscription_end_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰鑫利一年持有期混合C' WITH ABS(pof.public_offering_fund.subscription_end_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"投资\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.00032639503479003906], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"投资\" \nRETURN temp\nLIMIT 50", 0, 0.00026416778564453125]]}, {"query": "华纺股份和淮河能源的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '华纺股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '淮河能源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"华纺股份\" \nRETURN temp\nLIMIT 50", 0, 0.0002956390380859375], ["MATCH (s:stock)\nWHERE s.stock.name == \"华纺股份\" AND s.stock.name == \"能源\" \nRETURN temp\nLIMIT 50", 0, 0.0002269744873046875]]}, {"query": "华纺股份和淮河能源的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '华纺股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '淮河能源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"华纺股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013341903686523438], ["MATCH (s:stock)\nWHERE s.stock.name == \"华纺股份\" AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.001535177230834961]]}, {"query": "房地产和酒精饮料的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '房地产' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND indus.industry.name == \"房地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.002791166305541992], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"房地产\" AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.0028023719787597656]]}, {"query": "华梁丘和陶北门的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '华梁丘' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '陶北门' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"华梁丘\" OR fm.fund_manager.name == \"陶北门\" ) AND fm.fund_manager.name == \"华梁丘\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"陶北门\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004885673522949219], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"华梁丘\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"陶北门\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"华梁丘\" OR fm.fund_manager.name == \"陶北门\" ) \nRETURN temp\nLIMIT 50", 0, 0.0045931339263916016], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"华梁丘\" OR fm.fund_manager.name == \"陶北门\" ) AND fm.fund_manager.name == \"华梁丘\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"华梁丘\" OR fm.fund_manager.name == \"陶北门\" ) AND fm.fund_manager.name == \"陶北门\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"华梁丘\" OR fm.fund_manager.name == \"陶北门\" ) \nRETURN temp\nLIMIT 50", 0, 0.0051174163818359375], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"华梁丘\" OR fm.fund_manager.name == \"陶北门\" ) AND fm.fund_manager.name == \"华梁丘\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"华梁丘\" OR fm.fund_manager.name == \"陶北门\" ) AND fm.fund_manager.name == \"陶北门\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0048525333404541016]]}, {"query": "国泰价值远见混合C和泰康港股通TMT指数A基金的认购开始时间差距", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰价值远见混合C' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '泰康港股通TMT指数A' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"股通\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012323856353759766], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"股通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012664794921875]]}, {"query": "国泰价值远见混合C和泰康港股通TMT指数A基金的认购开始时间差多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰价值远见混合C' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '泰康港股通TMT指数A' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"股通\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.0002906322479248047], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"股通\" \nRETURN temp\nLIMIT 50", 0, 0.000263214111328125]]}, {"query": "国泰价值远见混合C和泰康港股通TMT指数A基金的认购开始时间差额是多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰价值远见混合C' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '泰康港股通TMT指数A' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"股通\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013148784637451172], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"股通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013365745544433594]]}, {"query": "南京化纤和*ST宜生上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '南京化纤' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '*ST宜生' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"ST宜\" AND s.stock.name == \"南京化纤\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012941360473632812], ["MATCH (s:stock)\nWHERE s.stock.name == \"南京化纤\" AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.00153350830078125]]}, {"query": "南京化纤和*ST宜生上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '南京化纤' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '*ST宜生' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"ST宜\" AND s.stock.name == \"南京化纤\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012600421905517578], ["MATCH (s:stock)\nWHERE s.stock.name == \"南京化纤\" AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016207695007324219]]}, {"query": "南京化纤和*ST宜生上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '南京化纤' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '*ST宜生' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"ST宜\" AND s.stock.name == \"南京化纤\" \nRETURN temp\nLIMIT 50", 0, 0.0002911090850830078], ["MATCH (s:stock)\nWHERE s.stock.name == \"南京化纤\" AND s.stock.name == \"ST宜\" \nRETURN temp\nLIMIT 50", 0, 0.0002028942108154297]]}, {"query": "运输和物流和水务产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '水务' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"务产\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.00032830238342285156], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"务产\" \nRETURN temp\nLIMIT 50", 0, 0.0003154277801513672]]}, {"query": "运输和物流和水务产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '水务' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"务产\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015411376953125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"务产\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015616416931152344]]}, {"query": "酒精饮料和媒体和娱乐的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"媒体\" ) AND t.trade.name == \"媒体\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"媒体\" ) AND t.trade.name == \"娱乐\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"媒体\" ) \nRETURN temp\nLIMIT 50", 0, 0.00025916099548339844], ["MATCH (t:trade)\nWHERE t.trade.name == \"媒体\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"娱乐\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"媒体\" ) \nRETURN temp\nLIMIT 50", 0, 0.00020170211791992188], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"媒体\" ) AND t.trade.name == \"媒体\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"媒体\" ) AND t.trade.name == \"娱乐\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0001876354217529297], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"媒体\" ) AND t.trade.name == \"媒体\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"娱乐\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00017070770263671875]]}]