[{"query": "高科技和农业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '高科技' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002226591110229492], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"农业\" ) \nRETURN temp\nLIMIT 50", 0, 0.0022859573364257812], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0019335746765136719], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"农业\" ) \nRETURN temp\nLIMIT 50", 0, 0.002572774887084961]]}, {"query": "医疗设备和媒体和娱乐产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003490447998046875], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0003151893615722656]]}, {"query": "医疗设备和媒体和娱乐产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016362667083740234], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.001623392105102539]]}, {"query": "钱诸葛和华万俟的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '钱诸葛' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '华万俟' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"钱诸葛\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"华万俟\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱诸葛\" OR fm.fund_manager.name == \"华万俟\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002574920654296875], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱诸葛\" OR fm.fund_manager.name == \"华万俟\" ) AND fm.fund_manager.name == \"钱诸葛\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱诸葛\" OR fm.fund_manager.name == \"华万俟\" ) AND fm.fund_manager.name == \"华万俟\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱诸葛\" OR fm.fund_manager.name == \"华万俟\" ) \nRETURN temp\nLIMIT 50", 0, 0.00022172927856445312], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱诸葛\" OR fm.fund_manager.name == \"华万俟\" ) AND fm.fund_manager.name == \"钱诸葛\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"华万俟\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002288818359375], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱诸葛\" OR fm.fund_manager.name == \"华万俟\" ) AND fm.fund_manager.name == \"钱诸葛\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱诸葛\" OR fm.fund_manager.name == \"华万俟\" ) AND fm.fund_manager.name == \"华万俟\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002243518829345703]]}, {"query": "船舶和海运和物流服务的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '物流服务' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014264583587646484], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014712810516357422]]}, {"query": "船舶和海运和物流服务的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '物流服务' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013060569763183594], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0012776851654052734]]}, {"query": "水务和食品和饮料的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '水务' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"食品\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"饮料\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN temp\nLIMIT 50", 0, 0.002115964889526367], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"食品\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0018413066864013672], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"食品\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN temp\nLIMIT 50", 0, 0.002183198928833008], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"食品\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"饮料\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0016870498657226562]]}, {"query": "小商品城和博信股份的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '小商品城' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '博信股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"小商品城\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015041828155517578], ["MATCH (s:stock)\nWHERE s.stock.name == \"小商品城\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016884803771972656]]}, {"query": "小商品城和博信股份的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '小商品城' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '博信股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"小商品城\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014336109161376953], ["MATCH (s:stock)\nWHERE s.stock.name == \"小商品城\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017652511596679688]]}, {"query": "小商品城和博信股份的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '小商品城' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '博信股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"小商品城\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.00033092498779296875], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"小商品城\" \nRETURN temp\nLIMIT 50", 0, 0.00023746490478515625]]}, {"query": "钱皇甫和孙谷梁的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '钱皇甫' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '孙谷梁' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"钱皇甫\" OR fm.fund_manager.name == \"孙谷梁\" ) AND fm.fund_manager.name == \"钱皇甫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"孙谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004507303237915039], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"钱皇甫\" OR fm.fund_manager.name == \"孙谷梁\" ) AND fm.fund_manager.name == \"钱皇甫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"钱皇甫\" OR fm.fund_manager.name == \"孙谷梁\" ) AND fm.fund_manager.name == \"孙谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱皇甫\" OR fm.fund_manager.name == \"孙谷梁\" ) \nRETURN temp\nLIMIT 50", 0, 0.0044116973876953125], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"钱皇甫\" OR fm.fund_manager.name == \"孙谷梁\" ) AND fm.fund_manager.name == \"钱皇甫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"钱皇甫\" OR fm.fund_manager.name == \"孙谷梁\" ) AND fm.fund_manager.name == \"孙谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004373788833618164], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"钱皇甫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"孙谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"钱皇甫\" OR fm.fund_manager.name == \"孙谷梁\" ) \nRETURN temp\nLIMIT 50", 0, 0.004364728927612305]]}, {"query": "运输和物流和高科技产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015196800231933594], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014514923095703125]]}, {"query": "运输和物流和高科技产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.00031113624572753906], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.00022673606872558594]]}, {"query": "运输和物流和高科技产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014643669128417969], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014958381652832031]]}, {"query": "大连热电和重庆水务的最高价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '大连热电' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '重庆水务' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大连热电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01907205581665039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大连热电\" \nRETURN s.stock\nLIMIT 50", 0, 0.01889181137084961]]}, {"query": "大连热电和重庆水务的最高价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '大连热电' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '重庆水务' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大连热电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019998550415039062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大连热电\" \nRETURN s.stock\nLIMIT 50", 0, 0.019155263900756836]]}, {"query": "食品和饮料和信息技术的最高价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"技术\" AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN temp\nLIMIT 50", 0, 0.0006501674652099609], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND t.trade.name == \"技术\" \nRETURN temp\nLIMIT 50", 0, 0.0004525184631347656]]}, {"query": "食品和饮料和信息技术的最高价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002290487289428711], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0021758079528808594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018768310546875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017964839935302734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017211437225341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016627311706542969]]}, {"query": "农业和食品和饮料的最低价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农业' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"食品\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.17580795288085938], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"农业\" OR indus.industry.name == \"食品\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.18306994438171387]]}, {"query": "华阳新材和瑞丰银行股票的成交量差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华阳新材' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '瑞丰银行' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005483627319335938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN temp\nLIMIT 50", 0, 0.0003650188446044922]]}, {"query": "华阳新材和瑞丰银行股票的成交量差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华阳新材' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '瑞丰银行' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0023572444915771484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.001905679702758789]]}, {"query": "汽车零部件和信息技术的最高价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.01710963249206543], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.002152681350708008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.016340970993041992], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0019674301147460938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018553733825683594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.01635146141052246]]}, {"query": "汽车零部件和信息技术的最高价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"技术\" AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.0006291866302490234], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"技术\" \nRETURN temp\nLIMIT 50", 0, 0.0004303455352783203]]}, {"query": "八一钢铁和沧州大化上市公司的成交量差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '八一钢铁' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"八一钢铁\" OR s.stock.name == \"沧州大化\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005381107330322266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"八一钢铁\" OR s.stock.name == \"沧州大化\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003833770751953125]]}, {"query": "八一钢铁和沧州大化上市公司的成交量差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '八一钢铁' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"八一钢铁\" OR s.stock.name == \"沧州大化\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.022151708602905273], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"八一钢铁\" OR s.stock.name == \"沧州大化\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019870996475219727]]}, {"query": "金融技术和航天和国防的最高价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008482217788696289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007531166076660156]]}, {"query": "金融技术和航天和国防的最高价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007104396820068359], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007947921752929688]]}, {"query": "电信设备和污水处理的涨跌幅差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.018253564834594727], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020294189453125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" AND t.trade.name == \"电信\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021250247955322266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" AND t.trade.name == \"水处理\" \nRETURN t.trade\nLIMIT 50", 0, 0.015982627868652344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0018048286437988281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade\nLIMIT 50", 0, 0.016268491744995117]]}, {"query": "电信设备和污水处理的涨跌幅差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.000583648681640625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN temp\nLIMIT 50", 0, 0.0004336833953857422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN temp\nLIMIT 50", 0, 0.0004181861877441406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" AND t.trade.name == \"电信\" \nRETURN temp\nLIMIT 50", 0, 0.00037479400634765625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" AND t.trade.name == \"水处理\" \nRETURN temp\nLIMIT 50", 0, 0.0002760887145996094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004057884216308594]]}, {"query": "浙江龙盛和潞安环能股票的最高价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙江龙盛' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '潞安环能' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"浙江龙盛\" AND s.stock.name == \"能股\" \nRETURN temp\nLIMIT 50", 0, 0.0005273818969726562], ["MATCH (s:stock)\nWHERE s.stock.name == \"能股\" AND s.stock.name == \"浙江龙盛\" \nRETURN temp\nLIMIT 50", 0, 0.0003235340118408203]]}]