[{"query": "纺织品和服装行业近99日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-99 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0023572444915771484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0019626617431640625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0019114017486572266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002044677734375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002248525619506836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0018153190612792969]]}, {"query": "近99日纺织品和服装行业的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-99 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002257823944091797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002023458480834961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0020453929901123047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0018832683563232422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0020172595977783203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0019648075103759766]]}, {"query": "信息技术2020年10月29日前29日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` <= date('2020-10-29') AND td.trade_data.`date` > date('2020-10-29')-29 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-10-29\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002549409866333008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-10-29\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021648406982421875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-10-29\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0020830631256103516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2020-10-29\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001855611801147461], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-10-29\" ) AND t.trade.name == \"技术\" AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017616748809814453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2020-10-29\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017943382263183594]]}, {"query": "信息技术2020年10月29日前29天的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` <= date('2020-10-29') AND td.trade_data.`date` > date('2020-10-29')-29 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-10-29\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002390146255493164], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-10-29\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0020918846130371094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-10-29\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001985788345336914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2020-10-29\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018093585968017578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-10-29\" ) AND t.trade.name == \"技术\" AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017745494842529297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2020-10-29\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.00188446044921875]]}, {"query": "2020年10月29日前29日的信息技术的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` <= date('2020-10-29') AND td.trade_data.`date` > date('2020-10-29')-29 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-10-29\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002629518508911133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-10-29\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021905899047851562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-10-29\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002164602279663086], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2020-10-29\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002407550811767578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-10-29\" ) AND t.trade.name == \"技术\" AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019307136535644531], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2020-10-29\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017843246459960938]]}, {"query": "金属和矿业行业近63日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-63 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0006914138793945312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0005161762237548828]]}, {"query": "近63日金属和矿业行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-63 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0008749961853027344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0005445480346679688]]}, {"query": "金属和矿业行业近63日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-63 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008631229400634766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.010697603225708008]]}, {"query": "酒精饮料近79日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-79 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0023255348205566406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.002069711685180664]]}, {"query": "近79日酒精饮料的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-79 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002374410629272461], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.00197601318359375]]}, {"query": "酒精饮料近79日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-79 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0026743412017822266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002122163772583008]]}, {"query": "电力行业近24日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-24 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.002224445343017578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0018703937530517578]]}, {"query": "近24日电力行业的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-24 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0021848678588867188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019214153289794922]]}, {"query": "2020年3月7日后96日的信息技术行业的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` >= date('2020-03-07') AND td.trade_data.`date` < date('2020-03-07')+96 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-3-7\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002137422561645508], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-7\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001821279525756836]]}, {"query": "信息技术行业2020年3月7日后96天的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` >= date('2020-03-07') AND td.trade_data.`date` < date('2020-03-07')+96 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2020-3-7\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021495819091796875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-7\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018146038055419922]]}, {"query": "医疗保健2020年6月14日后90天的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` >= date('2020-06-14') AND td.trade_data.`date` < date('2020-06-14')+90 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-14\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0020856857299804688], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2020-6-14\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0019364356994628906]]}, {"query": "医疗保健2020年6月14日后90日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` >= date('2020-06-14') AND td.trade_data.`date` < date('2020-06-14')+90 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-14\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0019123554229736328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2020-6-14\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0018057823181152344]]}, {"query": "2020年6月14日后90日的医疗保健的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` >= date('2020-06-14') AND td.trade_data.`date` < date('2020-06-14')+90 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-14\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0016639232635498047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2020-6-14\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0015406608581542969]]}, {"query": "近4日零售行业的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-4 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.025584697723388672], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"零售\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.024288415908813477]]}, {"query": "零售行业近4日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-4 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.022628307342529297], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"零售\" \nRETURN s.stock\nLIMIT 50", 0, 0.028641462326049805]]}, {"query": "2008年12月21日到2019年12月23日的金融服务的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` >= date('2008-12-21') AND td.trade_data.`date` <= date('2019-12-23') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-12-23\" ) AND td.trade_data.`date` == date( \"2008-12-21\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.009436368942260742], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2008-12-21\" ) AND td.trade_data.`date` == date( \"2019-12-23\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.002580404281616211], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-12-23\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2008-12-21\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.006765127182006836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2008-12-21\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2019-12-23\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0022094249725341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2019-12-23\" ) AND td.trade_data.`date` == date( \"2008-12-21\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.00744938850402832], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2008-12-21\" ) AND td.trade_data.`date` == date( \"2019-12-23\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.00225830078125]]}, {"query": "珠宝和宝石近89日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-89 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade\nLIMIT 50", 0, 0.0027806758880615234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002213716506958008]]}, {"query": "珠宝和宝石近89日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-89 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002588987350463867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002206087112426758]]}, {"query": "家居用品近11日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-11 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0026121139526367188], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0024962425231933594]]}, {"query": "近11日家居用品的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-11 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0027642250061035156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002378225326538086]]}, {"query": "电信服务提供商近30日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-30 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.008254766464233398], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.007707118988037109]]}, {"query": "电信服务提供商近30日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-30 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0069980621337890625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00718379020690918]]}, {"query": "近30日电信服务提供商的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-30 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.007654428482055664], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.006992340087890625]]}, {"query": "酒店和度假村近5日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-5 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002556324005126953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002233743667602539]]}, {"query": "近5日酒店和度假村的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-5 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0022454261779785156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0020694732666015625]]}, {"query": "酒店和度假村近5日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-5 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.00199127197265625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019788742065429688]]}, {"query": "农产品近97日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农产品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-97 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.002099752426147461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0019500255584716797]]}, {"query": "农产品近97日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农产品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-97 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 0.002129077911376953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017452239990234375]]}]