[{"query": "沧州大化2019年1月22日到2022年4月30日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` >= date('2019-01-22') AND sd.stock_data.`date` <= date('2022-04-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-1-22\" ) AND s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2022-4-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016670942306518555], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-4-30\" ) AND s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2019-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01515650749206543], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-4-30\" ) AND sd.stock_data.`date` == date( \"2019-1-22\" ) AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.016916513442993164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2022-4-30\" ) AND sd.stock_data.`date` == date( \"2019-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016576766967773438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2019-1-22\" ) AND sd.stock_data.`date` == date( \"2022-4-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015563249588012695], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-1-22\" ) AND sd.stock_data.`date` == date( \"2022-4-30\" ) AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.017496585845947266]]}, {"query": "2021年8月24日前10日的北京人力的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '北京人力' AND sd.stock_data.`date` <= date('2021-08-24') AND sd.stock_data.`date` > date('2021-08-24')-10 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 10 AND sd.stock_data.`date` == date( \"2021-8-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.028890609741210938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-24\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 10 \nRETURN s.stock\nLIMIT 50", 0, 0.025547266006469727]]}, {"query": "北京人力2021年8月24日前10日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '北京人力' AND sd.stock_data.`date` <= date('2021-08-24') AND sd.stock_data.`date` > date('2021-08-24')-10 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 10 AND sd.stock_data.`date` == date( \"2021-8-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.024524450302124023], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-24\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 10 \nRETURN s.stock\nLIMIT 50", 0, 0.02429342269897461]]}, {"query": "北京人力2021年8月24日前10天的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '北京人力' AND sd.stock_data.`date` <= date('2021-08-24') AND sd.stock_data.`date` > date('2021-08-24')-10 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 10 AND sd.stock_data.`date` == date( \"2021-8-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.024881362915039062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-24\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 10 \nRETURN s.stock\nLIMIT 50", 0, 0.021471738815307617]]}, {"query": "近50日方大炭素股票的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '方大炭素' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-50 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0005838871002197266], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.3468947410583496], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.004477739334106445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0006554126739501953]]}, {"query": "方大炭素股票近50日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '方大炭素' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-50 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"方大\" \nRETURN s.stock\nLIMIT 50", 0, 0.0027344226837158203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005021095275878906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"方大\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.00037789344787597656], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"方大\" \nRETURN s.stock\nLIMIT 50", 0, 0.3375859260559082]]}, {"query": "华发股份股票近60日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华发股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-60 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0021317005157470703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0017902851104736328]]}, {"query": "近60日华发股份股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华发股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-60 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0020668506622314453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0016894340515136719]]}, {"query": "华发股份股票近60日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华发股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-60 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018527507781982422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016753673553466797]]}, {"query": "千金药业近22日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '千金药业' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-22 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018398761749267578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015597343444824219]]}, {"query": "千金药业近22日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '千金药业' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-22 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017323493957519531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016849040985107422]]}, {"query": "近99日八一钢铁股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '八一钢铁' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-99 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"八一钢铁\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.018451929092407227], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"八一钢铁\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.01668262481689453]]}, {"query": "八一钢铁股票近99日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '八一钢铁' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-99 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"八一钢铁\" \nRETURN s.stock\nLIMIT 50", 0, 0.01804518699645996], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"八一钢铁\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01652836799621582]]}, {"query": "中路股份上市公司2013年2月10日到2023年5月16日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中路股份' AND sd.stock_data.`date` >= date('2013-02-10') AND sd.stock_data.`date` <= date('2023-05-16') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2013-2-10\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-5-16\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0022873878479003906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-5-16\" ) AND sd.stock_data.`date` == date( \"2013-2-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0019936561584472656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-5-16\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2013-2-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017800331115722656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2013-2-10\" ) AND sd.stock_data.`date` == date( \"2023-5-16\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017323493957519531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2013-2-10\" ) AND sd.stock_data.`date` == date( \"2023-5-16\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0014889240264892578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-5-16\" ) AND sd.stock_data.`date` == date( \"2013-2-10\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015106201171875]]}, {"query": "2013年2月10日到2023年5月16日的中路股份上市公司的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中路股份' AND sd.stock_data.`date` >= date('2013-02-10') AND sd.stock_data.`date` <= date('2023-05-16') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2013-2-10\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-5-16\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017807483673095703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-5-16\" ) AND sd.stock_data.`date` == date( \"2013-2-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015485286712646484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-5-16\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2013-2-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015802383422851562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2013-2-10\" ) AND sd.stock_data.`date` == date( \"2023-5-16\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016367435455322266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2013-2-10\" ) AND sd.stock_data.`date` == date( \"2023-5-16\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015294551849365234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-5-16\" ) AND sd.stock_data.`date` == date( \"2013-2-10\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001522064208984375]]}, {"query": "中路股份上市公司2013年2月10日到2023年5月16日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中路股份' AND sd.stock_data.`date` >= date('2013-02-10') AND sd.stock_data.`date` <= date('2023-05-16') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-5-16\" ) AND sd.stock_data.`date` == date( \"2013-2-10\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0027017593383789062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-5-16\" ) AND sd.stock_data.`date` == date( \"2013-2-10\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018837451934814453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-5-16\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2013-2-10\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016369819641113281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2013-2-10\" ) AND sd.stock_data.`date` == date( \"2023-5-16\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016887187957763672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2013-2-10\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-5-16\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014891624450683594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2013-2-10\" ) AND sd.stock_data.`date` == date( \"2023-5-16\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014574527740478516]]}, {"query": "天富能源股票2014年8月19日到2020年9月2日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` >= date('2014-08-19') AND sd.stock_data.`date` <= date('2020-09-02') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2020-9-2\" ) AND sd.stock_data.`date` == date( \"2014-8-19\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0020956993103027344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-8-19\" ) AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2020-9-2\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016779899597167969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-9-2\" ) AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2014-8-19\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0014488697052001953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-8-19\" ) AND sd.stock_data.`date` == date( \"2020-9-2\" ) AND s.stock.name == \"能源\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015411376953125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-9-2\" ) AND sd.stock_data.`date` == date( \"2014-8-19\" ) AND s.stock.name == \"能源\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015811920166015625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2014-8-19\" ) AND sd.stock_data.`date` == date( \"2020-9-2\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0014698505401611328]]}, {"query": "天富能源股票2014年8月19日到2020年9月2日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` >= date('2014-08-19') AND sd.stock_data.`date` <= date('2020-09-02') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2014-8-19\" ) AND sd.stock_data.`date` == date( \"2020-9-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0019445419311523438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-9-2\" ) AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2014-8-19\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.00177001953125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-8-19\" ) AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2020-9-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016186237335205078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-9-2\" ) AND sd.stock_data.`date` == date( \"2014-8-19\" ) AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017528533935546875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2020-9-2\" ) AND sd.stock_data.`date` == date( \"2014-8-19\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015418529510498047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-8-19\" ) AND sd.stock_data.`date` == date( \"2020-9-2\" ) AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016224384307861328]]}, {"query": "金晶科技近28日的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金晶科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金晶科技\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016658544540405273], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金晶科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016756296157836914]]}, {"query": "近28日金晶科技的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金晶科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金晶科技\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016119956970214844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金晶科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016865253448486328]]}, {"query": "金晶科技近28日的成交量是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金晶科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金晶科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.014908313751220703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金晶科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.014320135116577148]]}, {"query": "原材料1994年12月25日到2021年6月23日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` >= date('1994-12-25') AND td.trade_data.`date` <= date('2021-06-23') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1994-12-25\" ) AND td.trade_data.`date` == date( \"2021-6-23\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0020732879638671875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-23\" ) AND td.trade_data.`date` == date( \"1994-12-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007765054702758789]]}, {"query": "原材料1994年12月25日到2021年6月23日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` >= date('1994-12-25') AND td.trade_data.`date` <= date('2021-06-23') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1994-12-25\" ) AND td.trade_data.`date` == date( \"2021-6-23\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018095970153808594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-23\" ) AND td.trade_data.`date` == date( \"1994-12-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005773305892944336]]}, {"query": "1994年12月25日到2021年6月23日的原材料的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` >= date('1994-12-25') AND td.trade_data.`date` <= date('2021-06-23') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1994-12-25\" ) AND td.trade_data.`date` == date( \"2021-6-23\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001837015151977539], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-23\" ) AND td.trade_data.`date` == date( \"1994-12-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006826162338256836]]}, {"query": "家居用品近100日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-100 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017077922821044922], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0014672279357910156]]}, {"query": "近100日家居用品的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-100 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018353462219238281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0017521381378173828]]}, {"query": "娱乐设备2021年10月9日前7天的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` <= date('2021-10-09') AND td.trade_data.`date` > date('2021-10-09')-7 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date( \"2021-10-9\" ) AND date('2023-11-11') - td.trade_data.`date` <= 7 \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.002002239227294922], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 7 AND td.trade_data.`date` == date( \"2021-10-9\" ) AND t.trade.name == \"娱乐\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0019485950469970703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-10-9\" ) AND t.trade.name == \"娱乐\" AND date('2023-11-11') - td.trade_data.`date` <= 7 \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018639564514160156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 7 AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date( \"2021-10-9\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.001659393310546875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-10-9\" ) AND date('2023-11-11') - td.trade_data.`date` <= 7 AND t.trade.name == \"娱乐\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0016014575958251953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND date('2023-11-11') - td.trade_data.`date` <= 7 AND td.trade_data.`date` == date( \"2021-10-9\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0017173290252685547]]}]