[{"query": "博闻科技股票的最高价是否不大于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price <= 4\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017642974853515625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001664876937866211]]}, {"query": "博闻科技的最低价是不是小于22", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price < 22\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017199516296386719], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017154216766357422]]}, {"query": "博闻科技的最低价是否小于22", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price < 22\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016412734985351562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001590728759765625]]}, {"query": "博闻科技上市公司的涨跌幅是否不大于71", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 71\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016021728515625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015892982482910156]]}, {"query": "博闻科技上市公司的涨跌幅是不是不大于71", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 71\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.001817464828491211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015735626220703125]]}, {"query": "博闻科技上市公司的成交量是否大于86", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 86\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.001650094985961914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001556396484375]]}, {"query": "重庆燃气股票的最高价是不是大于98", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆燃气' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 98\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"燃气股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001964092254638672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"燃气股\" \nRETURN s.stock\nLIMIT 50", 0, 0.001669168472290039]]}, {"query": "重庆燃气股票的最高价是否大于98", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆燃气' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 98\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"燃气股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019958019256591797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"燃气股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016908645629882812]]}, {"query": "S佳通股票的最高价是否大于12", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == 'S佳通' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 12\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017354488372802734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0014996528625488281]]}, {"query": "S佳通股票的最高价是不是大于12", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == 'S佳通' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 12\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017173290252685547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015377998352050781]]}, {"query": "S佳通股票的最低价是否小于100", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == 'S佳通' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price < 100\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016632080078125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016293525695800781]]}, {"query": "华银电力上市公司的开盘价是否不小于90", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price >= 90\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016997814178466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.016656875610351562]]}, {"query": "华银电力上市公司的开盘价是不是不小于90", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price >= 90\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020584583282470703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.017539024353027344]]}, {"query": "华银电力的收盘价是不是不小于63", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.closing_price >= 63\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019612789154052734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.019231796264648438]]}, {"query": "华银电力股票的最高价是否大于21", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 21\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0160977840423584], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.016726970672607422]]}, {"query": "华银电力的最低价是否不小于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 16\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01731729507446289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.016462087631225586]]}, {"query": "华银电力的最低价是不是不小于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 16\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015676021575927734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.01585698127746582]]}, {"query": "华银电力的涨跌幅是不是大于89", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range > 89\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015362739562988281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.015552043914794922]]}, {"query": "华银电力的涨跌幅是否大于89", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range > 89\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015784502029418945], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0151824951171875]]}, {"query": "华银电力上市公司的成交量是否大于10", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华银电力' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 10\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华银电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016327619552612305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华银电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.014492034912109375]]}, {"query": "沧州大化的开盘价是不是不小于1", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price >= 1\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016396760940551758], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.015743494033813477]]}, {"query": "沧州大化的开盘价是否不小于1", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price >= 1\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016298294067382812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.016058683395385742]]}, {"query": "沧州大化的收盘价是否不大于28", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.closing_price <= 28\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015719175338745117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.01627945899963379]]}, {"query": "沧州大化股票的最高价是否大于79", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 79\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01732468605041504], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.01846027374267578]]}, {"query": "沧州大化上市公司的最低价是否大于42", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price > 42\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01602339744567871], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.014419078826904297]]}, {"query": "沧州大化的涨跌幅是不是小于72", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range < 72\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01566910743713379], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.015731096267700195]]}, {"query": "沧州大化上市公司的成交量是否小于32", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume < 32\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01580071449279785], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"沧州大化\" \nRETURN s.stock\nLIMIT 50", 0, 0.015110015869140625]]}, {"query": "东湖高新上市公司的开盘价是否小于68", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东湖高新' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price < 68\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东湖高新\" \nRETURN s.stock\nLIMIT 50", 0, 0.018984317779541016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东湖高新\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01743936538696289]]}, {"query": "东湖高新上市公司的最高价是不是大于50", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东湖高新' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 50\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东湖高新\" \nRETURN s.stock\nLIMIT 50", 0, 0.015192031860351562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东湖高新\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015830039978027344]]}, {"query": "东湖高新股票的最低价是否小于71", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东湖高新' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price < 71\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东湖高新\" \nRETURN s.stock\nLIMIT 50", 0, 0.015467405319213867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东湖高新\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015251874923706055]]}, {"query": "东湖高新上市公司的涨跌幅是否不大于95", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东湖高新' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 95\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东湖高新\" \nRETURN s.stock\nLIMIT 50", 0, 0.015653371810913086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东湖高新\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01629018783569336]]}, {"query": "东湖高新上市公司的成交量是否大于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东湖高新' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 16\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东湖高新\" \nRETURN s.stock\nLIMIT 50", 0, 0.015623807907104492], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东湖高新\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01671767234802246]]}, {"query": "东湖高新上市公司的成交量是不是大于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东湖高新' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 16\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东湖高新\" \nRETURN s.stock\nLIMIT 50", 0, 0.016015052795410156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东湖高新\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016402721405029297]]}, {"query": "光电股份股票的开盘价是否大于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光电股份' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price > 4\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"电股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01896524429321289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"电股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.021690845489501953]]}, {"query": "光电股份股票的开盘价是不是大于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光电股份' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price > 4\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"电股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.020288467407226562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"电股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018772602081298828]]}, {"query": "光电股份上市公司的最高价是否小于54", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光电股份' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 54\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020613670349121094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018970966339111328]]}, {"query": "光电股份上市公司的最高价是不是小于54", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光电股份' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 54\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019078254699707031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017230510711669922]]}, {"query": "光电股份股票的最低价是否小于72", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光电股份' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price < 72\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"电股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.022798776626586914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"电股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019643068313598633]]}, {"query": "光电股份上市公司的涨跌幅是不是不大于76", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光电股份' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 76\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002035856246948242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017673969268798828]]}, {"query": "光电股份上市公司的成交量是不是不小于30", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光电股份' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume >= 30\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017955303192138672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016508102416992188]]}, {"query": "宇通客车股票的开盘价是否不小于89", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price >= 89\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017153501510620117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.014891862869262695]]}, {"query": "宇通客车股票的收盘价是否大于67", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.closing_price > 67\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01718878746032715], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.016121864318847656]]}, {"query": "宇通客车股票的最高价是不是不小于81", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price >= 81\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015833139419555664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.016991376876831055]]}, {"query": "宇通客车的最低价是否小于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price < 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015141725540161133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.015977144241333008]]}, {"query": "宇通客车的最低价是不是小于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price < 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016344547271728516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.016596555709838867]]}, {"query": "宇通客车上市公司的涨跌幅是否大于73", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range > 73\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01631903648376465], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.01883101463317871]]}, {"query": "宇通客车上市公司的涨跌幅是不是大于73", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range > 73\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01621842384338379], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.01594090461730957]]}, {"query": "宇通客车的成交量是否大于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 4\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01648545265197754], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.016089677810668945]]}, {"query": "宇通客车的成交量是不是大于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宇通客车' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 4\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宇通客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01613616943359375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宇通客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.015467643737792969]]}, {"query": "海通证券上市公司的开盘价是不是不大于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海通证券' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price <= 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018913745880126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015211105346679688]]}, {"query": "海通证券上市公司的开盘价是否不大于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海通证券' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price <= 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018792152404785156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015666484832763672]]}]