[{"query": "成交量小于8的房地产行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '房地产' AND sd.stock_data.volume < 8 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume < 8 AND sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"房地产\" \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0009210109710693359], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 8 AND indus.industry.name == \"房地产\" \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0004851818084716797], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"房地产\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 8 \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0004665851593017578], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"房地产\" AND sd.stock_data.volume < 8 \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0004165172576904297], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"房地产\" AND sd.stock_data.volume < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock.name\nLIMIT 50", 0, 0.00033473968505859375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume < 8 AND indus.industry.name == \"房地产\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock.name\nLIMIT 50", 0, 0.00034236907958984375]]}, {"query": "涨跌幅小于41的公用事业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.range < 41 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range < 41 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.652973175048828], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 41 \nRETURN s.stock.name\nLIMIT 50", 0, 7.095978498458862], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range < 41 \nRETURN s.stock.name\nLIMIT 50", 0, 7.191494941711426], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range < 41 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.203120470046997], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range < 41 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.177002191543579], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 41 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.421881675720215]]}, {"query": "最高价不大于31的工业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.maximum_price <= 31 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 31 \nRETURN s.stock\nLIMIT 50", 0, 7.055220127105713], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.066004991531372], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 31 \nRETURN s.stock\nLIMIT 50", 0, 7.736565828323364], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.423985481262207], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 31 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.566867113113403], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.437363862991333]]}, {"query": "成交量小于45的酒店和度假村行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '酒店和度假村' AND sd.stock_data.volume < 45 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 45 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"酒店\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.025636672973632812], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 45 AND s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.026784658432006836], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 45 \nRETURN s.stock.name\nLIMIT 50", 0, 0.021628379821777344], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.volume < 45 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.018334627151489258], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"酒店\" AND sd.stock_data.volume < 45 \nRETURN s.stock.name\nLIMIT 50", 0, 0.02261829376220703], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 45 AND s.stock.name == \"酒店\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.021497011184692383]]}, {"query": "开盘价不大于40的公用事业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.opening_price <= 40 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 40 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.054347038269043], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price <= 40 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.488826751708984], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price <= 40 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.204002141952515], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 40 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.563720464706421], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 40 \nRETURN s.stock.name\nLIMIT 50", 0, 7.62044095993042], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 40 \nRETURN s.stock.name\nLIMIT 50", 0, 7.311151504516602]]}, {"query": "最低价不大于17的公用事业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.minimum_price <= 17 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 17 \nRETURN s.stock\nLIMIT 50", 0, 7.50742769241333], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 17 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.4192070960998535], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 17 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.7633349895477295], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 17 \nRETURN s.stock\nLIMIT 50", 0, 7.153026103973389], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.04273796081543], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 17 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.746791839599609]]}, {"query": "成交量不小于2的酒店和度假村行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '酒店和度假村' AND sd.stock_data.volume >= 2 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 2 \nRETURN s.stock\nLIMIT 50", 0, 0.02749943733215332], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 2 AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.030755281448364258], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume >= 2 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.026366233825683594], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.volume >= 2 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.020016193389892578], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume >= 2 AND s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.021747350692749023], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"酒店\" AND sd.stock_data.volume >= 2 \nRETURN s.stock\nLIMIT 50", 0, 0.018657922744750977]]}, {"query": "成交量小于2的化妆品行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '化妆品' AND sd.stock_data.volume < 2 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume < 2 AND sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"化妆品\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0005898475646972656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"化妆品\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 2 \nRETURN s1.stock\nLIMIT 50", 0, 0.0003058910369873047], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"化妆品\" AND sd.stock_data.volume < 2 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0002467632293701172], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"化妆品\" AND sd.stock_data.volume < 2 \nRETURN s1.stock\nLIMIT 50", 0, 0.0002849102020263672], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 2 AND indus.industry.name == \"化妆品\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0002617835998535156], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume < 2 AND indus.industry.name == \"化妆品\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0003559589385986328]]}, {"query": "成交量不小于7的酒精饮料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '酒精饮料' AND sd.stock_data.volume >= 7 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume >= 7 AND sd.stock_data.`date` == date('2023-11-10') AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.023496389389038086], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 7 AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.015630722045898438], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND t.trade.name == \"饮料\" AND sd.stock_data.volume >= 7 \nRETURN s.stock\nLIMIT 50", 0, 0.016524314880371094], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 7 \nRETURN s.stock\nLIMIT 50", 0, 0.016594409942626953], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND sd.stock_data.volume >= 7 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.017280101776123047], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume >= 7 AND t.trade.name == \"饮料\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.015080690383911133]]}, {"query": "开盘价不小于21的能源行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.opening_price >= 21 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.opening_price >= 21 \nRETURN s.stock\nLIMIT 50", 0, 0.0025358200073242188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price >= 21 AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021238327026367188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price >= 21 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017216205596923828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.opening_price >= 21 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0018358230590820312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price >= 21 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0016345977783203125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price >= 21 \nRETURN s.stock\nLIMIT 50", 0, 0.0017180442810058594]]}, {"query": "最高价不大于31的电力行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电力' AND sd.stock_data.maximum_price <= 31 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 31 AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.002602815628051758], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.027916908264160156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 31 AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.003090381622314453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.maximum_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0024902820587158203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电力\" AND sd.stock_data.maximum_price <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0019669532775878906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017361640930175781]]}, {"query": "成交量不大于49的农产品行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '农产品' AND sd.stock_data.volume <= 49 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 49 AND s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02829718589782715], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"农产品\" AND sd.stock_data.volume <= 49 \nRETURN s.stock\nLIMIT 50", 0, 0.021815061569213867], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 49 AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 0.019768476486206055], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 49 \nRETURN s.stock\nLIMIT 50", 0, 0.02229475975036621], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.volume <= 49 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02488994598388672], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 49 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 0.01993107795715332]]}, {"query": "成交量小于8的医疗保健行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '医疗保健' AND sd.stock_data.volume < 8 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 8 AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.01668262481689453], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" AND sd.stock_data.volume < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.013868093490600586], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 8 AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.013272762298583984], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.01584172248840332], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.volume < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.01316213607788086], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 8 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.015050888061523438]]}, {"query": "最低价小于35的公用事业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.minimum_price < 35 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price < 35 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.3451478481292725], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price < 35 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.386312961578369], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 35 \nRETURN s.stock\nLIMIT 50", 0, 7.239383220672607], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 35 \nRETURN s.stock\nLIMIT 50", 0, 7.173011779785156], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 35 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.311734914779663], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 35 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.152539968490601]]}, {"query": "成交量不小于9的银行行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '银行' AND sd.stock_data.volume >= 9 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume >= 9 AND indus.industry.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0006873607635498047], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume >= 9 AND sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"银行\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0004661083221435547], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 9 \nRETURN s1.stock\nLIMIT 50", 0, 0.00033736228942871094], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"银行\" AND sd.stock_data.volume >= 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0003409385681152344], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"银行\" AND sd.stock_data.volume >= 9 \nRETURN s1.stock\nLIMIT 50", 0, 0.00033974647521972656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 9 AND indus.industry.name == \"银行\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0002853870391845703]]}, {"query": "成交量不小于10的电脑硬件行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电脑硬件' AND sd.stock_data.volume >= 10 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume >= 10 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.011345386505126953], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 10 \nRETURN s.stock.name\nLIMIT 50", 0, 0.006898164749145508]]}, {"query": "成交量大于1的娱乐设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '娱乐设备' AND sd.stock_data.volume > 1 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume > 1 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.022532939910888672], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"娱乐\" AND sd.stock_data.volume > 1 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.019486188888549805], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume > 1 AND s.stock.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.026398420333862305], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"娱乐\" AND sd.stock_data.volume > 1 \nRETURN s.stock\nLIMIT 50", 0, 0.02317667007446289], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume > 1 AND s.stock.name == \"娱乐\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.020043134689331055], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"娱乐\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume > 1 \nRETURN s.stock\nLIMIT 50", 0, 0.02090740203857422]]}, {"query": "成交量小于20的公用事业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.volume < 20 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 20 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.023465394973754883], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 20 \nRETURN s.stock.name\nLIMIT 50", 0, 0.025089740753173828]]}]