[{"query": "有哪些上游是媒体和娱乐产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '媒体和娱乐' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017268657684326172], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015976428985595703]]}, {"query": "房金建发融股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '房金建发融' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"金建\" OR s.stock.name == \"发融\" ) AND s.stock.name == \"房金建发融\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015337467193603516], ["MATCH (s:stock)\nWHERE s.stock.name == \"房金建发融\" AND ( s.stock.name == \"金建\" OR s.stock.name == \"发融\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015380382537841797]]}, {"query": "有哪些股东是房金建发融股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '房金建发融' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"房金建发融\" AND ( s.stock.name == \"金建\" OR s.stock.name == \"发融\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00033926963806152344], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"金建\" OR s.stock.name == \"发融\" ) AND s.stock.name == \"房金建发融\" \nRETURN n.name\nLIMIT 50", 0, 0.00035858154296875]]}, {"query": "有哪些属于金融服务行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '金融服务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金融\" AND ( s.stock.name == \"金融\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015115737915039062], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"金融\" OR s.stock.name == \"服务\" ) AND s.stock.name == \"金融\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012831687927246094]]}, {"query": "酒精饮料产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '酒精饮料' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015516281127929688], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016109943389892578]]}, {"query": "有哪些上游是酒精饮料产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '酒精饮料' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015516281127929688], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001569986343383789]]}, {"query": "有哪些属于旅游和酒店行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '旅游和酒店' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) AND s.stock.name == \"旅游\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001316070556640625], ["MATCH (s:stock)\nWHERE s.stock.name == \"旅游\" AND ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013895034790039062]]}, {"query": "孔仲孙基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔仲孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔仲孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016283988952636719], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔仲孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014984607696533203]]}, {"query": "有哪些属于电信服务提供商行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '电信服务提供商' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电信\" AND ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001506805419921875], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) AND s.stock.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.001678466796875]]}, {"query": "有哪些托管给褚辕门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚辕门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚辕门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017156600952148438], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚辕门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015730857849121094]]}, {"query": "伊利股份股票所属的公募基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '伊利股份' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"伊利股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"伊利股份\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002977609634399414], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"伊利股份\" AND ( s.stock.name == \"伊利股\" OR s.stock.name == \"份股\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.004610538482666016]]}, {"query": "限制房保金股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '限制房保金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"限制房保金\" AND ( s.stock.name == \"房保\" OR s.stock.name == \"金股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016472339630126953], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"房保\" OR s.stock.name == \"金股\" ) AND s.stock.name == \"限制房保金\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015757083892822266]]}, {"query": "有哪些股东是限制房保金股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '限制房保金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"限制房保金\" AND ( s.stock.name == \"房保\" OR s.stock.name == \"金股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003578662872314453], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"房保\" OR s.stock.name == \"金股\" ) AND s.stock.name == \"限制房保金\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003848075866699219]]}, {"query": "有哪些托管给尤南宫基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '尤南宫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"尤南宫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015971660614013672], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"尤南宫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015301704406738281]]}, {"query": "有哪些属于汽车制造行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '汽车制造' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015041828155517578], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015058517456054688]]}, {"query": "褚谷梁基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015337467193603516], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016603469848632812]]}, {"query": "有哪些托管给褚谷梁基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014345645904541016], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015416145324707031]]}, {"query": "医集公投子股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '医集公投子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"投子\" AND s.stock.name == \"医集\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014100074768066406], ["MATCH (s:stock)\nWHERE s.stock.name == \"医集\" AND s.stock.name == \"投子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013651847839355469]]}, {"query": "有哪些股东是医集公投子股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '医集公投子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医集\" AND s.stock.name == \"投子\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003581047058105469], ["MATCH (s:stock)\nWHERE s.stock.name == \"投子\" AND s.stock.name == \"医集\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030231475830078125]]}, {"query": "有哪些属于金融技术行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '金融技术' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"金融\" AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015332698822021484], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND s.stock.name == \"金融\" \nRETURN s.stock\nLIMIT 50", 0, 0.00157928466796875]]}, {"query": "卫百里基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '卫百里' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"卫百里\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014939308166503906], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"卫百里\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013659000396728516]]}, {"query": "有哪些托管给谢亓基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '谢亓' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"谢亓\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001459360122680664], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"谢亓\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014541149139404297]]}, {"query": "窦呼延基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '窦呼延' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"窦呼延\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015501976013183594], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"窦呼延\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013685226440429688]]}, {"query": "有哪些股东是投数房产据股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '投数房产据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"房产\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"投数房产据\" \nRETURN n.name\nLIMIT 50", 0, 0.00032830238342285156], ["MATCH (s:stock)\nWHERE s.stock.name == \"投数房产据\" AND ( s.stock.name == \"房产\" OR s.stock.name == \"据股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00024771690368652344]]}, {"query": "物流服务产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '物流服务' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015196800231933594], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014138221740722656]]}, {"query": "有哪些上游是物流服务产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '物流服务' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014758110046386719], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015382766723632812]]}, {"query": "有哪些参股了五洲交通股票的股东", "golden": "MATCH (s1:stock)<-[iso:is_stockholder_of]-(sh2:stockholder) WHERE s1.stock.name == '五洲交通' RETURN sh2.stockholder.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"五洲交通\" AND ( s.stock.name == \"五洲交\" OR s.stock.name == \"通股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.000316619873046875], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"五洲交\" OR s.stock.name == \"通股\" ) AND s.stock.name == \"五洲交通\" \nRETURN n.name\nLIMIT 50", 0, 0.00029730796813964844]]}, {"query": "有哪些托管给李欧阳基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '李欧阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"李欧阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014536380767822266], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"李欧阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014801025390625]]}, {"query": "建造展据股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建造展据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"建造展\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"建造展据\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015194416046142578], ["MATCH (s:stock)\nWHERE s.stock.name == \"建造展据\" AND ( s.stock.name == \"建造展\" OR s.stock.name == \"据股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014805793762207031]]}, {"query": "有哪些股东是建造展据股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建造展据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"建造展\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"建造展据\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003688335418701172], ["MATCH (s:stock)\nWHERE s.stock.name == \"建造展据\" AND ( s.stock.name == \"建造展\" OR s.stock.name == \"据股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003345012664794922]]}, {"query": "有哪些属于石油和天然气行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '石油和天然气' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"石油\" AND ( s.stock.name == \"石油\" OR s.stock.name == \"天然\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.001461029052734375], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"石油\" OR s.stock.name == \"天然\" ) AND s.stock.name == \"石油\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013241767883300781]]}, {"query": "章叔孙基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '章叔孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"章叔孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016248226165771484], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"章叔孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014815330505371094]]}, {"query": "金融产发投股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '金融产发投' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金融\" AND ( s.stock.name == \"融产\" OR s.stock.name == \"发投\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014257431030273438], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"融产\" OR s.stock.name == \"发投\" ) AND s.stock.name == \"金融\" \nRETURN s.stock\nLIMIT 50", 0, 0.00146484375]]}, {"query": "有哪些股东是金融产发投股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '金融产发投' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"融产\" OR s.stock.name == \"发投\" ) AND s.stock.name == \"金融\" \nRETURN n.name\nLIMIT 50", 0, 0.0002884864807128906], ["MATCH (s:stock)\nWHERE s.stock.name == \"金融\" AND ( s.stock.name == \"融产\" OR s.stock.name == \"发投\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00031495094299316406]]}, {"query": "有哪些属于物流服务行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '物流服务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND s.stock.name == \"物流\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013840198516845703], ["MATCH (s:stock)\nWHERE s.stock.name == \"物流\" AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013742446899414062]]}, {"query": "务发金制股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务发金制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"务发\" AND s.stock.name == \"制股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013661384582519531], ["MATCH (s:stock)\nWHERE s.stock.name == \"制股\" AND s.stock.name == \"务发\" \nRETURN s.stock\nLIMIT 50", 0, 0.001382589340209961]]}, {"query": "有哪些股东是务发金制股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务发金制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"务发\" AND s.stock.name == \"制股\" \nRETURN n.name\nLIMIT 50", 0, 0.0002696514129638672], ["MATCH (s:stock)\nWHERE s.stock.name == \"制股\" AND s.stock.name == \"务发\" \nRETURN n.name\nLIMIT 50", 0, 0.0002181529998779297]]}, {"query": "家庭和个人用品产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '家庭和个人用品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0047359466552734375], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004249095916748047]]}, {"query": "有哪些上游是家庭和个人用品产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '家庭和个人用品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004282712936401367], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0041730403900146484]]}, {"query": "周伯赏基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '周伯赏' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"周伯赏\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016601085662841797], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"周伯赏\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016665458679199219]]}, {"query": "姜澹台基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '姜澹台' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"姜澹台\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001451730728149414], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"姜澹台\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015807151794433594]]}, {"query": "展制限有能股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展制限有能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"展制限有能\" AND ( s.stock.name == \"制限\" OR s.stock.name == \"有能\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014750957489013672], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"制限\" OR s.stock.name == \"有能\" ) AND s.stock.name == \"展制限有能\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015304088592529297]]}, {"query": "有哪些股东是展制限有能股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展制限有能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"制限\" OR s.stock.name == \"有能\" ) AND s.stock.name == \"展制限有能\" \nRETURN n.name\nLIMIT 50", 0, 0.0003712177276611328], ["MATCH (s:stock)\nWHERE s.stock.name == \"展制限有能\" AND ( s.stock.name == \"制限\" OR s.stock.name == \"有能\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00032711029052734375]]}, {"query": "份保医服制股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '份保医服制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"份保医服制\" AND ( s.stock.name == \"医服\" OR s.stock.name == \"制股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015566349029541016], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"医服\" OR s.stock.name == \"制股\" ) AND s.stock.name == \"份保医服制\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012500286102294922]]}, {"query": "有哪些股东是份保医服制股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '份保医服制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"医服\" OR s.stock.name == \"制股\" ) AND s.stock.name == \"份保医服制\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003447532653808594], ["MATCH (s:stock)\nWHERE s.stock.name == \"份保医服制\" AND ( s.stock.name == \"医服\" OR s.stock.name == \"制股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00028324127197265625]]}, {"query": "陶南宫基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陶南宫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陶南宫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015788078308105469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶南宫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015492439270019531]]}, {"query": "有哪些持有通宝能源股票的基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '通宝能源' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"有通\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001560211181640625], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"有通\" AND s.stock.name == \"能源\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015821456909179688]]}, {"query": "贵航股份股票关联的行业", "golden": "MATCH (s1:stock)-[bt:belong_to]->(t2:trade) WHERE s1.stock.name == '贵航股份' RETURN t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"贵航股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"贵航股份\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.002187490463256836], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"贵航股份\" AND ( s.stock.name == \"贵航股\" OR s.stock.name == \"份股\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.002220630645751953]]}, {"query": "有哪些包括贵航股份股票的行业", "golden": "MATCH (s1:stock)-[bt:belong_to]->(t2:trade) WHERE s1.stock.name == '贵航股份' RETURN t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"贵航股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"贵航股份\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.00220489501953125], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"贵航股份\" AND ( s.stock.name == \"贵航股\" OR s.stock.name == \"份股\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.0021224021911621094]]}, {"query": "电信产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电信' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电信\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018367767333984375], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电信\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021729469299316406]]}, {"query": "有哪些上游是电信产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电信' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电信\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017275810241699219], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电信\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020821094512939453]]}, {"query": "有哪些托管给钱百里基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '钱百里' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"钱百里\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015032291412353516], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"钱百里\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001482248306274414]]}, {"query": "航空航天行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '航空航天' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0023393630981445312], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0023365020751953125]]}, {"query": "有哪些属于航空航天行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '航空航天' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002314329147338867], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022280216217041016]]}, {"query": "有哪些托管给韩赫连基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '韩赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"韩赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001486063003540039], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"韩赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014142990112304688]]}, {"query": "医疗保健产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '医疗保健' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014452934265136719], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013835430145263672]]}, {"query": "有哪些上游是医疗保健产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '医疗保健' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013341903686523438], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013413429260253906]]}, {"query": "金地通能股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '金地通能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金地\" AND ( s.stock.name == \"地通\" OR s.stock.name == \"能股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013005733489990234], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"地通\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"金地\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013659000396728516]]}]