[{"query": "开盘价小于26的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 26 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 26 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0061876773834228516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 26 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007039785385131836]]}, {"query": "哪些行业的开盘价小于26", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 26 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 26 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007010221481323242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 26 \nRETURN t.trade.name\nLIMIT 50", 1, 0.00977325439453125]]}, {"query": "收盘价小于38的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 38 \nRETURN s.stock\nLIMIT 50", 0, 0.025877714157104492], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02608036994934082]]}, {"query": "哪些上市公司的收盘价小于38", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 38 \nRETURN s.stock\nLIMIT 50", 0, 0.022915124893188477], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022977113723754883]]}, {"query": "哪些股票的最高价不大于11", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 11 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01715874671936035], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 11 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017289161682128906]]}, {"query": "最低价不大于23的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 23 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 23 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018308401107788086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 23 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01712656021118164]]}, {"query": "哪些上市公司的最低价不大于23", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 23 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 23 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02625250816345215], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 23 \nRETURN s.stock\nLIMIT 50", 0, 0.02235102653503418]]}, {"query": "成交量不大于34的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 34 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 34 \nRETURN s.stock.name\nLIMIT 50", 1, 0.021580934524536133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 34 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018547534942626953]]}, {"query": "哪些上市公司的成交量不大于34", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 34 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 34 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02199554443359375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 34 \nRETURN s.stock\nLIMIT 50", 0, 0.022269725799560547]]}, {"query": "最高价小于8的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.021394968032836914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 8 \nRETURN s.stock\nLIMIT 50", 0, 0.024417400360107422]]}, {"query": "哪些股票的最高价小于8", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 8 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017957687377929688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01693439483642578]]}, {"query": "最低价小于16的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 16 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017780065536499023], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018817424774169922]]}, {"query": "哪些股票的最低价小于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 16 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01922607421875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.02023768424987793]]}, {"query": "哪些上市公司的涨跌幅小于21", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 21 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 21 \nRETURN s.stock\nLIMIT 50", 0, 0.022512197494506836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 21 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02293229103088379]]}, {"query": "成交量不大于22的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 22 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 22 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01754140853881836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 22 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017790555953979492]]}, {"query": "哪些股票的成交量不大于22", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 22 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 22 \nRETURN s.stock.name\nLIMIT 50", 1, 0.016566991806030273], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 22 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.02145099639892578]]}, {"query": "开盘价大于3的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00746607780456543], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price > 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007738590240478516]]}, {"query": "哪些行业的开盘价大于3", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005735158920288086], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price > 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0065457820892333984]]}, {"query": "最低价小于45的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 45 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 45 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00640416145324707], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 45 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006491899490356445]]}, {"query": "哪些行业的最低价小于45", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 45 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 45 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006080150604248047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 45 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005934476852416992]]}, {"query": "开盘价大于17的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > 17 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price > 17 \nRETURN s.stock\nLIMIT 50", 0, 0.003269195556640625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.00302886962890625]]}, {"query": "收盘价不小于21的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price >= 21 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price >= 21 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0033686161041259766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price >= 21 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.0028467178344726562]]}, {"query": "哪些上市公司的收盘价不小于21", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price >= 21 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price >= 21 \nRETURN s.stock\nLIMIT 50", 0, 0.0036809444427490234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price >= 21 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.003368377685546875]]}, {"query": "最高价不大于43的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 43 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 43 \nRETURN s.stock\nLIMIT 50", 0, 0.023394107818603516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 43 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.024320125579833984]]}, {"query": "涨跌幅大于3的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.015202522277832031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range > 3 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01731395721435547]]}, {"query": "哪些上市公司的涨跌幅大于3", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02114391326904297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range > 3 \nRETURN s.stock\nLIMIT 50", 0, 0.020491838455200195]]}, {"query": "成交量不大于14的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 14 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 14 \nRETURN s.stock\nLIMIT 50", 0, 0.02402353286743164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 14 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022489309310913086]]}, {"query": "哪些股票的成交量不大于14", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 14 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 14 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018427610397338867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 14 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01780867576599121]]}, {"query": "开盘价不大于3的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0060367584228515625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005475044250488281]]}, {"query": "哪些行业的开盘价不大于3", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0043926239013671875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.004776477813720703]]}, {"query": "最高价不大于31的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 31 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 31 \nRETURN t.trade.name\nLIMIT 50", 1, 0.010261058807373047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006366252899169922]]}, {"query": "哪些行业的最高价不大于31", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 31 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 31 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006458759307861328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006482362747192383]]}, {"query": "最低价小于33的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 33 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 33 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007930517196655273], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 33 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006860494613647461]]}, {"query": "哪些行业的最低价小于33", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 33 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 33 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007281064987182617], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 33 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007111787796020508]]}, {"query": "收盘价小于6的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 6 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 6 \nRETURN s.stock.name\nLIMIT 50", 1, 0.013089179992675781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 6 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.012128353118896484]]}, {"query": "哪些股票的收盘价小于6", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 6 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 6 \nRETURN s.stock.name\nLIMIT 50", 1, 0.013046026229858398], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 6 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01097249984741211]]}, {"query": "开盘价不大于18的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 18 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 18 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006119251251220703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 18 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005794048309326172]]}, {"query": "哪些行业的开盘价不大于18", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 18 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 18 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0060520172119140625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 18 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005777597427368164]]}, {"query": "收盘价小于28的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price < 28 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price < 28 \nRETURN t.trade.name\nLIMIT 50", 1, 0.008534669876098633], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price < 28 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0063402652740478516]]}, {"query": "哪些行业的收盘价小于28", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price < 28 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price < 28 \nRETURN t.trade.name\nLIMIT 50", 1, 0.008524179458618164], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price < 28 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0065155029296875]]}, {"query": "最低价小于31的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 31 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005960702896118164], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 31 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005992412567138672]]}, {"query": "哪些行业的最低价小于31", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 31 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005862236022949219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 31 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006719112396240234]]}, {"query": "涨跌幅不大于33的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 33 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 33 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006211519241333008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 33 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006448030471801758]]}, {"query": "哪些行业的涨跌幅不大于33", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 33 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 33 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006907224655151367], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 33 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0066204071044921875]]}, {"query": "开盘价小于6的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 6 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 6 \nRETURN t.trade.name\nLIMIT 50", 1, 0.004818439483642578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 6 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.004854440689086914]]}, {"query": "哪些行业的开盘价小于6", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 6 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 6 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005240201950073242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 6 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.004937887191772461]]}, {"query": "哪些上市公司的开盘价不大于33", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 33 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 33 \nRETURN s.stock\nLIMIT 50", 0, 0.021976470947265625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 33 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02301621437072754]]}, {"query": "最高价大于16的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 16 \nRETURN s.stock.name\nLIMIT 50", 1, 0.003264904022216797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.0030243396759033203]]}, {"query": "哪些股票的最高价大于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 16 \nRETURN s.stock.name\nLIMIT 50", 1, 0.003123760223388672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.0032122135162353516]]}]