[{"query": "哪些上市公司的开盘价比华资实业大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华资实业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华资实业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.14694476127624512], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华资实业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.03195452690124512]]}, {"query": "哪些行业的涨跌幅不比娱乐设备小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.012965917587280273], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0031321048736572266]]}, {"query": "最低价大于广西能源股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广西能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.039488792419433594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.018672704696655273]]}, {"query": "哪些股票的最低价比广西能源大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广西能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0008120536804199219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0003886222839355469]]}, {"query": "成交量大于三峡水利上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '三峡水利' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三峡水利\" WITH sd.stock_data.volume as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume > temp \nRETURN s.stock\nLIMIT 50", 0, 44.37984561920166], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三峡水利\" WITH sd.stock_data.volume as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume > temp \nRETURN s.stock\nLIMIT 50", 0, 0.14745593070983887], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三峡水利\" WITH sd.stock_data.volume as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume > temp AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.5854177474975586]]}, {"query": "哪些上市公司的成交量比三峡水利大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '三峡水利' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三峡水利\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.08586788177490234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三峡水利\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.07681918144226074]]}, {"query": "哪些行业的最低价和航空航天一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空航天' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.11386823654174805], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空航天\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.058972835540771484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.03838515281677246], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.022710561752319336], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.02634596824645996], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.021068572998046875]]}, {"query": "最低价不小于西藏旅游股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西藏旅游' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"旅游\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.11009836196899414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"旅游\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.05134296417236328]]}, {"query": "哪些股票的最低价不比西藏旅游小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西藏旅游' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"旅游\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0020759105682373047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"旅游\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.07565784454345703]]}, {"query": "最高价大于珠宝和宝石行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.015555381774902344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.005441188812255859]]}, {"query": "哪些行业的最高价比珠宝和宝石大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.005177021026611328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0005612373352050781]]}, {"query": "成交量小于浙江新能股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙江新能' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.03902316093444824], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能股\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.006651639938354492]]}, {"query": "最高价不小于西部矿业股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西部矿业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"矿业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.07742667198181152], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"矿业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.03570675849914551]]}, {"query": "哪些股票的最高价不比西部矿业小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西部矿业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"矿业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.002460956573486328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"矿业\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.00826406478881836]]}, {"query": "哪些股票的最低价不比东方集团小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东方集团' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方集团\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.18862271308898926], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方集团\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.1319904327392578]]}, {"query": "哪些行业的最低价和房地产一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '房地产' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"房地产\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.09288549423217773], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"房地产\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.02324509620666504]]}, {"query": "哪些股票的涨跌幅比上海能源小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0008585453033447266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海能源\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0004665851593017578]]}, {"query": "涨跌幅大于物流服务行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND td.trade_data.range > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.06237292289733887], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > temp \nRETURN t.trade.name\nLIMIT 50", 0, 7.884751558303833], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > temp AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 7.813426494598389], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > temp \nRETURN t.trade.name\nLIMIT 50", 0, 7.904369354248047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.range > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.06448125839233398], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > temp AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.02229762077331543], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > temp AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.026865482330322266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND td.trade_data.range > temp AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.016422271728515625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.range > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0156862735748291], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"物流\" WITH td.trade_data.range as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.012303829193115234]]}, {"query": "哪些行业的涨跌幅比物流服务大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0009653568267822266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0005269050598144531]]}, {"query": "哪些上市公司的最低价比西昌电力小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西昌电力' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"西昌电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.008009672164916992], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"西昌电力\" \nRETURN n.name\nLIMIT 50", 0, 0.0005099773406982422]]}, {"query": "哪些行业的涨跌幅和医疗保健一样大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.03827953338623047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0031197071075439453]]}, {"query": "开盘价不大于电信设备行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.058921098709106445], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.041745662689208984]]}, {"query": "哪些行业的开盘价不比电信设备大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.08583450317382812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.034285545349121094]]}, {"query": "收盘价不大于航天和国防行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.015505313873291016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0048410892486572266]]}, {"query": "哪些行业的收盘价不比航天和国防大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0072405338287353516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.002443552017211914]]}, {"query": "哪些股票的最低价和宝钢股份一样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宝钢股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.1681971549987793], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝钢股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.023389577865600586]]}, {"query": "哪些行业的最低价和酒店和度假村相等", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.01374959945678711], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.003004789352416992]]}, {"query": "哪些上市公司的成交量和苏州高新一样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '苏州高新' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"苏州高新\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.16255426406860352], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"苏州高新\" \nRETURN s.stock\nLIMIT 50", 0, 0.04020404815673828]]}, {"query": "最高价不大于物流服务行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.05035543441772461], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.025645971298217773]]}, {"query": "哪些行业的最高价不比物流服务大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.001271963119506836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0014004707336425781]]}, {"query": "最高价不大于ST鹏博士上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == 'ST鹏博士' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鹏博士\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.11431598663330078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鹏博士\" \nRETURN s.stock\nLIMIT 50", 0, 0.03779006004333496]]}, {"query": "哪些上市公司的最高价不比ST鹏博士大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == 'ST鹏博士' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鹏博士\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.07089424133300781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鹏博士\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.044072628021240234]]}, {"query": "最低价大于中航产融上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中航产融' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"产融\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.1450495719909668], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"产融\" \nRETURN s.stock\nLIMIT 50", 0, 0.09566140174865723]]}, {"query": "哪些上市公司的最低价比中航产融大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中航产融' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"产融\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.0012557506561279297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"产融\" \nRETURN n.name\nLIMIT 50", 0, 0.004899024963378906]]}, {"query": "哪些股票的开盘价和华资实业相等", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华资实业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华资实业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.3175923824310303], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华资实业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.030019760131835938]]}]