[{"query": "有哪些托管给柏黎丘基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '柏黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"柏黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001508951187133789], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"柏黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014164447784423828]]}, {"query": "金融产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '金融' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018630027770996094], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0023224353790283203]]}, {"query": "有哪些上游是金融产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '金融' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019278526306152344], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0023450851440429688]]}, {"query": "造房展公通股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '造房展公通' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"展公\" OR s.stock.name == \"通股\" ) AND s.stock.name == \"造房展公通\" \nRETURN s.stock\nLIMIT 50", 0, 0.001440286636352539], ["MATCH (s:stock)\nWHERE s.stock.name == \"造房展公通\" AND ( s.stock.name == \"展公\" OR s.stock.name == \"通股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001455545425415039]]}, {"query": "有哪些股东是造房展公通股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '造房展公通' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"展公\" OR s.stock.name == \"通股\" ) AND s.stock.name == \"造房展公通\" \nRETURN n.name\nLIMIT 50", 0, 0.00033402442932128906], ["MATCH (s:stock)\nWHERE s.stock.name == \"造房展公通\" AND ( s.stock.name == \"展公\" OR s.stock.name == \"通股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002815723419189453]]}, {"query": "冯东郭基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '冯东郭' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"冯东郭\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018732547760009766], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"冯东郭\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015244483947753906]]}, {"query": "有哪些托管给冯东郭基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '冯东郭' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"冯东郭\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013968944549560547], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"冯东郭\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014607906341552734]]}, {"query": "资能融医服股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资能融医服' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"资能\" OR s.stock.name == \"融医\" ) AND s.stock.name == \"资能融医服\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013201236724853516], ["MATCH (s:stock)\nWHERE s.stock.name == \"资能融医服\" AND ( s.stock.name == \"资能\" OR s.stock.name == \"融医\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012974739074707031]]}, {"query": "有哪些股东是资能融医服股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资能融医服' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"资能\" OR s.stock.name == \"融医\" ) AND s.stock.name == \"资能融医服\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003631114959716797], ["MATCH (s:stock)\nWHERE s.stock.name == \"资能融医服\" AND ( s.stock.name == \"资能\" OR s.stock.name == \"融医\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00032901763916015625]]}, {"query": "财通资管鸿佳60天滚动持有发起式中短债C基金相关的消息", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '财通资管鸿佳60天滚动持有发起式中短债C' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"通资\" AND pof.public_offering_fund.name == \"有发\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013968944549560547], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"有发\" AND pof.public_offering_fund.name == \"通资\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013384819030761719]]}, {"query": "有哪些提到财通资管鸿佳60天滚动持有发起式中短债C基金的讯息", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '财通资管鸿佳60天滚动持有发起式中短债C' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"通资\" AND pof.public_offering_fund.name == \"有发\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013289451599121094], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"有发\" AND pof.public_offering_fund.name == \"通资\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0015535354614257812]]}, {"query": "有哪些托管给姜伯赏基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '姜伯赏' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"姜伯赏\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014395713806152344], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"姜伯赏\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001476287841796875]]}, {"query": "高科技产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '高科技' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014910697937011719], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013873577117919922]]}, {"query": "有哪些上游是高科技产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '高科技' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014657974243164062], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013778209686279297]]}, {"query": "许梁丘基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '许梁丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"许梁丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001562356948852539], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"许梁丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014789104461669922]]}, {"query": "建造资能股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建造资能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"建造资能\" AND ( s.stock.name == \"造资\" OR s.stock.name == \"能股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014078617095947266], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"造资\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"建造资能\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.00160980224609375]]}, {"query": "有哪些股东是建造资能股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建造资能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"造资\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"建造资能\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002779960632324219], ["MATCH (s:stock)\nWHERE s.stock.name == \"建造资能\" AND ( s.stock.name == \"造资\" OR s.stock.name == \"能股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002512931823730469]]}, {"query": "科展发限股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '科展发限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"展发\" OR s.stock.name == \"限股\" ) AND s.stock.name == \"科展发限\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015530586242675781], ["MATCH (s:stock)\nWHERE s.stock.name == \"科展发限\" AND ( s.stock.name == \"展发\" OR s.stock.name == \"限股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0012962818145751953]]}, {"query": "有哪些股东是科展发限股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '科展发限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"科展发限\" AND ( s.stock.name == \"展发\" OR s.stock.name == \"限股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003390312194824219], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"展发\" OR s.stock.name == \"限股\" ) AND s.stock.name == \"科展发限\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002715587615966797]]}, {"query": "有哪些属于食品和饮料行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '食品和饮料' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"食品\" AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016324520111083984], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND s.stock.name == \"食品\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014579296112060547]]}, {"query": "有哪些托管给施孙侨基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '施孙侨' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"施孙侨\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015022754669189453], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"施孙侨\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014567375183105469]]}, {"query": "沈东郭基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '沈东郭' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈东郭\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013532638549804688], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"沈东郭\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014090538024902344]]}, {"query": "限资制医股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '限资制医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"资制\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"限资制医\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015692710876464844], ["MATCH (s:stock)\nWHERE s.stock.name == \"限资制医\" AND ( s.stock.name == \"资制\" OR s.stock.name == \"医股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.001275777816772461]]}, {"query": "有哪些股东是限资制医股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '限资制医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"限资制医\" AND ( s.stock.name == \"资制\" OR s.stock.name == \"医股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003218650817871094], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"资制\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"限资制医\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002319812774658203]]}, {"query": "据投展造子股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '据投展造子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"据投展造子\" AND ( s.stock.name == \"投展\" OR s.stock.name == \"造子\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013797283172607422], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"投展\" OR s.stock.name == \"造子\" ) AND s.stock.name == \"据投展造子\" \nRETURN s.stock\nLIMIT 50", 0, 0.00125885009765625]]}, {"query": "有哪些股东是据投展造子股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '据投展造子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"据投展造子\" AND ( s.stock.name == \"投展\" OR s.stock.name == \"造子\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003311634063720703], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"投展\" OR s.stock.name == \"造子\" ) AND s.stock.name == \"据投展造子\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00028634071350097656]]}, {"query": "有哪些托管给吴宇文基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吴宇文' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吴宇文\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016405582427978516], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴宇文\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013141632080078125]]}, {"query": "戚上官基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '戚上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"戚上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014801025390625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"戚上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014333724975585938]]}, {"query": "汽车零部件产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '汽车零部件' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018048286437988281], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002599954605102539]]}, {"query": "有哪些上游是汽车零部件产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '汽车零部件' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002688169479370117], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021944046020507812]]}, {"query": "盘江股份股票涉及的产业", "golden": "MATCH (s1:stock)-[a:associate]->(n2:industry) WHERE s1.stock.name == '盘江股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"盘江股份\" AND ( s.stock.name == \"盘江股\" OR s.stock.name == \"份股\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.002362966537475586], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( s.stock.name == \"盘江股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"盘江股份\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0023870468139648438]]}, {"query": "有哪些关联盘江股份股票的产业", "golden": "MATCH (s1:stock)-[a:associate]->(n2:industry) WHERE s1.stock.name == '盘江股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"盘江股份\" AND ( s.stock.name == \"盘江股\" OR s.stock.name == \"份股\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.002276897430419922], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( s.stock.name == \"盘江股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"盘江股份\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0022640228271484375]]}, {"query": "郑东门基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '郑东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"郑东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014469623565673828], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"郑东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013828277587890625]]}, {"query": "技投建制股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技投建制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"投建\" OR s.stock.name == \"制股\" ) AND s.stock.name == \"技投建制\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012900829315185547], ["MATCH (s:stock)\nWHERE s.stock.name == \"技投建制\" AND ( s.stock.name == \"投建\" OR s.stock.name == \"制股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.001277923583984375]]}, {"query": "有哪些股东是技投建制股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技投建制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"投建\" OR s.stock.name == \"制股\" ) AND s.stock.name == \"技投建制\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003151893615722656], ["MATCH (s:stock)\nWHERE s.stock.name == \"技投建制\" AND ( s.stock.name == \"投建\" OR s.stock.name == \"制股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002779960632324219]]}, {"query": "有哪些托管给蒋云基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '蒋云' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"蒋云\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013325214385986328], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"蒋云\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014548301696777344]]}, {"query": "有哪些托管给施伯赏基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '施伯赏' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"施伯赏\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014109611511230469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"施伯赏\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001409769058227539]]}, {"query": "有哪些托管给曹南门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '曹南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"曹南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013613700866699219], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"曹南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013775825500488281]]}, {"query": "内蒙华电股票涉及的产业", "golden": "MATCH (s1:stock)-[a:associate]->(n2:industry) WHERE s1.stock.name == '内蒙华电' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( s.stock.name == \"内蒙华\" OR s.stock.name == \"电股\" ) AND s.stock.name == \"内蒙华电\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.002506256103515625], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"内蒙华电\" AND ( s.stock.name == \"内蒙华\" OR s.stock.name == \"电股\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0025970935821533203]]}, {"query": "张梁丘基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '张梁丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"张梁丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014424324035644531], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"张梁丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018689632415771484]]}, {"query": "邹仲孙基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '邹仲孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"邹仲孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014336109161376953], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"邹仲孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016150474548339844]]}, {"query": "有哪些名下有综艺股份股票的董事长", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '综艺股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( s.stock.name == \"综艺股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"综艺股份\" \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.002123594284057617], ["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE s.stock.name == \"综艺股份\" AND ( s.stock.name == \"综艺股\" OR s.stock.name == \"份股\" ) \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.002209901809692383]]}, {"query": "展源房金股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展源房金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"展源\" AND s.stock.name == \"金股\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012290477752685547], ["MATCH (s:stock)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"展源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013053417205810547]]}, {"query": "有哪些股东是展源房金股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展源房金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"展源\" AND s.stock.name == \"金股\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00028395652770996094], ["MATCH (s:stock)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"展源\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002624988555908203]]}, {"query": "华微生基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '华微生' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"华微生\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015037059783935547], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"华微生\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001422882080078125]]}, {"query": "物流服务产业关联的股票", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '物流服务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服务\" AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014448165893554688], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"服务\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013804435729980469]]}, {"query": "李端木基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '李端木' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"李端木\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013878345489501953], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"李端木\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001401662826538086]]}, {"query": "有哪些托管给李端木基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '李端木' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"李端木\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013518333435058594], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"李端木\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013668537139892578]]}, {"query": "有哪些托管给郑左丘基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '郑左丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"郑左丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013391971588134766], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"郑左丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015056133270263672]]}, {"query": "团服展能股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '团服展能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"团服展能\" AND ( s.stock.name == \"服展\" OR s.stock.name == \"能股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0012476444244384766], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"服展\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"团服展能\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012128353118896484]]}, {"query": "有哪些股东是团服展能股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '团服展能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"服展\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"团服展能\" \nRETURN n.name\nLIMIT 50", 0, 0.000293731689453125], ["MATCH (s:stock)\nWHERE s.stock.name == \"团服展能\" AND ( s.stock.name == \"服展\" OR s.stock.name == \"能股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00023221969604492188]]}, {"query": "股产通保股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '股产通保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"产通\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"股产通保\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012824535369873047], ["MATCH (s:stock)\nWHERE s.stock.name == \"股产通保\" AND ( s.stock.name == \"产通\" OR s.stock.name == \"保股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012285709381103516]]}, {"query": "有哪些股东是股产通保股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '股产通保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股产通保\" AND ( s.stock.name == \"产通\" OR s.stock.name == \"保股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002956390380859375], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"产通\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"股产通保\" \nRETURN n.name\nLIMIT 50", 0, 0.00024700164794921875]]}, {"query": "赵南门基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013918876647949219], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013988018035888672]]}]