[{"query": "2019年11月9日的金融技术的开盘价和收盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2019-11-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND td.trade_data.`date` == date( \"2019-11-9\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007685661315917969], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-9\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006433248519897461]]}, {"query": "2019年11月9日金融技术的开盘价和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2019-11-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-9\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN td.trade_data.opening_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.006705045700073242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND td.trade_data.`date` == date( \"2019-11-9\" ) \nRETURN td.trade_data.opening_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.006453990936279297]]}, {"query": "金融技术的开盘价和收盘价在2019年11月9日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2019-11-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND td.trade_data.`date` == date( \"2019-11-9\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0056035518646240234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-9\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005582571029663086]]}, {"query": "2022年1月6日张江高科上市公司的开盘价和收盘价和最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '张江高科' AND sd.stock_data.`date` == date('2022-01-06') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.closing_price, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"张江高科\" AND sd.stock_data.`date` == date( \"2022-1-6\" ) \nRETURN sd.stock_data.closing_price,sd.stock_data.maximum_price\nLIMIT 50", 1, 0.018308401107788086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-6\" ) AND s.stock.name == \"张江高科\" \nRETURN sd.stock_data.closing_price,sd.stock_data.maximum_price\nLIMIT 50", 1, 0.017906904220581055]]}, {"query": "张江高科上市公司的开盘价和收盘价和最高价在2022年1月6日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '张江高科' AND sd.stock_data.`date` == date('2022-01-06') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.closing_price, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-6\" ) AND s.stock.name == \"张江高科\" \nRETURN s.stock\nLIMIT 50", 0, 0.017233610153198242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"张江高科\" AND sd.stock_data.`date` == date( \"2022-1-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017293930053710938]]}, {"query": "2022年1月6日的张江高科上市公司的开盘价和收盘价和最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '张江高科' AND sd.stock_data.`date` == date('2022-01-06') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.closing_price, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"张江高科\" AND sd.stock_data.`date` == date( \"2022-1-6\" ) \nRETURN sd.stock_data.closing_price,sd.stock_data.maximum_price\nLIMIT 50", 1, 0.01693415641784668], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-6\" ) AND s.stock.name == \"张江高科\" \nRETURN sd.stock_data.closing_price,sd.stock_data.maximum_price\nLIMIT 50", 1, 0.017268896102905273]]}, {"query": "2022年1月6日的张江高科上市公司的开盘价和收盘价和最高价的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '张江高科' AND sd.stock_data.`date` == date('2022-01-06') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.closing_price, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-6\" ) AND s.stock.name == \"张江高科\" \nRETURN s.stock\nLIMIT 50", 0, 0.017673730850219727], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"张江高科\" AND sd.stock_data.`date` == date( \"2022-1-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01603412628173828]]}, {"query": "2020年1月14日永泰能源股票的成交量和开盘价和最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '永泰能源' AND sd.stock_data.`date` == date('2020-01-14') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.opening_price, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2020-1-14\" ) \nRETURN sd.stock_data.opening_price,sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0021347999572753906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-14\" ) AND s.stock.name == \"能源\" \nRETURN sd.stock_data.opening_price,sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0017273426055908203]]}, {"query": "永泰能源股票的成交量和开盘价和最低价在2020年1月14日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '永泰能源' AND sd.stock_data.`date` == date('2020-01-14') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.opening_price, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2020-1-14\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018084049224853516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-14\" ) AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017490386962890625]]}, {"query": "新钢股份股票的更新时间和涨跌幅和成交量在2021年10月30日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '新钢股份' AND sd.stock_data.`date` == date('2021-10-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-10-30\" ) AND ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018926620483398438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) AND sd.stock_data.`date` == date( \"2021-10-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02322077751159668]]}, {"query": "运输和物流行业的涨跌幅和开盘价在2022年8月15日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2022-08-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-15\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006663799285888672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2022-8-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005725383758544922]]}, {"query": "2022年4月25日的工业行业的涨跌幅和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '工业' AND td.trade_data.`date` == date('2022-04-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006282329559326172], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.000347137451171875], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012689590454101562], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013195276260375977]]}, {"query": "2022年4月25日工业行业的涨跌幅和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '工业' AND td.trade_data.`date` == date('2022-04-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006756782531738281], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006046295166015625], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012637615203857422], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013203144073486328]]}, {"query": "2022年4月25日的工业行业的涨跌幅和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '工业' AND td.trade_data.`date` == date('2022-04-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005676746368408203], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004115104675292969], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012549161911010742], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.014290332794189453]]}, {"query": "珠宝和宝石行业的最高价在2022年10月4日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2022-10-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-4\" ) AND t.trade.name == \"宝石\" \nRETURN t.trade\nLIMIT 50", 0, 0.0022284984588623047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2022-10-4\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018048286437988281]]}, {"query": "2022年10月4日的珠宝和宝石行业的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2022-10-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2022-10-4\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0017995834350585938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-4\" ) AND t.trade.name == \"宝石\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018162727355957031]]}, {"query": "2021年1月24日电视和广播行业的开盘价和最高价和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2021-01-24') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.maximum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006089210510253906], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013389348983764648], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.010432720184326172], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004622936248779297]]}, {"query": "2021年1月24日的电视和广播行业的开盘价和最高价和涨跌幅的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2021-01-24') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.maximum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00054931640625], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013824939727783203], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012341976165771484], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-24\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00047779083251953125]]}, {"query": "2022年10月20日化学行业的开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2022-10-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-20\" ) AND indus.industry.name == \"化学\" \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 1, 0.018946409225463867], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2022-10-20\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 1, 0.018224239349365234]]}, {"query": "医疗保健设施的涨跌幅和最高价和开盘价在2021年8月14日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2021-08-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2021-8-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001859426498413086], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-14\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016942024230957031]]}, {"query": "2020年5月4日的江苏索普股票的更新时间和开盘价和最低价的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏索普' AND sd.stock_data.`date` == date('2020-05-04') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-4\" ) AND s.stock.name == \"江苏索普\" \nRETURN s.stock\nLIMIT 50", 0, 0.017232894897460938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏索普\" AND sd.stock_data.`date` == date( \"2020-5-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01761150360107422]]}, {"query": "2020年5月4日江苏索普股票的更新时间和开盘价和最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏索普' AND sd.stock_data.`date` == date('2020-05-04') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-4\" ) AND s.stock.name == \"江苏索普\" \nRETURN sd.stock_data.opening_price,sd.stock_data.minimum_price\nLIMIT 50", 1, 0.01689457893371582], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏索普\" AND sd.stock_data.`date` == date( \"2020-5-4\" ) \nRETURN sd.stock_data.opening_price,sd.stock_data.minimum_price\nLIMIT 50", 1, 0.018039226531982422]]}, {"query": "江苏索普股票的更新时间和开盘价和最低价在2020年5月4日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏索普' AND sd.stock_data.`date` == date('2020-05-04') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-4\" ) AND s.stock.name == \"江苏索普\" \nRETURN s.stock\nLIMIT 50", 0, 0.01653265953063965], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏索普\" AND sd.stock_data.`date` == date( \"2020-5-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016809701919555664]]}, {"query": "信息技术的收盘价和涨跌幅在2023年7月25日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-07-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2023-7-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019593238830566406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-25\" ) AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017583370208740234]]}, {"query": "2020年6月4日的珠宝和宝石行业的收盘价和更新时间和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2020-06-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-4\" ) AND t.trade.name == \"宝石\" \nRETURN td.trade_data.`date`,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0020132064819335938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2020-6-4\" ) \nRETURN td.trade_data.`date`,td.trade_data.maximum_price\nLIMIT 50", 0, 0.002139568328857422]]}, {"query": "2020年6月4日珠宝和宝石行业的收盘价和更新时间和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2020-06-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-4\" ) AND t.trade.name == \"宝石\" \nRETURN td.trade_data.`date`,td.trade_data.maximum_price\nLIMIT 50", 0, 0.001890420913696289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2020-6-4\" ) \nRETURN td.trade_data.`date`,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018308162689208984]]}, {"query": "2020年6月4日的珠宝和宝石行业的收盘价和更新时间和最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2020-06-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2020-6-4\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019545555114746094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-4\" ) AND t.trade.name == \"宝石\" \nRETURN t.trade\nLIMIT 50", 0, 0.00176239013671875]]}, {"query": "物流服务行业的更新时间和涨跌幅和开盘价在2022年3月5日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2022-03-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.range, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-5\" ) AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007964849472045898], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-3-5\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008999824523925781]]}, {"query": "2022年3月10日的家庭和个人用品的开盘价和涨跌幅和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家庭和个人用品' AND td.trade_data.`date` == date('2022-03-10') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.range, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-10\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013797760009765625], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-10\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-10\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-10\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.014551401138305664], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-10\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005960464477539062], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-10\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-10\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00046563148498535156]]}, {"query": "金属和矿业的最高价和收盘价和涨跌幅在2020年4月1日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` == date('2020-04-01') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.closing_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007918596267700195], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0088348388671875]]}]