[{"query": "哪个是在星宇股份和精工钢构和中源协和中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['星宇股份', '精工钢构', '中源协和'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0020093917846679688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017082691192626953]]}, {"query": "在大唐电信和爱建集团中开盘价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['大唐电信', '爱建集团'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大唐电信\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.019538402557373047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大唐电信\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.017296791076660156]]}, {"query": "哪个是在大唐电信和爱建集团中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['大唐电信', '爱建集团'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大唐电信\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.018308639526367188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大唐电信\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.020974397659301758]]}, {"query": "哪个是在珠宝和宝石和电子设备中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['珠宝和宝石', '电子设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"宝石\" OR t.trade.name == \"电子\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007942914962768555], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"电子\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007157564163208008]]}, {"query": "在珠宝和宝石和电子设备中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['珠宝和宝石', '电子设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"宝石\" OR t.trade.name == \"电子\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007615327835083008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"电子\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.006100177764892578]]}, {"query": "在珠宝和宝石和电子设备中最高价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['珠宝和宝石', '电子设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"宝石\" OR t.trade.name == \"电子\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006424427032470703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"电子\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005814552307128906]]}, {"query": "哪个是在恒瑞医药和中航沈飞上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['恒瑞医药', '中航沈飞'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.017928123474121094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒瑞医药\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016800403594970703]]}, {"query": "在恒瑞医药和中航沈飞上市公司中最高价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['恒瑞医药', '中航沈飞'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01891040802001953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒瑞医药\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0183103084564209]]}, {"query": "在恒瑞医药和中航沈飞上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['恒瑞医药', '中航沈飞'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01659536361694336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒瑞医药\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.019834041595458984]]}, {"query": "哪个是在电信服务提供商和原材料和农业行业中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电信服务提供商', '原材料', '农业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"农业\" \nRETURN s.stock\nLIMIT 50", 0, 0.03204774856567383], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"农业\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.034119367599487305], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"农业\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.03937959671020508], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"农业\" \nRETURN s.stock\nLIMIT 50", 0, 0.03291916847229004], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"农业\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.037848472595214844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"农业\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04088926315307617]]}, {"query": "在海尔智家和西南证券和五洲交通上市公司中成交量最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['海尔智家', '西南证券', '五洲交通'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"五洲交通\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.017028331756591797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"五洲交通\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01992487907409668]]}, {"query": "哪个是在海尔智家和西南证券和五洲交通上市公司中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['海尔智家', '西南证券', '五洲交通'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"五洲交通\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01720142364501953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"五洲交通\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01584601402282715]]}, {"query": "在消费品和银行行业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['消费品', '银行'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019402503967285156], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017015933990478516]]}, {"query": "在消费品和银行行业中涨跌幅最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['消费品', '银行'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001707315444946289], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017092227935791016]]}, {"query": "国泰君安的收盘价大于10元吗", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国泰君安' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.closing_price > 10\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" WITH sd.stock_data.closing_price > 10 as temp\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.2085578441619873], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price > 10 as temp\nMATCH (s:stock)\nWHERE s.stock.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.010411977767944336], ["MATCH \n\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.00043892860412597656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price > 10 as temp \nRETURN temp\nLIMIT 50", 0, 0.01760077476501465], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" WITH sd.stock_data.closing_price > 10 as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.03867197036743164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.closing_price > 10 as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.0420072078704834], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price > 10 as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.0367887020111084], ["MATCH \n\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004153251647949219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.closing_price > 10 as temp \nRETURN temp\nLIMIT 50", 0, 0.01651144027709961], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price > 10 as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.036736249923706055]]}, {"query": "盘江股份股票的注册资本是不是不大于34", "golden": "MATCH (s:stock) WHERE s.stock.name == '盘江股份' RETURN s.stock.registered_capital <= 34\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"盘江股份\" AND ( s.stock.name == \"盘江股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002214670181274414], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"盘江股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"盘江股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020494461059570312]]}, {"query": "亚通股份股票的注册资本是否大于78", "golden": "MATCH (s:stock) WHERE s.stock.name == '亚通股份' RETURN s.stock.registered_capital > 78\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"亚通股份\" AND ( s.stock.name == \"亚通股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001825571060180664], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"亚通股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"亚通股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018389225006103516]]}, {"query": "亚通股份股票的成立日期是不是早于1998年10月4日", "golden": "MATCH (s:stock) WHERE s.stock.name == '亚通股份' RETURN s.stock.establishment_date < date('1998-10-4')\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"亚通股份\" AND ( s.stock.name == \"亚通股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016827583312988281], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"亚通股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"亚通股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018639564514160156]]}, {"query": "云维股份股票的成立日期是不是不早于1992年6月22日", "golden": "MATCH (s:stock) WHERE s.stock.name == '云维股份' RETURN s.stock.establishment_date >= date('1992-6-22')\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"云维股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"云维股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016911029815673828], ["MATCH (s:stock)\nWHERE s.stock.name == \"云维股份\" AND ( s.stock.name == \"云维股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016965866088867188]]}, {"query": "宝钛股份股票的成立日期是否早于2022年3月22日", "golden": "MATCH (s:stock) WHERE s.stock.name == '宝钛股份' RETURN s.stock.establishment_date < date('2022-3-22')\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝钛股份\" AND ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001661539077758789], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝钛股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017545223236083984]]}, {"query": "宝钛股份股票的成立日期是不是早于2022年3月22日", "golden": "MATCH (s:stock) WHERE s.stock.name == '宝钛股份' RETURN s.stock.establishment_date < date('2022-3-22')\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝钛股份\" AND ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016427040100097656], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝钛股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018477439880371094]]}, {"query": "武钢股份股票的注册资本是否小于79", "golden": "MATCH (s:stock) WHERE s.stock.name == '武钢股份' RETURN s.stock.registered_capital < 79\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"武钢股份\" AND ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015556812286376953], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"武钢股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015263557434082031]]}, {"query": "武钢股份股票的成立日期是不是不晚于1991年5月25日", "golden": "MATCH (s:stock) WHERE s.stock.name == '武钢股份' RETURN s.stock.establishment_date <= date('1991-5-25')\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"武钢股份\" AND ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016624927520751953], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"武钢股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015761852264404297]]}, {"query": "内蒙华电股票的成立日期是否不早于2013年9月24日", "golden": "MATCH (s:stock) WHERE s.stock.name == '内蒙华电' RETURN s.stock.establishment_date >= date('2013-9-24')\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"内蒙华\" OR s.stock.name == \"电股\" ) AND s.stock.name == \"内蒙华电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017774105072021484], ["MATCH (s:stock)\nWHERE s.stock.name == \"内蒙华电\" AND ( s.stock.name == \"内蒙华\" OR s.stock.name == \"电股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017001628875732422]]}, {"query": "宝盈互联网沪港深混合基金的最新规模是不是大于46", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '宝盈互联网沪港深混合' RETURN pof.public_offering_fund.latest_scale > 46\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"互联网\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013461112976074219], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"互联网\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013861656188964844]]}, {"query": "宝盈互联网沪港深混合基金的最新规模是否大于46", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '宝盈互联网沪港深混合' RETURN pof.public_offering_fund.latest_scale > 46\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"互联网\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.001310586929321289], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"互联网\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013821125030517578]]}, {"query": "融通新动力灵活配置混合基金的认购开始时间是否早于1994年3月18日", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通新动力灵活配置混合' RETURN pof.public_offering_fund.subscription_start_time < date('1994-3-18')\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012242794036865234], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"融通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012536048889160156]]}, {"query": "融通新动力灵活配置混合基金的认购开始时间是不是早于1994年3月18日", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通新动力灵活配置混合' RETURN pof.public_offering_fund.subscription_start_time < date('1994-3-18')\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012927055358886719], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"融通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012660026550292969]]}, {"query": "融通新动力灵活配置混合基金的认购结束时间是不是不早于2007年2月8日", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通新动力灵活配置混合' RETURN pof.public_offering_fund.subscription_end_time >= date('2007-2-8')\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013277530670166016], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"融通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012280941009521484]]}, {"query": "纺织品和服装的规模是不是不小于91", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' RETURN n.industry.scale >= 91\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013113021850585938], ["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012807846069335938]]}, {"query": "纺织品和服装的规模是否不小于91", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' RETURN n.industry.scale >= 91\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014262199401855469], ["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013904571533203125]]}, {"query": "航空航天产业的规模是否不小于33", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' RETURN n.industry.scale >= 33\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.003899097442626953], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.004147768020629883]]}, {"query": "航空航天产业的规模是不是不小于33", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' RETURN n.industry.scale >= 33\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.004016399383544922], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0043184757232666016]]}, {"query": "华资实业股票的开盘价是不是大于94", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华资实业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price > 94\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华资实业\" \nRETURN s.stock\nLIMIT 50", 0, 0.018535375595092773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华资实业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017618656158447266]]}, {"query": "华资实业的最高价是否小于51", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华资实业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 51\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华资实业\" \nRETURN s.stock\nLIMIT 50", 0, 0.015664339065551758], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华资实业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01653885841369629]]}, {"query": "华资实业的最低价是不是大于93", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华资实业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price > 93\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华资实业\" \nRETURN s.stock\nLIMIT 50", 0, 0.01732659339904785], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华资实业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.022705078125]]}, {"query": "华资实业股票的涨跌幅是不是不小于11", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华资实业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range >= 11\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华资实业\" \nRETURN s.stock\nLIMIT 50", 0, 0.017321109771728516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华资实业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017618179321289062]]}, {"query": "华资实业上市公司的成交量是不是不小于54", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华资实业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume >= 54\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华资实业\" \nRETURN s.stock\nLIMIT 50", 0, 0.018009185791015625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华资实业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01677083969116211]]}, {"query": "光明乳业股票的开盘价是不是小于32", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price < 32\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015439033508300781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN s.stock\nLIMIT 50", 0, 0.01584458351135254]]}, {"query": "光明乳业上市公司的收盘价是不是不大于87", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.closing_price <= 87\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015462398529052734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN s.stock\nLIMIT 50", 0, 0.01665353775024414]]}, {"query": "光明乳业的最高价是否不小于23", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price >= 23\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017502307891845703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN s.stock\nLIMIT 50", 0, 0.016319990158081055]]}, {"query": "光明乳业的最低价是不是不小于15", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 15\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017830610275268555], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN s.stock\nLIMIT 50", 0, 0.016779422760009766]]}, {"query": "光明乳业的最低价是否不小于15", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 15\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01613140106201172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN s.stock\nLIMIT 50", 0, 0.015151739120483398]]}, {"query": "光明乳业股票的涨跌幅是不是不小于68", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range >= 68\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016425371170043945], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"光明乳业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0173797607421875]]}]