[{"query": "兰花科创和南京化纤股票的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '兰花科创' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '南京化纤' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"兰花科创\" OR s.stock.name == \"南京化纤\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.023514509201049805], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"兰花科创\" OR s.stock.name == \"南京化纤\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021125316619873047]]}, {"query": "金融服务和家庭和个人用品的开盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '家庭和个人用品' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.009633779525756836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006577730178833008]]}, {"query": "金融服务和家庭和个人用品的开盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '家庭和个人用品' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.009650230407714844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.010222434997558594]]}, {"query": "金融服务和家庭和个人用品的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '家庭和个人用品' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006110668182373047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0004146099090576172]]}, {"query": "电力工具和设备和化学行业的涨跌幅差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018774986267089844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"化学\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0184175968170166], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.017891645431518555], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化学\" AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.01770615577697754], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.017169952392578125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.018137693405151367]]}, {"query": "电力工具和设备和化学行业的涨跌幅差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005898475646972656], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化学\" AND indus.industry.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.00041961669921875], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化学\" \nRETURN temp\nLIMIT 50", 0, 0.00030159950256347656], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.0002548694610595703], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"化学\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003707408905029297], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" AND indus.industry.name == \"化学\" \nRETURN temp\nLIMIT 50", 0, 0.0003590583801269531]]}, {"query": "蓝科高新和ST海越的开盘价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '蓝科高新' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == 'ST海越' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST海\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0021865367889404297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST海\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018494129180908203]]}, {"query": "蓝科高新和ST海越的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '蓝科高新' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == 'ST海越' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST海\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020530223846435547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST海\" \nRETURN s.stock\nLIMIT 50", 0, 0.002059459686279297]]}, {"query": "电信服务提供商和工业行业的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '工业' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0004885196685791016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00033545494079589844]]}, {"query": "电信服务提供商和工业行业的开盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '工业' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0077211856842041016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006566762924194336]]}, {"query": "恒生电子和中路股份股票的成交量差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '恒生电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中路股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒生电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.019428014755249023], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒生电子\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017295360565185547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒生电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.002149820327758789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒生电子\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.020180702209472656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"恒生电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.002418994903564453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"恒生电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002054452896118164]]}, {"query": "恒生电子和中路股份股票的成交量差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '恒生电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中路股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"恒生电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005629062652587891], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒生电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.00038433074951171875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒生电子\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.0004401206970214844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒生电子\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00030875205993652344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒生电子\" \nRETURN temp\nLIMIT 50", 0, 0.00027108192443847656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"恒生电子\" \nRETURN temp\nLIMIT 50", 0, 0.0002288818359375]]}, {"query": "恒生电子和中路股份股票的成交量差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '恒生电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中路股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒生电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.01962757110595703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒生电子\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017782926559448242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒生电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020661354064941406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒生电子\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.01542806625366211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"恒生电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017447471618652344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"恒生电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016303062438964844]]}, {"query": "长春一东和黄山旅游上市公司的涨跌幅差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长春一东' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '黄山旅游' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"长春一东\" OR s.stock.name == \"黄山旅游\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019197702407836914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"长春一东\" OR s.stock.name == \"黄山旅游\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02246999740600586]]}, {"query": "长春一东和黄山旅游上市公司的涨跌幅差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长春一东' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '黄山旅游' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"长春一东\" OR s.stock.name == \"黄山旅游\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0007493495941162109], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"长春一东\" OR s.stock.name == \"黄山旅游\" ) \nRETURN temp\nLIMIT 50", 0, 0.0006012916564941406]]}, {"query": "原材料和电信设备的涨跌幅差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.02100992202758789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN t.trade\nLIMIT 50", 0, 0.018663406372070312]]}, {"query": "原材料和电信设备的涨跌幅差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.019352197647094727], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN t.trade\nLIMIT 50", 0, 0.017255544662475586]]}, {"query": "原材料和电信设备的涨跌幅差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN temp\nLIMIT 50", 0, 0.0006320476531982422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005104541778564453]]}, {"query": "在晋控煤业和*ST宜生股票中涨跌幅最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['晋控煤业', '*ST宜生'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.002090930938720703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宜\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017917156219482422]]}, {"query": "在晋控煤业和*ST宜生股票中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['晋控煤业', '*ST宜生'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020661354064941406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宜\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019176006317138672]]}, {"query": "哪个是在晋控煤业和*ST宜生股票中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['晋控煤业', '*ST宜生'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.001760721206665039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宜\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016167163848876953]]}, {"query": "在媒体和娱乐和污水处理和金属和矿业行业中收盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['媒体和娱乐', '污水处理', '金属和矿业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND ( t.trade.name == \"水处理\" OR t.trade.name == \"金属\" ) \nRETURN t.trade, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.006761074066162109], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"水处理\" OR t.trade.name == \"金属\" ) AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.005922555923461914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"水处理\" OR t.trade.name == \"金属\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.00614166259765625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND ( t.trade.name == \"水处理\" OR t.trade.name == \"金属\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.006041049957275391], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"水处理\" OR t.trade.name == \"金属\" ) AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.008269548416137695], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"水处理\" OR t.trade.name == \"金属\" ) \nRETURN t.trade, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.007822751998901367]]}, {"query": "在*ST金山和城市传媒和贵州茅台上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['*ST金山', '城市传媒', '贵州茅台'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"贵州茅台\" AND s.stock.name == \"ST金\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.017386674880981445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"贵州茅台\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST金\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016885757446289062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST金\" AND s.stock.name == \"贵州茅台\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.001963376998901367], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST金\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"贵州茅台\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017740726470947266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"贵州茅台\" AND s.stock.name == \"ST金\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.019840240478515625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST金\" AND s.stock.name == \"贵州茅台\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017673969268798828]]}, {"query": "在家居用品和能源中涨跌幅最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['家居用品', '能源'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"能源\" AND indus.industry.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018584251403808594], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.001834869384765625], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"家居\" AND indus.industry.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017275810241699219], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.017017602920532227], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"能源\" AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.01818990707397461], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"家居\" AND indus.industry.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019080638885498047]]}, {"query": "哪个是在东方电气和*ST宜生和宝泰隆中开盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['东方电气', '*ST宜生', '宝泰隆'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宜\" AND s.stock.name == \"东方电\" \nRETURN s.stock\nLIMIT 50", 0, 0.002064943313598633], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宜\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方电\" \nRETURN s.stock\nLIMIT 50", 0, 0.001821756362915039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宜\" AND s.stock.name == \"东方电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017688274383544922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方电\" AND s.stock.name == \"ST宜\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016748905181884766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方电\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016393661499023438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方电\" AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015897750854492188]]}]