[{"query": "最高价不大于凌钢股份股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '凌钢股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凌钢股份\" AND ( s.stock.name == \"凌钢股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.14312267303466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"凌钢股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"凌钢股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.07390928268432617], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凌钢股份\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"凌钢股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.054388999938964844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"凌钢股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"凌钢股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.03355240821838379], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"凌钢股份\" AND ( s.stock.name == \"凌钢股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.01815938949584961], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"凌钢股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"凌钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.018343687057495117]]}, {"query": "哪些股票的最高价不比凌钢股份大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '凌钢股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凌钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0008208751678466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"凌钢股份\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0004658699035644531]]}, {"query": "最低价大于酒店和度假村行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 8.062570810317993], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.051146507263183594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.03706789016723633]]}, {"query": "哪些行业的最低价比酒店和度假村大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.020360469818115234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.004441261291503906]]}, {"query": "哪些股票的成交量不比长城电工小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长城电工' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.07637238502502441], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"长城电\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0571444034576416]]}, {"query": "最高价大于华发股份上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华发股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.04966878890991211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.041461944580078125]]}, {"query": "哪些上市公司的最高价比华发股份大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华发股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.001064300537109375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN n.name\nLIMIT 50", 0, 0.039292335510253906]]}, {"query": "收盘价大于珠宝和宝石行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.008533716201782227], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.012920856475830078]]}, {"query": "哪些行业的收盘价比珠宝和宝石大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0007414817810058594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0005011558532714844]]}, {"query": "最低价大于三峡能源上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '三峡能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.03783750534057617], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.002422809600830078]]}, {"query": "哪些上市公司的最低价比三峡能源大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '三峡能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.0009090900421142578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN n.name\nLIMIT 50", 0, 0.0005695819854736328]]}, {"query": "哪些行业的最低价不比石油和天然气小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.07098960876464844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.03714323043823242]]}, {"query": "哪些上市公司的涨跌幅不比冠豪高新小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '冠豪高新' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"冠豪高\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.039739370346069336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"冠豪高\" \nRETURN s.stock\nLIMIT 50", 0, 0.024898767471313477]]}, {"query": "最低价不大于电信服务提供商行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.07482028007507324], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.017800092697143555]]}, {"query": "哪些行业的最低价不比电信服务提供商大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.03513956069946289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.022066354751586914]]}, {"query": "收盘价不小于空港股份上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '空港股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.03597521781921387], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002480745315551758]]}, {"query": "哪些上市公司的收盘价不比空港股份小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '空港股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.02977299690246582], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN n.name\nLIMIT 50", 0, 0.0006301403045654297]]}, {"query": "最高价大于酒店和度假村行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" WITH td.trade_data.maximum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.13707661628723145], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" WITH td.trade_data.maximum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND td.trade_data.maximum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.030052661895751953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" WITH td.trade_data.maximum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 7.735264539718628]]}, {"query": "哪些行业的最高价比酒店和度假村大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.012052059173583984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0035207271575927734]]}, {"query": "哪些股票的最低价不比交运股份小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '交运股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"交运股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0026009082794189453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"交运股份\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0005083084106445312]]}, {"query": "最高价不大于汽车制造行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车制造' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.038163185119628906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.06452751159667969]]}, {"query": "哪些行业的最高价不比汽车制造大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车制造' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0007855892181396484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00042891502380371094]]}, {"query": "最高价等于均胜电子股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '均胜电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.040059804916381836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.1037287712097168]]}, {"query": "哪些股票的最高价和均胜电子相等", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '均胜电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.07638907432556152], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.037673234939575195]]}, {"query": "最低价不大于房地产行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '房地产' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"房地产\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.05721163749694824], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"房地产\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.039337158203125]]}, {"query": "成交量不小于维科技术股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '维科技术' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.03885078430175781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.003011941909790039]]}, {"query": "哪些股票的成交量不比维科技术小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '维科技术' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0008461475372314453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0003573894500732422]]}, {"query": "哪些行业的开盘价不比媒体和娱乐小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0020132064819335938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0007560253143310547]]}, {"query": "哪些行业的开盘价和珠宝和宝石一样大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.01583099365234375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.008197784423828125]]}, {"query": "哪些行业的涨跌幅不比医疗设备小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.05399131774902344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.003501415252685547]]}, {"query": "哪些上市公司的最高价不比亚星化学小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '亚星化学' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"亚星化学\" \nRETURN n.name\nLIMIT 50", 0, 0.009423017501831055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"亚星化学\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.04835152626037598]]}, {"query": "涨跌幅等于华塑股份股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华塑股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.040488243103027344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.06018710136413574]]}, {"query": "哪些股票的涨跌幅和华塑股份一样大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华塑股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.07681894302368164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.00434112548828125]]}, {"query": "哪些行业的开盘价比医疗保健设施小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.017673492431640625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.02445244789123535]]}, {"query": "哪些行业的最低价比医疗设备小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.007477521896362305], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.004360675811767578]]}, {"query": "最低价小于中信金属股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中信金属' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金属\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.06856799125671387], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金属\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.004518032073974609]]}, {"query": "哪些股票的最低价比中信金属小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中信金属' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金属\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0008242130279541016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金属\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.004331827163696289]]}, {"query": "哪些行业的开盘价和航空公司一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.021591663360595703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.009319067001342773]]}, {"query": "成交量不小于国新能源上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国新能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.07873272895812988], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.006788492202758789]]}]