[{"query": "有哪些托管给郑洛阳基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '郑洛阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"郑洛阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013892650604248047], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"郑洛阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014040470123291016]]}, {"query": "数团源讯股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '数团源讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"数团源讯\" AND ( s.stock.name == \"团源\" OR s.stock.name == \"讯股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013375282287597656], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"团源\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"数团源讯\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013422966003417969]]}, {"query": "有哪些股东是数团源讯股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '数团源讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"团源\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"数团源讯\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002987384796142578], ["MATCH (s:stock)\nWHERE s.stock.name == \"数团源讯\" AND ( s.stock.name == \"团源\" OR s.stock.name == \"讯股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00023317337036132812]]}, {"query": "有融公务股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '有融公务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"有融公务\" AND ( s.stock.name == \"有融\" OR s.stock.name == \"公务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.00147247314453125], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"有融\" OR s.stock.name == \"公务\" ) AND s.stock.name == \"有融公务\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014221668243408203]]}, {"query": "有哪些股东是有融公务股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '有融公务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"有融公务\" AND ( s.stock.name == \"有融\" OR s.stock.name == \"公务\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003418922424316406], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"有融\" OR s.stock.name == \"公务\" ) AND s.stock.name == \"有融公务\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002989768981933594]]}, {"query": "有哪些托管给吴百里基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吴百里' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴百里\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013408660888671875], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吴百里\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013909339904785156]]}, {"query": "天弘中证全指医疗保健设备与服务ETF公募基金的股票", "golden": "MATCH (pof1:public_offering_fund)-[h:hold]->(s2:stock) WHERE pof1.public_offering_fund.name == '天弘中证全指医疗保健设备与服务ETF' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"服务\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012831687927246094], ["MATCH (s:stock)\nWHERE s.stock.name == \"服务\" AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012674331665039062]]}, {"query": "有哪些属于天弘中证全指医疗保健设备与服务ETF基金的股票", "golden": "MATCH (pof1:public_offering_fund)-[h:hold]->(s2:stock) WHERE pof1.public_offering_fund.name == '天弘中证全指医疗保健设备与服务ETF' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"服务\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012040138244628906], ["MATCH (s:stock)\nWHERE s.stock.name == \"服务\" AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012552738189697266]]}, {"query": "资有药产限股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资有药产限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资有药产限\" AND ( s.stock.name == \"资有\" OR s.stock.name == \"药产\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0012485980987548828], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"资有\" OR s.stock.name == \"药产\" ) AND s.stock.name == \"资有药产限\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013070106506347656]]}, {"query": "有哪些股东是资有药产限股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资有药产限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资有药产限\" AND ( s.stock.name == \"资有\" OR s.stock.name == \"药产\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003299713134765625], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"资有\" OR s.stock.name == \"药产\" ) AND s.stock.name == \"资有药产限\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003020763397216797]]}, {"query": "李夏侯基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '李夏侯' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"李夏侯\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014367103576660156], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"李夏侯\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014641284942626953]]}, {"query": "药科制股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '药科制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"药科制\" AND ( s.stock.name == \"药科\" OR s.stock.name == \"制股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013897418975830078], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"药科\" OR s.stock.name == \"制股\" ) AND s.stock.name == \"药科制\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012989044189453125]]}, {"query": "有哪些股东是药科制股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '药科制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"药科\" OR s.stock.name == \"制股\" ) AND s.stock.name == \"药科制\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003075599670410156], ["MATCH (s:stock)\nWHERE s.stock.name == \"药科制\" AND ( s.stock.name == \"药科\" OR s.stock.name == \"制股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00023818016052246094]]}, {"query": "有哪些托管给杨上官基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '杨上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"杨上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013854503631591797], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013384819030761719]]}, {"query": "陶上官基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陶上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014350414276123047], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陶上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001392364501953125]]}, {"query": "有哪些托管给陶上官基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陶上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013718605041503906], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陶上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014145374298095703]]}, {"query": "有哪些托管给魏万俟基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏万俟' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏万俟\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014150142669677734], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏万俟\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001512289047241211]]}, {"query": "有哪些托管给孔太叔基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔太叔' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔太叔\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001641988754272461], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔太叔\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014903545379638672]]}, {"query": "有哪些名下有五洲交通股票的董事长", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '五洲交通' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( s.stock.name == \"五洲交\" OR s.stock.name == \"通股\" ) AND s.stock.name == \"五洲交通\" \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.002142667770385742], ["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE s.stock.name == \"五洲交通\" AND ( s.stock.name == \"五洲交\" OR s.stock.name == \"通股\" ) \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.0021581649780273438]]}, {"query": "有哪些名下有彩虹股份股票的董事长", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '彩虹股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE s.stock.name == \"彩虹股份\" AND ( s.stock.name == \"彩虹股\" OR s.stock.name == \"份股\" ) \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.0022978782653808594], ["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( s.stock.name == \"彩虹股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"彩虹股份\" \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.0020470619201660156]]}, {"query": "魏北门基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏北门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏北门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015177726745605469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏北门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014312267303466797]]}, {"query": "戚左丘基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '戚左丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"戚左丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014569759368896484], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"戚左丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015532970428466797]]}, {"query": "国泰上证综合ETF联接A公募基金托管给的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '国泰上证综合ETF联接A' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013055801391601562], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013728141784667969]]}, {"query": "电子设备产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电子设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014698505401611328], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013539791107177734]]}, {"query": "有哪些上游是电子设备产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电子设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014960765838623047], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014023780822753906]]}, {"query": "赵长孙基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015153884887695312], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014660358428955078]]}, {"query": "有哪些托管给赵长孙基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014774799346923828], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001604318618774414]]}, {"query": "狮头股份股票关联的公募基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '狮头股份' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"狮头股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"狮头股份\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002791166305541992], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"狮头股份\" AND ( s.stock.name == \"狮头股\" OR s.stock.name == \"份股\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002819538116455078]]}, {"query": "有哪些持有狮头股份股票的公募基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '狮头股份' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"狮头股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"狮头股份\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0030782222747802734], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"狮头股份\" AND ( s.stock.name == \"狮头股\" OR s.stock.name == \"份股\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0029528141021728516]]}, {"query": "有哪些提到国泰国证绿色电力ETF发起联接A基金的新闻", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '国泰国证绿色电力ETF发起联接A' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"电力\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013701915740966797], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"电力\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013849735260009766]]}, {"query": "有哪些托管给孙亓基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孙亓' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孙亓\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015177726745605469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孙亓\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014729499816894531]]}, {"query": "秦赫连基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014243125915527344], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014541149139404297]]}, {"query": "有哪些提到迪马股份股票的讯息", "golden": "MATCH (s1:stock)-[iv:involve]->(i2:information) WHERE s1.stock.name == '迪马股份' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"迪马股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"迪马股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017566680908203125], ["MATCH (s:stock)\nWHERE s.stock.name == \"迪马股份\" AND ( s.stock.name == \"迪马股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018067359924316406]]}, {"query": "医科限股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '医科限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"医科\" OR s.stock.name == \"限股\" ) AND s.stock.name == \"医科限\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013511180877685547], ["MATCH (s:stock)\nWHERE s.stock.name == \"医科限\" AND ( s.stock.name == \"医科\" OR s.stock.name == \"限股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001417398452758789]]}, {"query": "有哪些股东是医科限股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '医科限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医科限\" AND ( s.stock.name == \"医科\" OR s.stock.name == \"限股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003323554992675781], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"医科\" OR s.stock.name == \"限股\" ) AND s.stock.name == \"医科限\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003046989440917969]]}, {"query": "ST中安和东方创业的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST中安' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '东方创业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"ST中\" AND s.stock.name == \"东方创业\" \nRETURN temp\nLIMIT 50", 0, 0.0005409717559814453], ["MATCH (s:stock)\nWHERE s.stock.name == \"东方创业\" AND s.stock.name == \"ST中\" \nRETURN temp\nLIMIT 50", 0, 0.00041103363037109375]]}, {"query": "ST中安和东方创业的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST中安' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '东方创业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"ST中\" AND s.stock.name == \"东方创业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015246868133544922], ["MATCH (s:stock)\nWHERE s.stock.name == \"东方创业\" AND s.stock.name == \"ST中\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018854141235351562]]}, {"query": "邹西门和曹百里的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '邹西门' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '曹百里' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"邹西门\" OR fm.fund_manager.name == \"曹百里\" ) AND fm.fund_manager.name == \"邹西门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"邹西门\" OR fm.fund_manager.name == \"曹百里\" ) AND fm.fund_manager.name == \"曹百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"邹西门\" OR fm.fund_manager.name == \"曹百里\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002930164337158203], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"邹西门\" OR fm.fund_manager.name == \"曹百里\" ) AND fm.fund_manager.name == \"邹西门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"邹西门\" OR fm.fund_manager.name == \"曹百里\" ) AND fm.fund_manager.name == \"曹百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002608299255371094], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"邹西门\" OR fm.fund_manager.name == \"曹百里\" ) AND fm.fund_manager.name == \"邹西门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"曹百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00031757354736328125], ["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"邹西门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"曹百里\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"邹西门\" OR fm.fund_manager.name == \"曹百里\" ) \nRETURN temp\nLIMIT 50", 0, 0.00031685829162597656]]}, {"query": "汽车零部件和污水处理的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '污水处理' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"水处理\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017173290252685547], ["MATCH (t:trade)\nWHERE t.trade.name == \"水处理\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013689994812011719]]}, {"query": "汽车零部件和污水处理的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '污水处理' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"水处理\" \nRETURN temp\nLIMIT 50", 0, 0.00030732154846191406], ["MATCH (t:trade)\nWHERE t.trade.name == \"水处理\" AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.000255584716796875]]}, {"query": "汽车零部件和污水处理的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '污水处理' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"水处理\" \nRETURN t.trade\nLIMIT 50", 0, 0.001756429672241211], ["MATCH (t:trade)\nWHERE t.trade.name == \"水处理\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013360977172851562]]}, {"query": "家居用品和农业产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"家居\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017974376678466797], ["MATCH (t:trade)\nWHERE t.trade.name == \"家居\" AND t.trade.name == \"农业\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013053417205810547]]}, {"query": "家居用品和农业产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"家居\" \nRETURN temp\nLIMIT 50", 0, 0.0005865097045898438], ["MATCH (t:trade)\nWHERE t.trade.name == \"家居\" AND t.trade.name == \"农业\" \nRETURN temp\nLIMIT 50", 0, 0.0002651214599609375]]}, {"query": "秦南宫和何谷梁的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '秦南宫' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '何谷梁' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦南宫\" OR fm.fund_manager.name == \"何谷梁\" ) AND fm.fund_manager.name == \"秦南宫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦南宫\" OR fm.fund_manager.name == \"何谷梁\" ) AND fm.fund_manager.name == \"何谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0045735836029052734], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦南宫\" OR fm.fund_manager.name == \"何谷梁\" ) AND fm.fund_manager.name == \"秦南宫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦南宫\" OR fm.fund_manager.name == \"何谷梁\" ) AND fm.fund_manager.name == \"何谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"秦南宫\" OR fm.fund_manager.name == \"何谷梁\" ) \nRETURN temp\nLIMIT 50", 0, 0.004975080490112305], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"秦南宫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"何谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"秦南宫\" OR fm.fund_manager.name == \"何谷梁\" ) \nRETURN temp\nLIMIT 50", 0, 0.004556179046630859], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦南宫\" OR fm.fund_manager.name == \"何谷梁\" ) AND fm.fund_manager.name == \"秦南宫\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"何谷梁\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004410266876220703]]}, {"query": "汽车零部件和农业产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"农业\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017256736755371094], ["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017397403717041016]]}, {"query": "汽车零部件和农业产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"农业\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017628669738769531], ["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018494129180908203]]}, {"query": "汽车零部件和农业产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.00033974647521972656], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"农业\" \nRETURN temp\nLIMIT 50", 0, 0.00025844573974609375]]}, {"query": "电信服务提供商和食品和饮料的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.003423452377319336], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.003699064254760742]]}]