[{"query": "股票玉龙股份2017年第三季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '玉龙股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.001699686050415039], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0017817020416259766], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0019745826721191406], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015747547149658203], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0016281604766845703], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015716552734375]]}, {"query": "2017年7到9月股票玉龙股份的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '玉龙股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015439987182617188], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015485286712646484]]}, {"query": "股票杭州银行2016年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '杭州银行' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"银行\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0017347335815429688], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"银行\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0017795562744140625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"银行\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016388893127441406], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"银行\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001547098159790039], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"银行\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015892982482910156], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"银行\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015208721160888672]]}, {"query": "2016年1到3月股票杭州银行的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '杭州银行' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"银行\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015377998352050781], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"银行\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016341209411621094]]}, {"query": "股票陕建股份2016年第一季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '陕建股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.001695871353149414], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0017170906066894531], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0016207695007324219], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015559196472167969], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0016543865203857422], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015082359313964844]]}, {"query": "股票电科芯片2016年第一季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '电科芯片' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"电科\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015454292297363281], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"电科\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0016062259674072266], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"电科\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015478134155273438], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"电科\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015323162078857422], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"电科\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.001531839370727539], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"电科\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.001481771469116211]]}, {"query": "2016年1到3月股票电科芯片的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '电科芯片' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"电科\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0014832019805908203], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"电科\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015997886657714844]]}, {"query": "股票退市西水2017年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '退市西水' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN s.stock\nLIMIT 50", 0, 0.0004093647003173828], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0004119873046875]]}, {"query": "股票陕建股份2017年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '陕建股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014960765838623047], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014963150024414062], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014624595642089844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014624595642089844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001367807388305664], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0013933181762695312]]}, {"query": "2016年1到3月股票中航电子的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '中航电子' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"电子\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016438961029052734], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"电子\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0020453929901123047]]}, {"query": "股票山东钢铁2016年第一季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '山东钢铁' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0004892349243164062], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 \nRETURN s.stock\nLIMIT 50", 0, 0.0004239082336425781]]}, {"query": "股票中粮糖业2017年第二季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '中粮糖业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 \nRETURN s.stock\nLIMIT 50", 0, 0.00043511390686035156], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.00038504600524902344]]}, {"query": "股票博汇纸业2013年第四季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '博汇纸业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.000476837158203125], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 4 \nRETURN s.stock\nLIMIT 50", 0, 0.00044226646423339844]]}, {"query": "股票百花医药2016年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '百花医药' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0005316734313964844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0006072521209716797], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0005202293395996094], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0004582405090332031], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0004775524139404297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.000545501708984375]]}, {"query": "2016年7到9月股票百花医药的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '百花医药' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0004169940948486328], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0005199909210205078]]}, {"query": "股票丹化科技2016年第二季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '丹化科技' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015861988067626953], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015802383422851562], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014636516571044922], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"科技\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014581680297851562], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016376972198486328], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"科技\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014638900756835938]]}, {"query": "2016年4到6月股票丹化科技的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '丹化科技' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015506744384765625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015614032745361328]]}, {"query": "股票华夏银行2016年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '华夏银行' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"华夏银行\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026907920837402344], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"华夏银行\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002629518508911133], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"华夏银行\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002706289291381836], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"华夏银行\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.00278472900390625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"华夏银行\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0027539730072021484], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"华夏银行\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0027167797088623047]]}, {"query": "2016年1到3月股票华夏银行的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '华夏银行' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"华夏银行\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026552677154541016], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"华夏银行\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026628971099853516]]}]