[{"query": "2022年1月22日哪些上市公司的涨跌幅是靠前的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-1-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0004730224609375], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04809832572937012], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006232261657714844], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05086565017700195]]}, {"query": "2020年6月18日涨跌幅靠前的行业是哪些", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-6-18') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.013276100158691406], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.013560056686401367], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.00043392181396484375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.00040030479431152344]]}, {"query": "2022年1月22日涨跌幅靠后的行业是哪些", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2022-1-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004169940948486328], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012035131454467773], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00040221214294433594], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013622283935546875]]}, {"query": "2020年4月1日涨跌幅靠前的上市公司是哪些", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-4-1') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0439600944519043], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0006320476531982422], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0004131793975830078], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.047804832458496094]]}, {"query": "2020年4月1日涨跌幅靠前的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-4-1') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.05058932304382324], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0006420612335205078], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0005123615264892578], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-1\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0574190616607666]]}, {"query": "2020年6月18日哪些行业的涨跌幅是靠前的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-6-18') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.012150287628173828], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0005958080291748047], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.011665582656860352], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-18\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004889965057373047]]}, {"query": "2022年1月22日涨跌幅靠前的上市公司是哪些", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-1-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.00044989585876464844], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0003898143768310547], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.05027198791503906], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.05297350883483887]]}, {"query": "2022年1月22日涨跌幅靠前的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-1-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.000583648681640625], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0003991127014160156], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.05226302146911621], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.049394845962524414]]}, {"query": "在退市昆机和隆基绿能和天富能源上市公司中开盘价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['退市昆机', '隆基绿能', '天富能源'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002002239227294922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016276836395263672]]}, {"query": "在退市昆机和隆基绿能和天富能源上市公司中开盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['退市昆机', '隆基绿能', '天富能源'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017926692962646484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016014575958251953]]}, {"query": "哪个是在纺织品和服装和电信和能源中最低价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['纺织品和服装', '电信', '能源'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018694400787353516], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"电信\" ) AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017087459564208984], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"电信\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017621517181396484], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"电信\" ) AND indus.industry.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001653432846069336], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016095638275146484], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"电信\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016155242919921875]]}, {"query": "在天士力和上港集团和广晟有色上市公司中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['天士力', '上港集团', '广晟有色'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"天士力\" OR s.stock.name == \"上港集\" ) \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.01816272735595703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"天士力\" OR s.stock.name == \"上港集\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.017701148986816406]]}, {"query": "哪个是在房地产和汽车零部件和汽车制造行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['房地产', '汽车零部件', '汽车制造'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"制造\" ) AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"汽车\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.1913459300994873], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"汽车\" ) AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"制造\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.1729602813720703], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"汽车\" OR indus.industry.name == \"制造\" ) AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.18049287796020508], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"汽车\" OR indus.industry.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"汽车\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17626500129699707], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"房地产\" OR indus.industry.name == \"汽车\" ) AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17125535011291504], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"房地产\" OR indus.industry.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"制造\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.1730201244354248]]}, {"query": "在洪都航空和华建集团和创兴资源中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['洪都航空', '华建集团', '创兴资源'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"洪都航空\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0022728443145751953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"洪都航空\" AND s.stock.name == \"资源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.02010369300842285], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"洪都航空\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"资源\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01871037483215332], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND s.stock.name == \"洪都航空\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0018646717071533203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"洪都航空\" AND s.stock.name == \"资源\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0165708065032959], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"资源\" AND s.stock.name == \"洪都航空\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0019834041595458984]]}, {"query": "哪个是在电信设备和船舶和海运和电信行业中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电信设备', '船舶和海运', '电信'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.018172025680541992], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" AND indus.industry.name == \"电信\" AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.018700361251831055], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" AND t.trade.name == \"船舶\" \nRETURN s.stock\nLIMIT 50", 0, 0.01981377601623535], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" AND indus.industry.name == \"电信\" AND t.trade.name == \"船舶\" \nRETURN s.stock\nLIMIT 50", 0, 0.01912522315979004], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.01830887794494629], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND t.trade.name == \"船舶\" AND indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017086505889892578], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" \nRETURN s.stock\nLIMIT 50", 0, 0.02270030975341797], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND indus.industry.name == \"电信\" AND indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018808364868164062], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" AND t.trade.name == \"船舶\" AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.01901698112487793], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.02005910873413086], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.01848769187927246], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND indus.industry.name == \"电信\" AND t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0208437442779541]]}, {"query": "在皖通高速和西部黄金和国芳集团中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['皖通高速', '西部黄金', '国芳集团'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"皖通高速\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.019192934036254883], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"皖通高速\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.017420291900634766]]}]