[{"query": "有哪些托管给王孙侨基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '王孙侨' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"王孙侨\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013968944549560547], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"王孙侨\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014519691467285156]]}, {"query": "赵南门基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001299142837524414], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014340877532958984]]}, {"query": "建筑产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '建筑' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018162727355957031], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001974821090698242]]}, {"query": "有哪些上游是建筑产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '建筑' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016818046569824219], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002111673355102539]]}, {"query": "集技融金股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '集技融金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"集技\" OR s.stock.name == \"融金\" ) AND s.stock.name == \"集技融金\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018625259399414062], ["MATCH (s:stock)\nWHERE s.stock.name == \"集技融金\" AND ( s.stock.name == \"集技\" OR s.stock.name == \"融金\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015139579772949219]]}, {"query": "有哪些股东是集技融金股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '集技融金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"集技融金\" AND ( s.stock.name == \"集技\" OR s.stock.name == \"融金\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003542900085449219], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"集技\" OR s.stock.name == \"融金\" ) AND s.stock.name == \"集技融金\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00028824806213378906]]}, {"query": "邹独孤基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '邹独孤' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"邹独孤\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014107227325439453], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"邹独孤\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014085769653320312]]}, {"query": "有哪些托管给邹独孤基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '邹独孤' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"邹独孤\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014469623565673828], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"邹独孤\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00144195556640625]]}, {"query": "有哪些托管给冯呼延基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '冯呼延' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"冯呼延\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014371871948242188], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"冯呼延\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014917850494384766]]}, {"query": "有哪些托管给孔仲孙基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔仲孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔仲孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014820098876953125], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔仲孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001447439193725586]]}, {"query": "有哪些托管给孔宇文基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔宇文' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔宇文\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013720989227294922], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔宇文\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013916492462158203]]}, {"query": "公技电据股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '公技电据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"公技电据\" AND ( s.stock.name == \"技电\" OR s.stock.name == \"据股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0012154579162597656], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"技电\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"公技电据\" \nRETURN s.stock\nLIMIT 50", 0, 0.001355886459350586]]}, {"query": "有哪些股东是公技电据股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '公技电据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"技电\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"公技电据\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00032639503479003906], ["MATCH (s:stock)\nWHERE s.stock.name == \"公技电据\" AND ( s.stock.name == \"技电\" OR s.stock.name == \"据股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00025272369384765625]]}, {"query": "有哪些托管给水亓基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '水亓' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"水亓\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014941692352294922], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"水亓\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013642311096191406]]}, {"query": "兰生股份股票的老板", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '兰生股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"兰生股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"兰生股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.00177001953125], ["MATCH (s:stock)\nWHERE s.stock.name == \"兰生股份\" AND ( s.stock.name == \"兰生股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016970634460449219]]}, {"query": "孙东方基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孙东方' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孙东方\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001493692398071289], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孙东方\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013968944549560547]]}, {"query": "周南门基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '周南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"周南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015606880187988281], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"周南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001268148422241211]]}, {"query": "张诸葛基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '张诸葛' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"张诸葛\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013587474822998047], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"张诸葛\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014400482177734375]]}, {"query": "有哪些托管给沈南门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '沈南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"沈南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015325546264648438], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014853477478027344]]}, {"query": "钱黎丘基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '钱黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"钱黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014367103576660156], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"钱黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014503002166748047]]}, {"query": "有哪些托管给钱黎丘基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '钱黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"钱黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014801025390625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"钱黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014641284942626953]]}, {"query": "富国新能源汽车A基金的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '富国新能源汽车A' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND ( pof.public_offering_fund.name == \"能源\" OR pof.public_offering_fund.name == \"汽车\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013744831085205078], ["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"能源\" OR pof.public_offering_fund.name == \"汽车\" ) AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013804435729980469]]}, {"query": "华司空基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '华司空' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"华司空\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015263557434082031], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"华司空\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017011165618896484]]}, {"query": "媒体和娱乐产业关联的股票", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '媒体和娱乐' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"娱乐\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015454292297363281], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015430450439453125]]}, {"query": "万家陆家嘴金融城金融债一年定开债券基金涉及的新闻", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '万家陆家嘴金融城金融债一年定开债券' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) AND pof.public_offering_fund.name == \"金融\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.001466989517211914], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金融\" AND ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0015273094177246094]]}, {"query": "有哪些提到万家陆家嘴金融城金融债一年定开债券基金的公告", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '万家陆家嘴金融城金融债一年定开债券' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) AND pof.public_offering_fund.name == \"金融\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013985633850097656], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金融\" AND ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0014538764953613281]]}, {"query": "技公份股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技公份' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"技公\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"技公份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001463174819946289], ["MATCH (s:stock)\nWHERE s.stock.name == \"技公份\" AND ( s.stock.name == \"技公\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014104843139648438]]}, {"query": "有哪些股东是技公份股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技公份' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"技公\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"技公份\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030732154846191406], ["MATCH (s:stock)\nWHERE s.stock.name == \"技公份\" AND ( s.stock.name == \"技公\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00023102760314941406]]}, {"query": "有哪些托管给孙微生基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孙微生' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孙微生\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016117095947265625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孙微生\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00153350830078125]]}, {"query": "能源产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '能源' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018262863159179688], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002093076705932617]]}, {"query": "有哪些上游是能源产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '能源' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001963376998901367], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002122640609741211]]}, {"query": "有哪些股东是集环技通有股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '集环技通有' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"集环\" AND s.stock.name == \"通有\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00029349327087402344], ["MATCH (s:stock)\nWHERE s.stock.name == \"通有\" AND s.stock.name == \"集环\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00022363662719726562]]}, {"query": "朱梁丘基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱梁丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱梁丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015578269958496094], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱梁丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015721321105957031]]}, {"query": "有哪些托管给朱梁丘基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱梁丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱梁丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015130043029785156], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱梁丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001714468002319336]]}, {"query": "孔孙侨基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔孙侨' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔孙侨\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001491546630859375], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔孙侨\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015354156494140625]]}, {"query": "有讯据药股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '有讯据药' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"有讯\" OR s.stock.name == \"据药\" ) AND s.stock.name == \"有讯据药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013818740844726562], ["MATCH (s:stock)\nWHERE s.stock.name == \"有讯据药\" AND ( s.stock.name == \"有讯\" OR s.stock.name == \"据药\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013697147369384766]]}, {"query": "有哪些股东是有讯据药股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '有讯据药' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"有讯据药\" AND ( s.stock.name == \"有讯\" OR s.stock.name == \"据药\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00031876564025878906], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"有讯\" OR s.stock.name == \"据药\" ) AND s.stock.name == \"有讯据药\" \nRETURN n.name\nLIMIT 50", 0, 0.0002899169921875]]}, {"query": "邹南门基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '邹南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"邹南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015721321105957031], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"邹南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015337467193603516]]}, {"query": "发司集讯股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发司集讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"发司集\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"发司集讯\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012791156768798828], ["MATCH (s:stock)\nWHERE s.stock.name == \"发司集讯\" AND ( s.stock.name == \"发司集\" OR s.stock.name == \"讯股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014491081237792969]]}, {"query": "有哪些股东是发司集讯股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发司集讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"发司集\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"发司集讯\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003249645233154297], ["MATCH (s:stock)\nWHERE s.stock.name == \"发司集讯\" AND ( s.stock.name == \"发司集\" OR s.stock.name == \"讯股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003314018249511719]]}, {"query": "有哪些参股了宝钛股份股票的股东", "golden": "MATCH (s1:stock)<-[iso:is_stockholder_of]-(sh2:stockholder) WHERE s1.stock.name == '宝钛股份' RETURN sh2.stockholder.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝钛股份\" \nRETURN n.name\nLIMIT 50", 0, 0.00031113624572753906], ["MATCH (s:stock)\nWHERE s.stock.name == \"宝钛股份\" AND ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002467632293701172]]}, {"query": "有哪些托管给孔宇文基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔宇文' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔宇文\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016410350799560547], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔宇文\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001489400863647461]]}, {"query": "技源医司公股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技源医司公' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"源医\" OR s.stock.name == \"司公\" ) AND s.stock.name == \"技源医司公\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015184879302978516], ["MATCH (s:stock)\nWHERE s.stock.name == \"技源医司公\" AND ( s.stock.name == \"源医\" OR s.stock.name == \"司公\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014719963073730469]]}, {"query": "有哪些股东是技源医司公股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技源医司公' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"技源医司公\" AND ( s.stock.name == \"源医\" OR s.stock.name == \"司公\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003514289855957031], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"源医\" OR s.stock.name == \"司公\" ) AND s.stock.name == \"技源医司公\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003192424774169922]]}, {"query": "有哪些托管给卫南门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '卫南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"卫南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015273094177246094], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"卫南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015058517456054688]]}, {"query": "沈黎丘基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '沈黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"沈黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014455318450927734], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015900135040283203]]}, {"query": "有哪些托管给孔百里基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔百里' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔百里\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014955997467041016], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔百里\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016388893127441406]]}, {"query": "数融公环投股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '数融公环投' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"数融公环投\" AND ( s.stock.name == \"融公\" OR s.stock.name == \"环投\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016815662384033203], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"融公\" OR s.stock.name == \"环投\" ) AND s.stock.name == \"数融公环投\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001369476318359375]]}, {"query": "有哪些股东是数融公环投股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '数融公环投' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"融公\" OR s.stock.name == \"环投\" ) AND s.stock.name == \"数融公环投\" \nRETURN n.name\nLIMIT 50", 0, 0.0005116462707519531], ["MATCH (s:stock)\nWHERE s.stock.name == \"数融公环投\" AND ( s.stock.name == \"融公\" OR s.stock.name == \"环投\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002429485321044922]]}, {"query": "有哪些托管给郑东门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '郑东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"郑东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001384735107421875], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"郑东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015540122985839844]]}, {"query": "华诸葛基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '华诸葛' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"华诸葛\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015406608581542969], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"华诸葛\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016050338745117188]]}, {"query": "龙头股份股票关联的行业", "golden": "MATCH (s1:stock)-[bt:belong_to]->(t2:trade) WHERE s1.stock.name == '龙头股份' RETURN t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"龙头股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙头股份\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0024259090423583984], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"龙头股份\" AND ( s.stock.name == \"龙头股\" OR s.stock.name == \"份股\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.0022983551025390625]]}, {"query": "有哪些包括龙头股份股票的行业", "golden": "MATCH (s1:stock)-[bt:belong_to]->(t2:trade) WHERE s1.stock.name == '龙头股份' RETURN t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"龙头股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙头股份\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0022487640380859375], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"龙头股份\" AND ( s.stock.name == \"龙头股\" OR s.stock.name == \"份股\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.0023021697998046875]]}]