[{"query": "最高价小于20的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 20 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 20 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006166934967041016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 20 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007033109664916992]]}, {"query": "哪些行业的最高价小于20", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 20 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 20 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007503509521484375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 20 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007425785064697266]]}, {"query": "涨跌幅小于48的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < 48 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range < 48 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0059642791748046875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range < 48 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006669759750366211]]}, {"query": "哪些行业的涨跌幅小于48", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < 48 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range < 48 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0061223506927490234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range < 48 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0070343017578125]]}, {"query": "最高价大于4的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 4 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 4 \nRETURN s.stock\nLIMIT 50", 0, 0.01671624183654785], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 4 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.01745319366455078]]}, {"query": "哪些上市公司的最高价大于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 4 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 4 \nRETURN s.stock\nLIMIT 50", 0, 0.017125844955444336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 4 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.018603801727294922]]}, {"query": "成交量不小于9的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= 9 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume >= 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.010218381881713867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.010494709014892578]]}, {"query": "哪些上市公司的成交量不小于9", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume >= 9 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume >= 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.010478019714355469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.01076507568359375]]}, {"query": "开盘价不大于20的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 20 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 20 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007379055023193359], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 20 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.008161067962646484]]}, {"query": "哪些行业的开盘价不大于20", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 20 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 20 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006348609924316406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 20 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007003307342529297]]}, {"query": "收盘价不大于34的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= 34 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price <= 34 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00709223747253418], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price <= 34 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006806373596191406]]}, {"query": "哪些行业的收盘价不大于34", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= 34 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price <= 34 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006829261779785156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price <= 34 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005765676498413086]]}, {"query": "最高价小于29的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 29 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 29 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006034374237060547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 29 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006701469421386719]]}, {"query": "哪些行业的最高价小于29", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 29 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 29 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006802082061767578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 29 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0060231685638427734]]}, {"query": "最低价不大于38的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 38 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 38 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0075871944427490234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 38 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005899667739868164]]}, {"query": "哪些行业的最低价不大于38", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 38 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 38 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007729053497314453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 38 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006859779357910156]]}, {"query": "涨跌幅大于9的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range > 9 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > 9 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.003953695297241211], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range > 9 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0036461353302001953]]}, {"query": "哪些行业的涨跌幅大于9", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range > 9 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range > 9 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0038499832153320312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range > 9 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0037393569946289062]]}, {"query": "涨跌幅不大于41的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 41 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 41 \nRETURN s.stock\nLIMIT 50", 0, 0.02426743507385254], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 41 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.021956205368041992]]}, {"query": "哪些股票的涨跌幅不大于41", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 41 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 41 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01703619956970215], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 41 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017722606658935547]]}, {"query": "成交量不大于1的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 1 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 1 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.009760618209838867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 1 \nRETURN s.stock\nLIMIT 50", 0, 0.009184837341308594]]}, {"query": "哪些股票的成交量不大于1", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 1 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 1 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.005785226821899414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 1 \nRETURN s.stock.name\nLIMIT 50", 1, 0.00597834587097168]]}, {"query": "开盘价小于39的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 39 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 39 \nRETURN t.trade.name\nLIMIT 50", 1, 0.009615659713745117], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 39 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.009778738021850586]]}, {"query": "哪些行业的开盘价小于39", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 39 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 39 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006829500198364258], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 39 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007044315338134766]]}, {"query": "最高价小于23的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 23 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 23 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006653547286987305], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 23 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006430625915527344]]}, {"query": "哪些行业的最高价小于23", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 23 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 23 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006682634353637695], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 23 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006125926971435547]]}, {"query": "最低价不大于45的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 45 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 45 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006462574005126953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 45 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006484031677246094]]}, {"query": "哪些行业的最低价不大于45", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 45 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 45 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0075304508209228516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 45 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006571054458618164]]}, {"query": "涨跌幅小于7的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range < 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005304813385009766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range < 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0053293704986572266]]}, {"query": "哪些行业的涨跌幅小于7", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range < 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.004999637603759766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range < 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006215810775756836]]}, {"query": "注册资本不小于20的零售行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '零售' AND s.stock.registered_capital >= 20 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital >= 20 AND indus.industry.name == \"零售\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023691654205322266], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"零售\" AND s.stock.registered_capital >= 20 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002237081527709961]]}, {"query": "注册资本不小于3的金融技术行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '金融技术' AND s.stock.registered_capital >= 3 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND s.stock.registered_capital >= 3 \nRETURN s.stock\nLIMIT 50", 0, 0.0180816650390625], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 3 AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016198396682739258]]}, {"query": "注册资本大于43的电信服务提供商行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '电信服务提供商' AND s.stock.registered_capital > 43 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) AND s.stock.registered_capital > 43 \nRETURN s.stock.name\nLIMIT 50", 0, 0.006623029708862305], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 43 AND ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.006808280944824219]]}, {"query": "注册资本大于23的电力行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '电力' AND s.stock.registered_capital > 23 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 23 AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015938282012939453], ["MATCH (s:stock)\nWHERE s.stock.name == \"电力\" AND s.stock.registered_capital > 23 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015454292297363281]]}, {"query": "注册资本不小于49的媒体和娱乐行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '媒体和娱乐' AND s.stock.registered_capital >= 49 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 49 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.006726980209350586], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND s.stock.registered_capital >= 49 \nRETURN s.stock.name\nLIMIT 50", 0, 0.006483793258666992]]}, {"query": "注册资本不小于27的医疗设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗设备' AND s.stock.registered_capital >= 27 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 27 AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014982223510742188], ["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital >= 27 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013544559478759766]]}, {"query": "注册资本大于28的建筑材料行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '建筑材料' AND s.stock.registered_capital > 28 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"建筑\" AND s.stock.registered_capital > 28 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013349056243896484], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 28 AND s.stock.name == \"建筑\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013742446899414062]]}, {"query": "注册资本大于18的医疗设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗设备' AND s.stock.registered_capital > 18 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital > 18 \nRETURN s.stock\nLIMIT 50", 0, 0.0013613700866699219], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 18 AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013225078582763672]]}, {"query": "注册资本大于47的旅游和酒店行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '旅游和酒店' AND s.stock.registered_capital > 47 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 47 AND ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0063703060150146484], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) AND s.stock.registered_capital > 47 \nRETURN s.stock.name\nLIMIT 50", 0, 0.006665468215942383]]}, {"query": "注册资本不小于17的纺织品和服装行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '纺织品和服装' AND s.stock.registered_capital >= 17 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"纺织\" AND s.stock.registered_capital >= 17 AND s.stock.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014071464538574219], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 17 AND s.stock.name == \"服装\" AND s.stock.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.00133514404296875], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 17 AND s.stock.name == \"纺织\" AND s.stock.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013942718505859375], ["MATCH (s:stock)\nWHERE s.stock.name == \"纺织\" AND s.stock.name == \"服装\" AND s.stock.registered_capital >= 17 \nRETURN s.stock\nLIMIT 50", 0, 0.0013289451599121094], ["MATCH (s:stock)\nWHERE s.stock.name == \"服装\" AND s.stock.name == \"纺织\" AND s.stock.registered_capital >= 17 \nRETURN s.stock\nLIMIT 50", 0, 0.0013418197631835938], ["MATCH (s:stock)\nWHERE s.stock.name == \"服装\" AND s.stock.registered_capital >= 17 AND s.stock.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013806819915771484]]}, {"query": "注册资本大于24的酒精饮料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '酒精饮料' AND s.stock.registered_capital > 24 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 24 AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.01944589614868164], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND s.stock.registered_capital > 24 \nRETURN s.stock\nLIMIT 50", 0, 0.0188143253326416]]}, {"query": "注册资本大于26的农业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '农业' AND s.stock.registered_capital > 26 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"农业\" AND s.stock.registered_capital > 26 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002239227294921875], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital > 26 AND indus.industry.name == \"农业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023469924926757812]]}, {"query": "注册资本不小于3的信息技术行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '信息技术' AND s.stock.registered_capital >= 3 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"技术\" AND s.stock.registered_capital >= 3 \nRETURN s.stock\nLIMIT 50", 0, 0.018726587295532227], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 3 AND t.trade.name == \"技术\" \nRETURN s.stock\nLIMIT 50", 0, 0.017401456832885742]]}, {"query": "注册资本大于15的汽车行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '汽车' AND s.stock.registered_capital > 15 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 15 AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013988018035888672], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.registered_capital > 15 \nRETURN s.stock\nLIMIT 50", 0, 0.0013096332550048828]]}, {"query": "注册资本大于3的电子设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '电子设备' AND s.stock.registered_capital > 3 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 3 AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013725757598876953], ["MATCH (s:stock)\nWHERE s.stock.name == \"电子\" AND s.stock.registered_capital > 3 \nRETURN s.stock\nLIMIT 50", 0, 0.0012950897216796875]]}, {"query": "注册资本大于49的医疗保健设施行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗保健设施' AND s.stock.registered_capital > 49 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital > 49 \nRETURN s.stock\nLIMIT 50", 0, 0.0014638900756835938], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 49 AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013930797576904297]]}, {"query": "注册资本大于29的航空航天行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '航空航天' AND s.stock.registered_capital > 29 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 29 AND t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.015605449676513672], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND s.stock.registered_capital > 29 AND t.trade.name == \"航空航天\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.01652216911315918], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND s.stock.registered_capital > 29 AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.01281595230102539], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND s.stock.registered_capital > 29 \nRETURN s.stock.name\nLIMIT 50", 0, 0.01251077651977539], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 29 AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.013381719589233398], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND s.stock.registered_capital > 29 \nRETURN s.stock.name\nLIMIT 50", 0, 0.012411355972290039]]}, {"query": "注册资本大于46的汽车行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '汽车' AND s.stock.registered_capital > 46 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.registered_capital > 46 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014433860778808594], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 46 AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001543283462524414]]}, {"query": "注册资本不小于22的农业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '农业' AND s.stock.registered_capital >= 22 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital >= 22 AND indus.industry.name == \"农业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0024509429931640625], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"农业\" AND s.stock.registered_capital >= 22 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002244710922241211]]}]