[{"query": "2020年12月24日通化东宝上市公司的最低价和最高价和更新时间", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '通化东宝' AND sd.stock_data.`date` == date('2020-12-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.maximum_price, sd.stock_data.`date`\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-24\" ) AND s.stock.name == \"通化东宝\" \nRETURN sd.stock_data.maximum_price,sd.stock_data.`date`\nLIMIT 50", 1, 0.017681360244750977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通化东宝\" AND sd.stock_data.`date` == date( \"2020-12-24\" ) \nRETURN sd.stock_data.maximum_price,sd.stock_data.`date`\nLIMIT 50", 1, 0.016680240631103516]]}, {"query": "2020年12月24日的通化东宝上市公司的最低价和最高价和更新时间", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '通化东宝' AND sd.stock_data.`date` == date('2020-12-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.maximum_price, sd.stock_data.`date`\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-24\" ) AND s.stock.name == \"通化东宝\" \nRETURN sd.stock_data.maximum_price,sd.stock_data.`date`\nLIMIT 50", 1, 0.016951799392700195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通化东宝\" AND sd.stock_data.`date` == date( \"2020-12-24\" ) \nRETURN sd.stock_data.maximum_price,sd.stock_data.`date`\nLIMIT 50", 1, 0.01778388023376465]]}, {"query": "通化东宝上市公司的最低价和最高价和更新时间在2020年12月24日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '通化东宝' AND sd.stock_data.`date` == date('2020-12-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.maximum_price, sd.stock_data.`date`\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-24\" ) AND s.stock.name == \"通化东宝\" \nRETURN s.stock\nLIMIT 50", 0, 0.020385265350341797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通化东宝\" AND sd.stock_data.`date` == date( \"2020-12-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018286466598510742]]}, {"query": "2020年12月24日的通化东宝上市公司的最低价和最高价和更新时间的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '通化东宝' AND sd.stock_data.`date` == date('2020-12-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.maximum_price, sd.stock_data.`date`\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-24\" ) AND s.stock.name == \"通化东宝\" \nRETURN s.stock\nLIMIT 50", 0, 0.01615142822265625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通化东宝\" AND sd.stock_data.`date` == date( \"2020-12-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017520904541015625]]}, {"query": "食品和饮料行业的最高价和更新时间和涨跌幅在2022年8月28日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2022-08-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2022-8-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00751948356628418], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-28\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005907773971557617]]}, {"query": "2020年2月24日中国卫通的更新时间和最低价和成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国卫通' AND sd.stock_data.`date` == date('2020-02-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-2-24\" ) AND s.stock.name == \"中国卫\" \nRETURN sd.stock_data.minimum_price,sd.stock_data.volume\nLIMIT 50", 0, 0.0018379688262939453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中国卫\" AND sd.stock_data.`date` == date( \"2020-2-24\" ) \nRETURN sd.stock_data.minimum_price,sd.stock_data.volume\nLIMIT 50", 0, 0.001749277114868164]]}, {"query": "2020年2月24日的中国卫通的更新时间和最低价和成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国卫通' AND sd.stock_data.`date` == date('2020-02-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-2-24\" ) AND s.stock.name == \"中国卫\" \nRETURN sd.stock_data.minimum_price,sd.stock_data.volume\nLIMIT 50", 0, 0.0018644332885742188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中国卫\" AND sd.stock_data.`date` == date( \"2020-2-24\" ) \nRETURN sd.stock_data.minimum_price,sd.stock_data.volume\nLIMIT 50", 0, 0.0018000602722167969]]}, {"query": "2020年2月24日的中国卫通的更新时间和最低价和成交量的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国卫通' AND sd.stock_data.`date` == date('2020-02-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-2-24\" ) AND s.stock.name == \"中国卫\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019295215606689453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中国卫\" AND sd.stock_data.`date` == date( \"2020-2-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016961097717285156]]}, {"query": "2021年5月2日的中国外运股票的更新时间和涨跌幅和最高价的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国外运' AND sd.stock_data.`date` == date('2021-05-02') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005176067352294922], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05442953109741211], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0007112026214599609], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04410910606384277]]}, {"query": "2021年5月2日中国外运股票的更新时间和涨跌幅和最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国外运' AND sd.stock_data.`date` == date('2021-05-02') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005650520324707031], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04945516586303711], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006585121154785156], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0534970760345459]]}, {"query": "2021年5月2日的中国外运股票的更新时间和涨跌幅和最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国外运' AND sd.stock_data.`date` == date('2021-05-02') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006251335144042969], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04879260063171387], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0007395744323730469], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-5-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.043936967849731445]]}, {"query": "福建水泥股票的涨跌幅在2023年4月21日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '福建水泥' AND sd.stock_data.`date` == date('2023-04-21') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-4-21\" ) AND s.stock.name == \"福建水泥\" \nRETURN s.stock\nLIMIT 50", 0, 0.01659417152404785], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"福建水泥\" AND sd.stock_data.`date` == date( \"2023-4-21\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016842365264892578]]}, {"query": "电子设备的最高价和开盘价在2023年10月3日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2023-10-03') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2023-10-3\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0021142959594726562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-3\" ) AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.001875162124633789]]}, {"query": "2023年10月3日的电子设备的最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2023-10-03') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2023-10-3\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.00186920166015625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-3\" ) AND t.trade.name == \"电子\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.001703023910522461]]}, {"query": "2023年10月3日电子设备的最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2023-10-03') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2023-10-3\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.0019555091857910156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-3\" ) AND t.trade.name == \"电子\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.0016813278198242188]]}, {"query": "2023年10月3日的电子设备的最高价和开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2023-10-03') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2023-10-3\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017848014831542969], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-3\" ) AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018792152404785156]]}, {"query": "2023年4月5日的食品和饮料行业的最低价和更新时间和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2023-04-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-4-5\" ) \nRETURN td.trade_data.`date`,td.trade_data.closing_price,m.name,td.trade_data.minimum_price\nLIMIT 50", 0, 0.0004949569702148438], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-5\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.`date`,td.trade_data.closing_price,m.name,td.trade_data.minimum_price\nLIMIT 50", 0, 0.00032901763916015625]]}, {"query": "食品和饮料行业的最低价和更新时间和收盘价在2023年4月5日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2023-04-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-5\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008404970169067383], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-4-5\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00612187385559082]]}, {"query": "医疗保健设施行业的开盘价和收盘价和最高价在2022年7月28日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2022-07-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2022-7-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0020761489868164062], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-28\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020911693572998047]]}, {"query": "2022年7月28日医疗保健设施行业的开盘价和收盘价和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2022-07-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2022-7-28\" ) \nRETURN td.trade_data.closing_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018191337585449219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-28\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0017211437225341797]]}, {"query": "2022年7月28日的医疗保健设施行业的开盘价和收盘价和最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2022-07-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2022-7-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017910003662109375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-28\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016930103302001953]]}, {"query": "2022年7月28日的医疗保健设施行业的开盘价和收盘价和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2022-07-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2022-7-28\" ) \nRETURN td.trade_data.closing_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018925666809082031], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-28\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0015931129455566406]]}, {"query": "航空航天行业的最高价和开盘价和更新时间在2023年4月28日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空航天' AND td.trade_data.`date` == date('2023-04-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND td.trade_data.`date` == date( \"2023-4-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.018362045288085938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-28\" ) AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.017115354537963867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date( \"2023-4-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.016448259353637695], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-28\" ) AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.01587510108947754], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date( \"2023-4-28\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.016390323638916016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND td.trade_data.`date` == date( \"2023-4-28\" ) AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.015440702438354492]]}, {"query": "2023年4月28日航空航天行业的最高价和开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空航天' AND td.trade_data.`date` == date('2023-04-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND td.trade_data.`date` == date( \"2023-4-28\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.01650691032409668], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date( \"2023-4-28\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.01710033416748047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-28\" ) AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.016390085220336914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date( \"2023-4-28\" ) AND t.trade.name == \"航空航天\" \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.01625990867614746], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND td.trade_data.`date` == date( \"2023-4-28\" ) AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.017349720001220703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-28\" ) AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.017629384994506836]]}, {"query": "2023年4月28日的航空航天行业的最高价和开盘价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空航天' AND td.trade_data.`date` == date('2023-04-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND td.trade_data.`date` == date( \"2023-4-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.017990827560424805], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-28\" ) AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.02010202407836914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date( \"2023-4-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.017478227615356445], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-28\" ) AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0167996883392334], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date( \"2023-4-28\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.016704082489013672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND td.trade_data.`date` == date( \"2023-4-28\" ) AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.018690824508666992]]}, {"query": "2023年5月15日的信息技术的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-05-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-15\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0021321773529052734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2023-5-15\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0018410682678222656]]}, {"query": "信息技术的开盘价在2023年5月15日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-05-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2023-5-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0022056102752685547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-15\" ) AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016841888427734375]]}, {"query": "2021年2月13日的公用事业行业的开盘价和最低价和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2021-02-13') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006251335144042969], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00036525726318359375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013326644897460938], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.014377117156982422]]}]