[{"query": "成交量不大于10的电子设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电子设备' AND sd.stock_data.volume <= 10 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 10 AND s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.03282976150512695], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 10 AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.023495912551879883], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电子\" AND sd.stock_data.volume <= 10 \nRETURN s.stock\nLIMIT 50", 0, 0.025397062301635742], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 10 \nRETURN s.stock\nLIMIT 50", 0, 0.021347522735595703], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 10 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0220181941986084], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.volume <= 10 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.019596576690673828]]}, {"query": "收盘价不大于30的消费品行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '消费品' AND sd.stock_data.closing_price <= 30 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 30 \nRETURN s.stock\nLIMIT 50", 0, 7.229212999343872], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 30 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.633329153060913], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 30 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.349720239639282], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 30 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.2056920528411865], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 30 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.339832544326782], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 30 \nRETURN s.stock\nLIMIT 50", 0, 6.985375642776489]]}, {"query": "最高价小于47的能源行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.maximum_price < 47 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.maximum_price < 47 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.003885030746459961], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.maximum_price < 47 \nRETURN s.stock\nLIMIT 50", 0, 0.002155780792236328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 47 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.020208358764648438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 47 \nRETURN s.stock\nLIMIT 50", 0, 0.0027647018432617188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 47 AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0031409263610839844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 47 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.002935171127319336]]}, {"query": "最低价小于8的汽车行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '汽车' AND sd.stock_data.minimum_price < 8 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0024590492248535156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 8 AND s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.002045869827270508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" AND sd.stock_data.minimum_price < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002289295196533203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023202896118164062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 8 AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015883445739746094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.minimum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015108585357666016]]}, {"query": "成交量小于48的电信服务提供商行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电信服务提供商' AND sd.stock_data.volume < 48 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 48 \nRETURN s.stock\nLIMIT 50", 0, 0.02895045280456543], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) AND sd.stock_data.volume < 48 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.020569801330566406], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 48 AND sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.020086050033569336], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 48 AND ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.020534038543701172], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) AND sd.stock_data.volume < 48 \nRETURN s.stock\nLIMIT 50", 0, 0.019908666610717773], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 48 AND ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.020697832107543945]]}, {"query": "最低价不大于42的汽车行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '汽车' AND sd.stock_data.minimum_price <= 42 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.minimum_price <= 42 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0026590824127197266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 42 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.004631757736206055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 42 \nRETURN s.stock\nLIMIT 50", 0, 0.0018954277038574219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 42 AND s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0019614696502685547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 42 AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0023522377014160156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" AND sd.stock_data.minimum_price <= 42 \nRETURN s.stock\nLIMIT 50", 0, 0.002971172332763672]]}, {"query": "成交量不小于3的物流服务行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '物流服务' AND sd.stock_data.volume >= 3 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.volume >= 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.01963210105895996], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.volume >= 3 \nRETURN s.stock.name\nLIMIT 50", 0, 0.018026351928710938], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume >= 3 AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.015735626220703125], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume >= 3 AND sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.014329910278320312], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 3 \nRETURN s.stock.name\nLIMIT 50", 0, 0.015009403228759766], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 3 AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.016717910766601562]]}, {"query": "开盘价大于24的能源行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.opening_price > 24 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.opening_price > 24 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.003882169723510742], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price > 24 AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0024924278259277344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > 24 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0022797584533691406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price > 24 \nRETURN s.stock.name\nLIMIT 50", 0, 0.001974344253540039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > 24 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017371177673339844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.opening_price > 24 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0019464492797851562]]}, {"query": "最高价小于19的原材料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '原材料' AND sd.stock_data.maximum_price < 19 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 19 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.270262956619263], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 19 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.28972864151001], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 19 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.508809328079224], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 19 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.257315158843994], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 19 \nRETURN s.stock\nLIMIT 50", 0, 7.1953020095825195], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 19 \nRETURN s.stock\nLIMIT 50", 0, 7.224707841873169]]}, {"query": "成交量不大于31的媒体和娱乐行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '媒体和娱乐' AND sd.stock_data.volume <= 31 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 31 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.023420333862304688], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.03086233139038086], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.volume <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.021076440811157227], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.volume <= 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.019974470138549805], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 31 AND sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.018393993377685547], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 31 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.017348527908325195]]}, {"query": "成交量不大于11的航空公司行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '航空公司' AND sd.stock_data.volume <= 11 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 11 AND s.stock.name == \"航空\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.030535221099853516], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"航空\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 11 \nRETURN s.stock.name\nLIMIT 50", 0, 0.03538799285888672], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"航空\" AND sd.stock_data.volume <= 11 \nRETURN s.stock.name\nLIMIT 50", 0, 0.02039337158203125], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 11 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"航空\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.033060550689697266], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"航空\" AND sd.stock_data.volume <= 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.017171859741210938], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 11 AND s.stock.name == \"航空\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.017337799072265625]]}, {"query": "收盘价小于26的消费品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '消费品' AND sd.stock_data.closing_price < 26 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.922635793685913], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price < 26 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.296911716461182], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 26 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.372992038726807], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 26 \nRETURN s.stock.name\nLIMIT 50", 0, 7.074805974960327], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 26 \nRETURN s.stock.name\nLIMIT 50", 0, 7.304147958755493], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price < 26 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.313728094100952]]}, {"query": "最高价小于26的公用事业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.maximum_price < 26 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.371772766113281], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 26 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.2818520069122314], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 26 \nRETURN s.stock.name\nLIMIT 50", 0, 6.936715364456177], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 26 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.205903768539429], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 26 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.481104373931885], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 26 \nRETURN s.stock.name\nLIMIT 50", 0, 7.156774520874023]]}, {"query": "成交量小于25的食品和饮料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '食品和饮料' AND sd.stock_data.volume < 25 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume < 25 AND sd.stock_data.`date` == date('2023-11-10') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.030377864837646484], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume < 25 AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02860879898071289], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND sd.stock_data.volume < 25 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.026727676391601562], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND sd.stock_data.volume < 25 \nRETURN s.stock\nLIMIT 50", 0, 0.025909900665283203], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 25 \nRETURN s.stock\nLIMIT 50", 0, 0.02561330795288086], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 25 AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.029900074005126953]]}, {"query": "最低价大于3的钢铁行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '钢铁' AND sd.stock_data.minimum_price > 3 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023530960083007812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 3 \nRETURN s.stock\nLIMIT 50", 0, 0.023620128631591797]]}, {"query": "成交量不小于3的能源行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.volume >= 3 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.volume >= 3 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0042879581451416016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 3 \nRETURN s.stock.name\nLIMIT 50", 0, 0.010752439498901367], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.volume >= 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0019745826721191406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume >= 3 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017163753509521484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 3 AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002848386764526367], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume >= 3 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023560523986816406]]}, {"query": "成交量不大于9的医疗设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '医疗设备' AND sd.stock_data.volume <= 9 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 9 AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.03523731231689453], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 9 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.019608020782470703], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.volume <= 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.017480850219726562], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" AND sd.stock_data.volume <= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.017602920532226562], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.026434659957885742], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 9 AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.018262386322021484]]}, {"query": "最低价小于31的能源行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.minimum_price < 31 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.minimum_price < 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.013219118118286133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 31 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0025234222412109375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002354145050048828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 31 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0030395984649658203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 31 AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0020101070404052734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.minimum_price < 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.002252817153930664]]}]