[{"query": "在陆家嘴和同济科技和京投发展中成交量最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['陆家嘴', '同济科技', '京投发展'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.0023005008697509766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"投发\" AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001964092254638672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"投发\" AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0019061565399169922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"投发\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018358230590820312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND s.stock.name == \"投发\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001678466796875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014598369598388672]]}, {"query": "哪个是在陆家嘴和同济科技和京投发展中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['陆家嘴', '同济科技', '京投发展'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018830299377441406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"投发\" AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017139911651611328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"投发\" AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015778541564941406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"投发\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.00179290771484375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND s.stock.name == \"投发\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015125274658203125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.002371072769165039]]}, {"query": "在陆家嘴和同济科技和京投发展中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['陆家嘴', '同济科技', '京投发展'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020885467529296875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"投发\" AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017693042755126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"投发\" AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016100406646728516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"投发\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0022308826446533203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND s.stock.name == \"投发\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017495155334472656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"陆家嘴\" OR s.stock.name == \"同济科技\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015523433685302734]]}, {"query": "哪个是在江淮汽车和烽火通信中开盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['江淮汽车', '烽火通信'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"江淮汽车\" OR s.stock.name == \"烽火通信\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018328189849853516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"江淮汽车\" OR s.stock.name == \"烽火通信\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01935744285583496]]}, {"query": "在江淮汽车和烽火通信中开盘价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['江淮汽车', '烽火通信'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"江淮汽车\" OR s.stock.name == \"烽火通信\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018512248992919922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"江淮汽车\" OR s.stock.name == \"烽火通信\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.02090311050415039]]}, {"query": "哪个是在食品和饮料和家庭和个人用品中最低价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['食品和饮料', '家庭和个人用品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.006066799163818359], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.006263017654418945]]}, {"query": "在浪莎股份和龙元建设上市公司中开盘价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['浪莎股份', '龙元建设'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001949310302734375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017833709716796875]]}, {"query": "在浪莎股份和龙元建设上市公司中开盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['浪莎股份', '龙元建设'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020263195037841797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018131732940673828]]}, {"query": "哪个是在汽车和银行和电信服务提供商行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车', '银行', '电信服务提供商'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"汽车\" OR indus.industry.name == \"银行\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17113947868347168], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"银行\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.20056486129760742]]}, {"query": "在中信金属和退市海润中收盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中信金属', '退市海润'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金属\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021796226501464844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金属\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019316673278808594]]}, {"query": "在中信金属和退市海润中收盘价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中信金属', '退市海润'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金属\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018389225006103516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金属\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001760244369506836]]}, {"query": "哪个是在化学和汽车制造中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['化学', '汽车制造'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.1729741096496582], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"化学\" OR indus.industry.name == \"汽车\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.1769862174987793]]}, {"query": "在赛力斯和北大荒和欧亚集团上市公司中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['赛力斯', '北大荒', '欧亚集团'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"北大荒\" OR s.stock.name == \"欧亚集团\" ) \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.023195505142211914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"北大荒\" OR s.stock.name == \"欧亚集团\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.02037501335144043]]}, {"query": "在物流服务和公用事业中收盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '公用事业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008188724517822266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.006272315979003906]]}, {"query": "在物流服务和公用事业中收盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '公用事业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007843255996704102], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005968570709228516]]}, {"query": "在航天和国防和航空航天中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航天和国防', '航空航天'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.017643451690673828], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.01660752296447754], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.015409708023071289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.01607203483581543], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.015657424926757812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.01636362075805664]]}, {"query": "在航天和国防和航空航天中开盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航天和国防', '航空航天'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0159914493560791], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.015415668487548828], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01683211326599121], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.015895843505859375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.017039775848388672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.01569986343383789]]}, {"query": "在万华化和ST天成和华泰股份中最高价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['万华化', 'ST天成', '华泰股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST天\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华泰股份\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017733573913574219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST天\" AND s.stock.name == \"华泰股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.001967191696166992], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华泰股份\" AND s.stock.name == \"ST天\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016587018966674805], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华泰股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST天\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.015892505645751953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST天\" AND s.stock.name == \"华泰股份\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.00189208984375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华泰股份\" AND s.stock.name == \"ST天\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016414403915405273]]}, {"query": "在电信和酒店和度假村中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电信', '酒店和度假村'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.17641353607177734], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.1741328239440918]]}, {"query": "在湖南天雁和大众公用和驰宏锌锗上市公司中收盘价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['湖南天雁', '大众公用', '驰宏锌锗'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大众公用\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.02134537696838379], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大众公用\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.017914295196533203]]}, {"query": "哪个是在湖南天雁和大众公用和驰宏锌锗上市公司中收盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['湖南天雁', '大众公用', '驰宏锌锗'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大众公用\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.017023563385009766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大众公用\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.01712632179260254]]}, {"query": "在湖南天雁和大众公用和驰宏锌锗上市公司中收盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['湖南天雁', '大众公用', '驰宏锌锗'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大众公用\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.016599178314208984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大众公用\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.017188310623168945]]}, {"query": "哪个是在工业和汽车零部件行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['工业', '汽车零部件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.016939640045166016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.017530202865600586]]}, {"query": "在工业和汽车零部件行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['工业', '汽车零部件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.018239498138427734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.015958070755004883]]}, {"query": "哪个是在扬农化工和交通银行上市公司中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['扬农化工', '交通银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"扬农化工\" OR s.stock.name == \"交通\" ) \nRETURN s.stock\nLIMIT 50", 1, 0.019273042678833008], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"扬农化工\" OR s.stock.name == \"交通\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 1, 0.01811075210571289]]}, {"query": "在扬农化工和交通银行上市公司中成交量最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['扬农化工', '交通银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"扬农化工\" OR s.stock.name == \"交通\" ) \nRETURN s.stock\nLIMIT 50", 1, 0.018628358840942383], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"扬农化工\" OR s.stock.name == \"交通\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 1, 0.017487049102783203]]}, {"query": "在扬农化工和交通银行上市公司中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['扬农化工', '交通银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"扬农化工\" OR s.stock.name == \"交通\" ) \nRETURN s.stock\nLIMIT 50", 1, 0.017929553985595703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"扬农化工\" OR s.stock.name == \"交通\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 1, 0.019968271255493164]]}, {"query": "哪个是在首创证券和恒顺醋业和国投中鲁中涨跌幅最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['首创证券', '恒顺醋业', '国投中鲁'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒顺醋业\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.016791820526123047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒顺醋业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.017104148864746094]]}, {"query": "在首创证券和恒顺醋业和国投中鲁中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['首创证券', '恒顺醋业', '国投中鲁'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒顺醋业\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.016726255416870117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒顺醋业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.016721725463867188]]}, {"query": "哪个是在物流服务和电力工具和设备中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '电力工具和设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0067751407623291016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0060765743255615234]]}, {"query": "在物流服务和电力工具和设备中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '电力工具和设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.006003856658935547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.006100177764892578]]}, {"query": "在物流服务和电力工具和设备中涨跌幅最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '电力工具和设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.00558161735534668], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0068738460540771484]]}]