[{"query": "有哪些产业的上市公司属于食品和饮料", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '食品和饮料' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"食品\" AND ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN t.trade.name,indus.industry.name\nLIMIT 50", 0, 0.001920938491821289], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"食品\" \nRETURN t.trade.name,indus.industry.name\nLIMIT 50", 0, 0.001676797866821289]]}, {"query": "关联航空航天的股票所属的行业有哪些", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)-[a1:associate]->(n1:industry) WHERE n1.industry.name == '航空航天' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.002465486526489258], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0021979808807373047]]}, {"query": "有哪些行业的股票关联航空航天", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)-[a1:associate]->(n1:industry) WHERE n1.industry.name == '航空航天' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00030493736267089844], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0002741813659667969]]}, {"query": "关联克劳斯的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '克劳斯' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004361629486083984], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003869295120239258]]}, {"query": "有哪些产业下游的产业关联克劳斯", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '克劳斯' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004005908966064453], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036704540252685547]]}, {"query": "关联航空航天的上市公司涉及的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[a1:associate]->(n1:industry) WHERE n1.industry.name == '航空航天' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.004050254821777344], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0037796497344970703]]}, {"query": "有哪些产业的股票关联航空航天", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[a1:associate]->(n1:industry) WHERE n1.industry.name == '航空航天' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0038733482360839844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.003648042678833008]]}, {"query": "上游是汽车的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '汽车' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017852783203125], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020096302032470703]]}, {"query": "有哪些产业上游的产业上游是汽车", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '汽车' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016772747039794922], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021882057189941406]]}, {"query": "关联华泰股份的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华泰股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"华泰股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00027489662170410156], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"华泰股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00020503997802734375]]}, {"query": "有哪些产业下游的产业关联华泰股份", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华泰股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"华泰股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0003020763397216797], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"华泰股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0001957416534423828]]}, {"query": "关联香溢融通的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '香溢融通' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"融通\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002720355987548828], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"融通\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00020456314086914062]]}, {"query": "有哪些产业下游的产业关联香溢融通", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '香溢融通' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"融通\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002493858337402344], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"融通\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00017881393432617188]]}, {"query": "关联退市华业的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '退市华业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004250526428222656], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003214597702026367]]}, {"query": "有哪些产业上游的产业关联退市华业", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '退市华业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003950357437133789], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037262439727783203]]}, {"query": "上游是媒体和娱乐的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '媒体和娱乐' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001600503921508789], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001535177230834961]]}, {"query": "有哪些产业上游的产业上游是媒体和娱乐", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '媒体和娱乐' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015573501586914062], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014281272888183594]]}, {"query": "上游是电视和广播的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电视和广播' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0031862258911132812], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003954887390136719]]}, {"query": "有哪些产业上游的产业上游是电视和广播", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电视和广播' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003968238830566406], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034477710723876953]]}, {"query": "关联南宁百货的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '南宁百货' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"南宁百货\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002741813659667969], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"南宁百货\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002315044403076172]]}, {"query": "有哪些产业下游的产业关联南宁百货", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '南宁百货' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"南宁百货\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00028324127197265625], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"南宁百货\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002739429473876953]]}, {"query": "上游是物流服务的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '物流服务' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014972686767578125], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015716552734375]]}, {"query": "有哪些产业上游的产业上游是物流服务", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '物流服务' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014121532440185547], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014863014221191406]]}, {"query": "有哪些产业下游的产业关联退市秋林", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '退市秋林' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034852027893066406], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003457784652709961]]}, {"query": "关联宁沪高速的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '宁沪高速' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"宁沪高速\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002789497375488281], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"宁沪高速\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00022125244140625]]}, {"query": "有哪些产业下游的产业关联宁沪高速", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '宁沪高速' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"宁沪高速\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002989768981933594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"宁沪高速\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00024819374084472656]]}, {"query": "关联拓普集团的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '拓普集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038993358612060547], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003939390182495117]]}, {"query": "有哪些产业下游的产业关联拓普集团", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '拓普集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003375530242919922], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033636093139648438]]}, {"query": "关联广汽集团的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广汽集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003502368927001953], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038437843322753906]]}, {"query": "有哪些产业下游的产业关联广汽集团", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广汽集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033767223358154297], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033299922943115234]]}, {"query": "关联三星医疗的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '三星医疗' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001497030258178711], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014362335205078125]]}, {"query": "有哪些产业下游的产业关联三星医疗", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '三星医疗' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014545917510986328], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014481544494628906]]}, {"query": "有哪些行业的上市公司股东是份服地股据", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '份服地股据' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"份服\" AND s.stock.name == \"司股\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003409385681152344], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"份服\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00026345252990722656]]}, {"query": "关联农发种业的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '农发种业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004023313522338867], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004060268402099609]]}, {"query": "关联洪城环境的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '洪城环境' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003922462463378906], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004050493240356445]]}, {"query": "有哪些产业上游的产业关联洪城环境", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '洪城环境' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034949779510498047], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033392906188964844]]}, {"query": "上游是金融的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '金融' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017940998077392578], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020453929901123047]]}, {"query": "有哪些产业上游的产业上游是金融", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '金融' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001665353775024414], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"金融\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00220489501953125]]}, {"query": "有哪些行业的上市公司股东是集环造", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '集环造' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"集环\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003001689910888672], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"集环\" AND s.stock.name == \"司股\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003333091735839844]]}, {"query": "关联广汇能源的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广汇能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002004861831665039], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0024383068084716797]]}, {"query": "有哪些产业下游的产业关联广汇能源", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广汇能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001903533935546875], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002159595489501953]]}, {"query": "关联首开股份的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '首开股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00030803680419921875], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00023484230041503906]]}, {"query": "有哪些产业下游的产业关联首开股份", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '首开股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002892017364501953], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002117156982421875]]}, {"query": "关联ST澄星的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST澄星' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033071041107177734], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036821365356445312]]}, {"query": "有哪些产业上游的产业关联ST澄星", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST澄星' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033721923828125], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003081798553466797]]}, {"query": "有哪些行业的上市公司股东是电团制", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '电团制' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"电团制\" AND s.stock.name == \"司股\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003418922424316406], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"电团制\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00031495094299316406]]}, {"query": "关联万业企业的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '万业企业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032427310943603516], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036134719848632812]]}, {"query": "有哪些产业上游的产业关联万业企业", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '万业企业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003506898880004883], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00426936149597168]]}, {"query": "关联沧州大化的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '沧州大化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003046989440917969], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002586841583251953]]}, {"query": "有哪些产业上游的产业关联沧州大化", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '沧州大化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00031113624572753906], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00025916099548339844]]}, {"query": "关联申能股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '申能股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"申能股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00029778480529785156], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"申能股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002808570861816406]]}, {"query": "有哪些产业上游的产业关联申能股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '申能股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"申能股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002739429473876953], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"申能股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00020766258239746094]]}, {"query": "有哪些行业的上市公司股东是发务产金", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '发务产金' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"发务产金\" AND s.stock.name == \"司股\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00031065940856933594], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"发务产金\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00029087066650390625]]}, {"query": "关联动力新科的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '动力新科' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003653287887573242], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033309459686279297]]}, {"query": "有哪些产业上游的产业关联动力新科", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '动力新科' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037453174591064453], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034711360931396484]]}, {"query": "关联华新水泥的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华新水泥' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"华新水泥\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00030350685119628906], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"华新水泥\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002224445343017578]]}, {"query": "有哪些产业上游的产业关联华新水泥", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华新水泥' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"华新水泥\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003044605255126953], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"华新水泥\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002040863037109375]]}, {"query": "属于石油和天然气的上市公司关联的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '石油和天然气' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"石油\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0016083717346191406], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"石油\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.001569509506225586]]}, {"query": "有哪些产业关联的股票属于石油和天然气", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '石油和天然气' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"石油\" \nRETURN s.stock.name,indus.industry.name\nLIMIT 50", 0, 0.0017168521881103516], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"石油\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock.name,indus.industry.name\nLIMIT 50", 0, 0.0017938613891601562]]}, {"query": "关联营口港的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '营口港' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002918243408203125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002644062042236328]]}]