[{"query": "收盘价不大于31的原材料行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '原材料' AND sd.stock_data.closing_price <= 31 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 7.27434229850769], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.36023736000061], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.431921005249023], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 7.341695785522461], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 31 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.426492691040039], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.368278503417969]]}, {"query": "收盘价不大于31的能源行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.closing_price <= 31 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 31 AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002423524856567383], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001973390579223633], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017697811126708984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.closing_price <= 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017690658569335938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 31 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015118122100830078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.closing_price <= 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015575885772705078]]}, {"query": "最低价不大于26的原材料行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '原材料' AND sd.stock_data.minimum_price <= 26 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.968109130859375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 26 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.4536354541778564], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 26 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.482029914855957], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 26 \nRETURN s.stock.name\nLIMIT 50", 0, 7.219114542007446], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 26 \nRETURN s.stock.name\nLIMIT 50", 0, 7.018458843231201], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 26 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.396393537521362]]}, {"query": "成交量小于27的化学行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '化学' AND sd.stock_data.volume < 27 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"化学\" AND sd.stock_data.volume < 27 \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0006561279296875], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 27 AND indus.industry.name == \"化学\" \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0004336833953857422], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"化学\" AND sd.stock_data.volume < 27 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0003304481506347656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume < 27 AND indus.industry.name == \"化学\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0002999305725097656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume < 27 AND sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"化学\" \nRETURN s1.stock.name\nLIMIT 50", 0, 0.00030922889709472656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"化学\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 27 \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0002532005310058594]]}, {"query": "最高价不大于12的消费品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '消费品' AND sd.stock_data.maximum_price <= 12 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.024229526519775], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 12 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.630197525024414], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 12 \nRETURN s.stock.name\nLIMIT 50", 0, 7.11470103263855], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 12 \nRETURN s.stock.name\nLIMIT 50", 0, 7.38660740852356], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 12 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.313228130340576], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 12 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.304941415786743]]}, {"query": "最高价不大于33的钢铁行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '钢铁' AND sd.stock_data.maximum_price <= 33 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 33 \nRETURN s.stock.name\nLIMIT 50", 0, 0.023596763610839844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 33 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.026911497116088867]]}, {"query": "最低价不大于2的消费品行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '消费品' AND sd.stock_data.minimum_price <= 2 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 2 \nRETURN s.stock\nLIMIT 50", 0, 1.8672876358032227], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 2 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 1.851909875869751], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 2 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 1.8810608386993408], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 2 \nRETURN s.stock\nLIMIT 50", 0, 1.8586196899414062], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 2 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 1.8948173522949219], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 2 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 1.9108941555023193]]}, {"query": "涨跌幅小于47的电脑硬件行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电脑硬件' AND sd.stock_data.range < 47 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 47 \nRETURN s.stock.name\nLIMIT 50", 0, 7.054795503616333], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range < 47 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.5875632762908936], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range < 47 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.394382953643799], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range < 47 \nRETURN s.stock.name\nLIMIT 50", 0, 7.178894758224487], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 47 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.329210996627808], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range < 47 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.37070107460022]]}, {"query": "成交量不大于12的物流服务行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '物流服务' AND sd.stock_data.volume <= 12 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 12 \nRETURN s.stock\nLIMIT 50", 0, 0.04297518730163574], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.volume <= 12 \nRETURN s.stock\nLIMIT 50", 0, 0.023758649826049805], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.volume <= 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.030817270278930664], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 12 AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.020660877227783203], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 12 AND sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019628047943115234], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 12 AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.025173187255859375]]}, {"query": "涨跌幅不大于12的家庭和个人用品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '家庭和个人用品' AND sd.stock_data.range <= 12 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 12 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.366892337799072], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 12 \nRETURN s.stock.name\nLIMIT 50", 0, 7.058058500289917], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 12 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.33540678024292], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 12 \nRETURN s.stock.name\nLIMIT 50", 0, 7.075008153915405], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.137805223464966], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 12 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.268745183944702]]}, {"query": "最低价小于8的汽车行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '汽车' AND sd.stock_data.minimum_price < 8 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 8 AND s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0027675628662109375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 8 \nRETURN s.stock\nLIMIT 50", 0, 0.005441904067993164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.minimum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0025482177734375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 8 AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.005308628082275391], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" AND sd.stock_data.minimum_price < 8 \nRETURN s.stock\nLIMIT 50", 0, 0.0022323131561279297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 8 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022063255310058594]]}, {"query": "开盘价不大于45的公用事业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.opening_price <= 45 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 45 \nRETURN s.stock\nLIMIT 50", 0, 7.023712396621704], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 45 \nRETURN s.stock\nLIMIT 50", 0, 7.238923072814941], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price <= 45 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.336857318878174], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 45 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.322950839996338], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price <= 45 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.218955993652344], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 45 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.4164111614227295]]}, {"query": "收盘价小于46的能源行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.closing_price < 46 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 46 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0033562183380126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.closing_price < 46 \nRETURN s.stock\nLIMIT 50", 0, 0.013050079345703125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.closing_price < 46 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0019826889038085938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 46 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.001928091049194336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 46 \nRETURN s.stock\nLIMIT 50", 0, 0.022066831588745117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 46 AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022101402282714844]]}, {"query": "开盘价小于35的汽车行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '汽车' AND sd.stock_data.opening_price < 35 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 35 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0035920143127441406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"汽车\" AND sd.stock_data.opening_price < 35 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002237081527709961], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 35 \nRETURN s.stock.name\nLIMIT 50", 0, 0.004201650619506836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 35 AND s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0019669532775878906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 35 AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017557144165039062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.opening_price < 35 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017781257629394531]]}, {"query": "最高价小于17的电力行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电力' AND sd.stock_data.maximum_price < 17 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 17 \nRETURN s.stock.name\nLIMIT 50", 0, 0.004704475402832031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 17 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002040386199951172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 17 AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.004533290863037109], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.maximum_price < 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018396377563476562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 17 AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002451658248901367], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电力\" AND sd.stock_data.maximum_price < 17 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0041010379791259766]]}, {"query": "收盘价不大于8的电脑硬件行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电脑硬件' AND sd.stock_data.closing_price <= 8 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 8 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 6.686953783035278], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 8 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 6.584094285964966], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 8 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 6.237931251525879], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 8 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 6.593136787414551], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 8 \nRETURN s.stock.name\nLIMIT 50", 0, 6.278371572494507], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 8 \nRETURN s.stock.name\nLIMIT 50", 0, 6.487478017807007]]}, {"query": "成交量不大于38的农业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '农业' AND sd.stock_data.volume <= 38 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume <= 38 AND sd.stock_data.`date` == date('2023-11-11') AND indus.industry.name == \"农业\" \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0007147789001464844], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"农业\" AND sd.stock_data.volume <= 38 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0004589557647705078], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND indus.industry.name == \"农业\" AND sd.stock_data.volume <= 38 \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0003981590270996094], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume <= 38 AND indus.industry.name == \"农业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0003104209899902344], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"农业\" AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 38 \nRETURN s1.stock.name\nLIMIT 50", 0, 0.0003445148468017578], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 38 AND indus.industry.name == \"农业\" \nRETURN s1.stock.name\nLIMIT 50", 0, 0.00038051605224609375]]}]