[{"query": "2022年1月22日哪些行业的涨跌幅是靠前的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2022-1-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.012477874755859375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.010767221450805664], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004534721374511719], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004372596740722656]]}, {"query": "2022年1月22日涨跌幅靠前的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2022-1-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.0004286766052246094], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.013326406478881836], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.0004172325134277344], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-1-22\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.012055158615112305]]}, {"query": "2020年6月18日哪些上市公司的涨跌幅是靠前的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-6-18') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0004923343658447266], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04696035385131836], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0483851432800293], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006461143493652344]]}, {"query": "2020年6月18日涨跌幅靠前的上市公司是哪些", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-6-18') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.04257678985595703], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0006175041198730469], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.04961037635803223], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 3", 0, 0.0006544589996337891]]}, {"query": "2020年4月1日哪些行业的涨跌幅是靠前的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-4-1') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0005061626434326172], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.011904478073120117], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.014199256896972656], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004923343658447266]]}, {"query": "2020年4月1日涨跌幅靠前的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-4-1') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.000469207763671875], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.0003459453582763672], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.013486623764038086], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.013180732727050781]]}, {"query": "2020年4月1日涨跌幅靠前的行业是哪些", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-4-1') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.012833356857299805], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.0006439685821533203], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.014783382415771484], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 3", 0, 0.0008041858673095703]]}, {"query": "2022年1月22日涨跌幅靠后的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-1-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.04977107048034668], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0006496906280517578], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0005300045013427734], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.04816699028015137]]}, {"query": "2022年1月22日涨跌幅靠后的股票是哪些", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-1-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006251335144042969], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0472416877746582], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006186962127685547], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.041657447814941406]]}, {"query": "2020年4月1日哪些行业的涨跌幅是靠后的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-4-1') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004010200500488281], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.012497901916503906], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.011208772659301758], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004634857177734375]]}, {"query": "2020年4月1日涨跌幅靠后的行业是哪些", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-4-1') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.011250734329223633], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004382133483886719], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00043392181396484375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.011637449264526367]]}, {"query": "2020年6月18日哪些股票的涨跌幅是靠前的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-6-18') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0005745887756347656], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.04468584060668945], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0006203651428222656], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-6-18\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.04642176628112793]]}, {"query": "2022年1月22日涨跌幅靠后的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-1-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 10", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.00046706199645996094], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04969000816345215], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006318092346191406], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-1-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04965019226074219]]}, {"query": "2020年4月1日涨跌幅靠后的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-4-1') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 10", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004429817199707031], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.013617277145385742], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.01256704330444336], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-4-1\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.00041794776916503906]]}]