[{"query": "开盘价小于28的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 28 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 28 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006085872650146484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 28 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006138801574707031]]}, {"query": "哪些行业的开盘价小于28", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 28 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 28 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005862236022949219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 28 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005816221237182617]]}, {"query": "最低价不大于27的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 27 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 27 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006119728088378906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 27 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005964994430541992]]}, {"query": "哪些行业的最低价不大于27", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 27 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 27 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006021022796630859], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 27 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0064542293548583984]]}, {"query": "收盘价不小于3的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price >= 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price >= 3 \nRETURN s.stock\nLIMIT 50", 0, 0.019084692001342773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price >= 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.01874852180480957]]}, {"query": "哪些股票的收盘价不小于3", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price >= 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price >= 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.014305353164672852], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price >= 3 \nRETURN s.stock.name\nLIMIT 50", 1, 0.014580726623535156]]}, {"query": "最低价小于3的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 3 \nRETURN s.stock.name\nLIMIT 50", 1, 0.007215738296508789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.008082389831542969]]}, {"query": "哪些上市公司的最低价小于3", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.013869524002075195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 3 \nRETURN s.stock\nLIMIT 50", 0, 0.010764122009277344]]}, {"query": "涨跌幅小于26的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 26 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017385482788085938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 26 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0179593563079834]]}, {"query": "哪些股票的涨跌幅小于26", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 26 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.02039313316345215], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 26 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017734527587890625]]}, {"query": "最高价小于16的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 16 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 16 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006419181823730469], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 16 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006329774856567383]]}, {"query": "哪些行业的最高价小于16", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 16 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 16 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006208658218383789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 16 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006240367889404297]]}, {"query": "最低价小于19的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 19 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 19 \nRETURN t.trade.name\nLIMIT 50", 1, 0.00603938102722168], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 19 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005913257598876953]]}, {"query": "哪些行业的最低价小于19", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 19 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 19 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006164073944091797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 19 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006221294403076172]]}, {"query": "开盘价小于23的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 23 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 23 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.020552396774291992], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 23 \nRETURN s.stock.name\nLIMIT 50", 1, 0.019747495651245117]]}, {"query": "哪些股票的开盘价小于23", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 23 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 23 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01836419105529785], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 23 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01725602149963379]]}, {"query": "最高价不大于14的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 14 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 14 \nRETURN s.stock\nLIMIT 50", 0, 0.022722959518432617], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 14 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023672103881835938]]}, {"query": "哪些股票的最高价不大于14", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 14 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 14 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018016576766967773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 14 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017203569412231445]]}, {"query": "最低价不大于50的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 50 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 50 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005854129791259766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 50 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0060198307037353516]]}, {"query": "哪些行业的最低价不大于50", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 50 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 50 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005894899368286133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 50 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005884885787963867]]}, {"query": "涨跌幅不小于2的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range >= 2 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range >= 2 \nRETURN t.trade.name\nLIMIT 50", 1, 0.00651860237121582], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range >= 2 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0058269500732421875]]}, {"query": "哪些行业的涨跌幅不小于2", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range >= 2 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range >= 2 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0058650970458984375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range >= 2 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00582575798034668]]}, {"query": "开盘价不大于22的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 22 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 22 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02362346649169922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 22 \nRETURN s.stock\nLIMIT 50", 0, 0.027551651000976562]]}, {"query": "哪些上市公司的开盘价不大于22", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 22 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 22 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02354264259338379], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 22 \nRETURN s.stock\nLIMIT 50", 0, 0.02393364906311035]]}, {"query": "涨跌幅不大于48的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 48 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 48 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007428407669067383], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 48 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005860090255737305]]}, {"query": "哪些行业的涨跌幅不大于48", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 48 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 48 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006008148193359375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 48 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005967140197753906]]}, {"query": "收盘价不大于16的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price <= 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.016776323318481445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 16 \nRETURN s.stock.name\nLIMIT 50", 1, 0.018710851669311523]]}, {"query": "哪些股票的收盘价不大于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price <= 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.016356945037841797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 16 \nRETURN s.stock.name\nLIMIT 50", 1, 0.018998146057128906]]}, {"query": "最低价小于32的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 32 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 32 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017787694931030273], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 32 \nRETURN s.stock.name\nLIMIT 50", 1, 0.018030166625976562]]}, {"query": "哪些上市公司的最低价小于32", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 32 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 32 \nRETURN s.stock\nLIMIT 50", 0, 0.021496057510375977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 32 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023284196853637695]]}, {"query": "涨跌幅不大于38的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 38 \nRETURN s.stock\nLIMIT 50", 0, 0.026806354522705078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.025872230529785156]]}, {"query": "哪些上市公司的涨跌幅不大于38", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 38 \nRETURN s.stock\nLIMIT 50", 0, 0.022538185119628906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.024510860443115234]]}, {"query": "收盘价不大于41的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= 41 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price <= 41 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006532907485961914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price <= 41 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006284952163696289]]}, {"query": "哪些行业的收盘价不大于41", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= 41 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price <= 41 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006478786468505859], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price <= 41 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006006717681884766]]}, {"query": "最高价不小于1的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price >= 1 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price >= 1 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022917747497558594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price >= 1 \nRETURN s.stock\nLIMIT 50", 0, 0.023645401000976562]]}, {"query": "哪些上市公司的最高价不小于1", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price >= 1 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price >= 1 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022761821746826172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price >= 1 \nRETURN s.stock\nLIMIT 50", 0, 0.022490501403808594]]}, {"query": "最低价不大于41的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 41 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 41 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.025776147842407227], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 41 \nRETURN s.stock\nLIMIT 50", 0, 0.023508787155151367]]}, {"query": "哪些上市公司的最低价不大于41", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 41 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 41 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02264094352722168], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 41 \nRETURN s.stock\nLIMIT 50", 0, 0.022446393966674805]]}, {"query": "涨跌幅小于36的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 36 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 36 \nRETURN s.stock.name\nLIMIT 50", 1, 0.018185853958129883], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 36 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01767444610595703]]}, {"query": "开盘价小于43的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 43 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 43 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006210803985595703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 43 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005907535552978516]]}, {"query": "哪些行业的开盘价小于43", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 43 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 43 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006356954574584961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 43 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.008863449096679688]]}, {"query": "最高价小于46的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 46 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 46 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005973339080810547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 46 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0062046051025390625]]}, {"query": "哪些行业的最高价小于46", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 46 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 46 \nRETURN t.trade.name\nLIMIT 50", 1, 0.010281801223754883], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 46 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005861043930053711]]}, {"query": "最低价大于7的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price > 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0055887699127197266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00540614128112793]]}, {"query": "哪些行业的最低价大于7", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price > 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005685329437255859], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005869388580322266]]}, {"query": "最高价不大于10的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 10 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 10 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023586511611938477], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 10 \nRETURN s.stock\nLIMIT 50", 0, 0.02230691909790039]]}, {"query": "哪些上市公司的最高价不大于10", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 10 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 10 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023117542266845703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 10 \nRETURN s.stock\nLIMIT 50", 0, 0.022629499435424805]]}, {"query": "涨跌幅小于6的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 6 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 6 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.01662588119506836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 6 \nRETURN s.stock\nLIMIT 50", 0, 0.016104459762573242]]}, {"query": "哪些上市公司的涨跌幅小于6", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 6 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 6 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.01784515380859375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 6 \nRETURN s.stock\nLIMIT 50", 0, 0.01563286781311035]]}]