[{"query": "上海石化股票的成交量在2021年7月29日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海石化' AND sd.stock_data.`date` == date('2021-07-29') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海石化\" AND sd.stock_data.`date` == date( \"2021-7-29\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01681828498840332], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-7-29\" ) AND s.stock.name == \"上海石化\" \nRETURN s.stock\nLIMIT 50", 0, 0.017382383346557617]]}, {"query": "2022年8月7日原材料行业的更新时间和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2022-08-07') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012602090835571289], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006322860717773438], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00044989585876464844], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013117551803588867]]}, {"query": "2022年8月7日的原材料行业的更新时间和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2022-08-07') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013323545455932617], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005009174346923828], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0003345012664794922], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-8-7\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013664484024047852]]}, {"query": "建筑材料的更新时间和涨跌幅和最低价在2021年6月23日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2021-06-23') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.range, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND td.trade_data.`date` == date( \"2021-6-23\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001894235610961914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-23\" ) AND t.trade.name == \"建筑\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016486644744873047]]}, {"query": "旅游和酒店的涨跌幅和更新时间和开盘价在2019年11月9日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2019-11-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-9\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006986379623413086], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date( \"2019-11-9\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006376028060913086]]}, {"query": "2021年5月25日电信服务提供商的最高价和开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2021-05-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2021-5-25\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.007419586181640625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-5-25\" ) AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.007535696029663086]]}, {"query": "2021年5月25日的电信服务提供商的最高价和开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2021-05-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2021-5-25\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.006365299224853516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-5-25\" ) AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.006185770034790039]]}, {"query": "2021年5月25日的电信服务提供商的最高价和开盘价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2021-05-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2021-5-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.009369611740112305], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-5-25\" ) AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0070953369140625]]}]