[{"query": "海通证券上市公司的最高价是不是不大于22", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海通证券' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price <= 22\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018129348754882812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016596317291259766]]}, {"query": "海通证券上市公司的最高价是否不大于22", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海通证券' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price <= 22\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018086433410644531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018122196197509766]]}, {"query": "海通证券的最低价是否不小于60", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海通证券' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 60\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017137527465820312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001703500747680664]]}, {"query": "海通证券的最低价是不是不小于60", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海通证券' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 60\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017344951629638672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016903877258300781]]}]