[{"query": "2003年12月27日到2020年8月28日的家居用品的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` >= date('2003-12-27') AND td.trade_data.`date` <= date('2020-08-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-12-27\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2020-8-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018742084503173828], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-12-27\" ) AND td.trade_data.`date` == date( \"2020-8-28\" ) AND t.trade.name == \"家居\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017693042755126953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2003-12-27\" ) AND td.trade_data.`date` == date( \"2020-8-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0016293525695800781], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-8-28\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2003-12-27\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0015416145324707031], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-8-28\" ) AND td.trade_data.`date` == date( \"2003-12-27\" ) AND t.trade.name == \"家居\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0014319419860839844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2020-8-28\" ) AND td.trade_data.`date` == date( \"2003-12-27\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0014164447784423828]]}, {"query": "家居用品2003年12月27日到2020年8月28日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` >= date('2003-12-27') AND td.trade_data.`date` <= date('2020-08-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-12-27\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2020-8-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017077922821044922], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-12-27\" ) AND td.trade_data.`date` == date( \"2020-8-28\" ) AND t.trade.name == \"家居\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0016105175018310547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2003-12-27\" ) AND td.trade_data.`date` == date( \"2020-8-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0014276504516601562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-8-28\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2003-12-27\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0014770030975341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-8-28\" ) AND td.trade_data.`date` == date( \"2003-12-27\" ) AND t.trade.name == \"家居\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0015642642974853516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2020-8-28\" ) AND td.trade_data.`date` == date( \"2003-12-27\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.00159454345703125]]}, {"query": "家居用品2003年12月27日到2020年8月28日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` >= date('2003-12-27') AND td.trade_data.`date` <= date('2020-08-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-12-27\" ) AND td.trade_data.`date` == date( \"2020-8-28\" ) AND t.trade.name == \"家居\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015707015991210938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-8-28\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2003-12-27\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014841556549072266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-8-28\" ) AND td.trade_data.`date` == date( \"2003-12-27\" ) AND t.trade.name == \"家居\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014522075653076172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2003-12-27\" ) AND td.trade_data.`date` == date( \"2020-8-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014750957489013672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-12-27\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2020-8-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014815330505371094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2020-8-28\" ) AND td.trade_data.`date` == date( \"2003-12-27\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015447139739990234]]}, {"query": "娱乐设备行业近68日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-68 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018968582153320312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0018193721771240234]]}, {"query": "娱乐设备行业近68日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-68 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0017299652099609375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0016124248504638672]]}, {"query": "近68日娱乐设备行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-68 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0019109249114990234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0016415119171142578]]}, {"query": "近59日医疗设备行业的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-59 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0018117427825927734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0015530586242675781]]}, {"query": "医疗设备行业近59日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-59 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0017352104187011719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.001501321792602539]]}, {"query": "医疗设备行业近59日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-59 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0018048286437988281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016734600067138672]]}, {"query": "电信设备近26日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-26 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.01685309410095215], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.016161441802978516]]}, {"query": "电信设备近26日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-26 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.016511201858520508], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN t.trade\nLIMIT 50", 0, 0.016831159591674805]]}, {"query": "医疗保健设施近40日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-40 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0019464492797851562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016214847564697266]]}, {"query": "医疗保健设施近40日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-40 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.001802682876586914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.001622915267944336]]}, {"query": "近40日医疗保健设施的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-40 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.001689910888671875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0016925334930419922]]}, {"query": "近79日电信行业的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-79 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2023-8-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0005362033843994141], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 19.997103214263916], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2023-8-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.4316885471343994], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2023-8-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0007846355438232422]]}, {"query": "石油和天然气近41日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-41 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.008917570114135742], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00786900520324707]]}, {"query": "石油和天然气近41日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-41 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price,m.name\nLIMIT 50", 0, 0.0008826255798339844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN td.trade_data.closing_price,m.name\nLIMIT 50", 0, 0.0005450248718261719]]}, {"query": "近41日石油和天然气的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-41 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price,m.name\nLIMIT 50", 0, 0.0008103847503662109], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN td.trade_data.closing_price,m.name\nLIMIT 50", 0, 0.0005326271057128906]]}, {"query": "医疗保健行业2019年4月5日到2019年11月19日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` >= date('2019-04-05') AND td.trade_data.`date` <= date('2019-11-19') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-4-5\" ) AND td.trade_data.`date` == date( \"2019-11-19\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0024831295013427734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-19\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-4-5\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0021173954010009766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-4-5\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-11-19\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019843578338623047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-4-5\" ) AND td.trade_data.`date` == date( \"2019-11-19\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019276142120361328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-19\" ) AND td.trade_data.`date` == date( \"2019-4-5\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018825531005859375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-11-19\" ) AND td.trade_data.`date` == date( \"2019-4-5\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019063949584960938]]}, {"query": "2019年4月5日到2019年11月19日的医疗保健行业的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` >= date('2019-04-05') AND td.trade_data.`date` <= date('2019-11-19') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-11-19\" ) AND td.trade_data.`date` == date( \"2019-4-5\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0026221275329589844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-19\" ) AND td.trade_data.`date` == date( \"2019-4-5\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002228975296020508], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-4-5\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-11-19\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002078533172607422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-4-5\" ) AND td.trade_data.`date` == date( \"2019-11-19\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019676685333251953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-4-5\" ) AND td.trade_data.`date` == date( \"2019-11-19\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018928050994873047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-19\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-4-5\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018677711486816406]]}, {"query": "医疗保健行业2019年4月5日到2019年11月19日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` >= date('2019-04-05') AND td.trade_data.`date` <= date('2019-11-19') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-11-19\" ) AND td.trade_data.`date` == date( \"2019-4-5\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0025472640991210938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-19\" ) AND td.trade_data.`date` == date( \"2019-4-5\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002288818359375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-4-5\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-11-19\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001976490020751953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-4-5\" ) AND td.trade_data.`date` == date( \"2019-11-19\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018889904022216797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-4-5\" ) AND td.trade_data.`date` == date( \"2019-11-19\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019123554229736328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-11-19\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2019-4-5\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018625259399414062]]}, {"query": "媒体和娱乐行业近10日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-10 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.009600400924682617], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01004648208618164]]}, {"query": "媒体和娱乐行业近10日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-10 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN td.trade_data.maximum_price,m.name\nLIMIT 50", 0, 0.0007448196411132812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price,m.name\nLIMIT 50", 0, 0.0004703998565673828]]}, {"query": "娱乐设备近22日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-22 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0025343894958496094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0022041797637939453]]}, {"query": "娱乐设备近22日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-22 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0031015872955322266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0025839805603027344]]}, {"query": "农业行业近38日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农业' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-38 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"农业\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0429227352142334], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"农业\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.04086017608642578]]}, {"query": "电力行业近95日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-95 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.002098560333251953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018377304077148438]]}, {"query": "电力行业近95日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-95 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018775463104248047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017023086547851562]]}, {"query": "近95日电力行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-95 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.002051115036010742], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018413066864013672]]}, {"query": "媒体和娱乐行业近29日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-29 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0062160491943359375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005882740020751953]]}, {"query": "近29日媒体和娱乐行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-29 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.000457763671875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.00039196014404296875]]}]