[{"query": "关联赤天化的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '赤天化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"赤天化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002684593200683594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"赤天化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021409988403320312]]}, {"query": "有哪些产业上游的产业关联赤天化", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '赤天化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"赤天化\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0003116130828857422], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"赤天化\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0003352165222167969]]}, {"query": "关联国联证券的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '国联证券' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0043833255767822266], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003927469253540039]]}, {"query": "有哪些产业上游的产业关联国联证券", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '国联证券' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033431053161621094], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003306865692138672]]}, {"query": "关联中粮糖业的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中粮糖业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0030896663665771484], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0031070709228515625]]}, {"query": "有哪些产业上游的产业关联中粮糖业", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中粮糖业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003522157669067383], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003874540328979492]]}, {"query": "关联重庆港的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆港' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"重庆港\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00031185150146484375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"重庆港\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002834796905517578]]}, {"query": "有哪些产业下游的产业关联重庆港", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆港' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"重庆港\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002636909484863281], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"重庆港\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00018477439880371094]]}, {"query": "上游是农业的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '农业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018646717071533203], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021638870239257812]]}, {"query": "有哪些产业上游的产业上游是农业", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '农业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001750946044921875], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020449161529541016]]}, {"query": "关联京能置业的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '京能置业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038843154907226562], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003774404525756836]]}, {"query": "有哪些产业上游的产业关联京能置业", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '京能置业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033636093139648438], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003742694854736328]]}, {"query": "关联大晟文化的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大晟文化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001397848129272461], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013527870178222656]]}, {"query": "有哪些产业上游的产业关联大晟文化", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大晟文化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014071464538574219], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001434326171875]]}, {"query": "关联东软集团的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '东软集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038535594940185547], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038726329803466797]]}, {"query": "有哪些产业上游的产业关联东软集团", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '东软集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034139156341552734], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003061532974243164]]}, {"query": "关联山东黄金的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '山东黄金' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"山东黄金\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002808570861816406], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"山东黄金\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00024247169494628906]]}, {"query": "有哪些产业下游的产业关联山东黄金", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '山东黄金' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"山东黄金\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002779960632324219], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"山东黄金\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002663135528564453]]}, {"query": "关联ST中安的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST中安' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00030231475830078125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00023174285888671875]]}, {"query": "有哪些产业上游的产业关联ST中安", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST中安' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002703666687011719], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00019502639770507812]]}, {"query": "关联爱旭股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '爱旭股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00031280517578125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00026226043701171875]]}, {"query": "有哪些产业上游的产业关联爱旭股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '爱旭股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00033402442932128906], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00027632713317871094]]}, {"query": "关联长江电力的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长江电力' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020127296447753906], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021910667419433594]]}, {"query": "有哪些产业上游的产业关联长江电力", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长江电力' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018956661224365234], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002107381820678711]]}, {"query": "关联山东药玻的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '山东药玻' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"山东药玻\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002911090850830078], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"山东药玻\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002512931823730469]]}, {"query": "有哪些产业上游的产业关联山东药玻", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '山东药玻' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"山东药玻\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002994537353515625], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"山东药玻\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.000263214111328125]]}, {"query": "上游是电子设备的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电子设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001474618911743164], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014333724975585938]]}, {"query": "有哪些产业上游的产业上游是电子设备", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电子设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013604164123535156], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013434886932373047]]}, {"query": "有哪些产业的上市公司股东是金电技通房", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '金电技通房' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"金电技通房\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.0003478527069091797], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"金电技通房\" AND s.stock.name == \"司股\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.0002598762512207031]]}, {"query": "关联长园集团的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长园集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0040607452392578125], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004030466079711914]]}, {"query": "有哪些产业下游的产业关联长园集团", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长园集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037953853607177734], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034172534942626953]]}, {"query": "关联华谊集团的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华谊集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004430055618286133], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003835439682006836]]}, {"query": "有哪些产业上游的产业关联华谊集团", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华谊集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037636756896972656], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003753662109375]]}, {"query": "关联创兴资源的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '创兴资源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"资源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00030803680419921875], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"资源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021767616271972656]]}, {"query": "有哪些产业下游的产业关联创兴资源", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '创兴资源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"资源\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002880096435546875], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"资源\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002887248992919922]]}, {"query": "上游是娱乐设备的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '娱乐设备' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014026165008544922], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001402139663696289]]}, {"query": "有哪些产业上游的产业上游是娱乐设备", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '娱乐设备' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014452934265136719], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00136566162109375]]}, {"query": "关联上海易连的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海易连' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004815816879272461], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003153562545776367]]}, {"query": "有哪些产业下游的产业关联上海易连", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海易连' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0030336380004882812], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003579854965209961]]}, {"query": "关联滨化股份的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '滨化股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00032806396484375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00025177001953125]]}, {"query": "有哪些产业下游的产业关联滨化股份", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '滨化股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00027942657470703125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00021791458129882812]]}, {"query": "关联庚星股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '庚星股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00027561187744140625], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002732276916503906]]}, {"query": "有哪些产业上游的产业关联庚星股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '庚星股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002810955047607422], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00026917457580566406]]}, {"query": "关联八一钢铁的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '八一钢铁' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"八一钢铁\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002765655517578125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"八一钢铁\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002052783966064453]]}, {"query": "有哪些产业上游的产业关联八一钢铁", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '八一钢铁' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"八一钢铁\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0003228187561035156], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"八一钢铁\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002593994140625]]}, {"query": "上游是医疗保健的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '医疗保健' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013976097106933594], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0012738704681396484]]}, {"query": "有哪些产业上游的产业上游是医疗保健", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '医疗保健' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014412403106689453], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014657974243164062]]}, {"query": "属于旅游和酒店的上市公司关联的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '旅游和酒店' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"旅游\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.00140380859375], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"旅游\" AND ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0013628005981445312]]}, {"query": "有哪些产业的上市公司属于旅游和酒店", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '旅游和酒店' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"旅游\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0014543533325195312], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"旅游\" AND ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0013246536254882812]]}, {"query": "有哪些行业包括的上市公司股东是有据地电", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '有据地电' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"有据地电\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003185272216796875], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"有据地电\" AND s.stock.name == \"司股\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00022029876708984375]]}, {"query": "关联重庆水务的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆水务' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004026651382446289], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036737918853759766]]}, {"query": "有哪些产业下游的产业关联重庆水务", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆水务' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003865480422973633], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003688335418701172]]}, {"query": "关联瑞茂通的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '瑞茂通' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034432411193847656], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003049612045288086]]}, {"query": "有哪些产业上游的产业关联瑞茂通", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '瑞茂通' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003996849060058594], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037314891815185547]]}, {"query": "上游是汽车零部件的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '汽车零部件' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017652511596679688], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020172595977783203]]}, {"query": "有哪些产业上游的产业上游是汽车零部件", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '汽车零部件' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017979145050048828], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020799636840820312]]}, {"query": "上游是家庭和个人用品的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '家庭和个人用品' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003745555877685547], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038156509399414062]]}, {"query": "有哪些产业上游的产业上游是家庭和个人用品", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '家庭和个人用品' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003358602523803711], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003355264663696289]]}, {"query": "关联国药现代的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '国药现代' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034341812133789062], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004077911376953125]]}, {"query": "关联国中水务的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '国中水务' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038542747497558594], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003789186477661133]]}, {"query": "有哪些产业上游的产业关联国中水务", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '国中水务' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033867359161376953], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032684803009033203]]}, {"query": "属于食品和饮料的上市公司涉及的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '食品和饮料' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"食品\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0015163421630859375], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"食品\" AND ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.001348257064819336]]}]