[{"query": "重庆港和晶科科技的收盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆港' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '晶科科技' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆港\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.0006105899810791016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆港\" AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003604888916015625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆港\" AND s.stock.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.00031065940856933594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆港\" \nRETURN temp\nLIMIT 50", 0, 0.00027489662170410156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND s.stock.name == \"重庆港\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003650188446044922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" AND s.stock.name == \"重庆港\" \nRETURN temp\nLIMIT 50", 0, 0.00031828880310058594]]}, {"query": "重庆港和晶科科技的收盘价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆港' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '晶科科技' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND s.stock.name == \"重庆港\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0025844573974609375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆港\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.019199132919311523], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆港\" AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.016432762145996094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆港\" AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017803430557250977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" AND s.stock.name == \"重庆港\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022368431091308594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆港\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018756389617919922]]}, {"query": "重庆港和晶科科技的收盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆港' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '晶科科技' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND s.stock.name == \"重庆港\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002682924270629883], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆港\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.01704573631286621], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆港\" AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0178530216217041], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆港\" AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01645350456237793], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" AND s.stock.name == \"重庆港\" \nRETURN s.stock\nLIMIT 50", 0, 0.002017498016357422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆港\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019943714141845703]]}, {"query": "食品和饮料和医疗保健的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN temp\nLIMIT 50", 0, 0.0006256103515625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005130767822265625]]}, {"query": "食品和饮料和医疗保健的开盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007047891616821289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.006787776947021484]]}, {"query": "浙文互联和长城电工股票的收盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙文互联' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '长城电工' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"长城电\" \nRETURN temp\nLIMIT 50", 0, 0.0005993843078613281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004127025604248047]]}, {"query": "浙文互联和长城电工股票的收盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙文互联' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '长城电工' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"长城电\" \nRETURN s.stock\nLIMIT 50", 0, 0.002208232879638672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001779317855834961]]}, {"query": "浙文互联和长城电工股票的收盘价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙文互联' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '长城电工' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"长城电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0024416446685791016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019943714141845703]]}, {"query": "房地产和纺织品和服装的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '房地产' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"服装\" AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"纺织\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002993345260620117], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"房地产\" OR indus.industry.name == \"纺织\" ) AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.002367258071899414], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"纺织\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002064228057861328], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"房地产\" OR indus.industry.name == \"纺织\" ) AND indus.industry.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001974344253540039], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"服装\" AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"纺织\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019345283508300781], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"纺织\" ) AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.001997232437133789]]}, {"query": "医疗保健和石油和天然气行业的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002100706100463867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0018093585968017578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0017392635345458984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017023086547851562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015087127685546875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014927387237548828]]}, {"query": "医疗保健和石油和天然气行业的最低价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0023682117462158203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0019431114196777344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0018224716186523438], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017690658569335938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016515254974365234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.001585245132446289]]}, {"query": "医疗保健和石油和天然气行业的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.000553131103515625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN temp\nLIMIT 50", 0, 0.0004737377166748047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN temp\nLIMIT 50", 0, 0.000423431396484375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0004086494445800781], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003657341003417969], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.00033974647521972656]]}, {"query": "零售和媒体和娱乐的收盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"媒体\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.18050885200500488], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"媒体\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.18378639221191406]]}, {"query": "天津港和退市大控股票的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天津港' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '退市大控' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大控股\" AND s.stock.name == \"天津港\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002741575241088867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"天津港\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.01839470863342285], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大控股\" AND s.stock.name == \"天津港\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019845962524414062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"天津港\" AND s.stock.name == \"大控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.019208192825317383], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大控股\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"天津港\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021638870239257812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"天津港\" AND s.stock.name == \"大控股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01823735237121582]]}, {"query": "天津港和退市大控股票的开盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天津港' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '退市大控' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"天津港\" AND s.stock.name == \"大控股\" \nRETURN temp\nLIMIT 50", 0, 0.0006587505340576172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大控股\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"天津港\" \nRETURN temp\nLIMIT 50", 0, 0.0004100799560546875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"天津港\" AND s.stock.name == \"大控股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003688335418701172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大控股\" AND s.stock.name == \"天津港\" \nRETURN temp\nLIMIT 50", 0, 0.0003485679626464844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大控股\" AND s.stock.name == \"天津港\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003349781036376953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"天津港\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"大控股\" \nRETURN temp\nLIMIT 50", 0, 0.0003294944763183594]]}, {"query": "汽车零部件和钢铁行业的涨跌幅差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '钢铁' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004994869232177734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.0003941059112548828]]}, {"query": "汽车零部件和钢铁行业的涨跌幅差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '钢铁' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.016758441925048828], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.01575160026550293]]}, {"query": "汽车零部件和钢铁行业的涨跌幅差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '钢铁' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.01821136474609375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.01528167724609375]]}, {"query": "中国医药和华鑫股份股票的开盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国医药' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '华鑫股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0007033348083496094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"医药\" \nRETURN temp\nLIMIT 50", 0, 0.0003311634063720703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医药\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.0003063678741455078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医药\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003514289855957031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医药\" \nRETURN temp\nLIMIT 50", 0, 0.00027251243591308594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医药\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.00026297569274902344]]}, {"query": "中国医药和华鑫股份股票的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国医药' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '华鑫股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0022780895233154297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医药\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018498897552490234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017418861389160156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.001608133316040039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医药\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016398429870605469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医药\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015673637390136719]]}, {"query": "中远海特和上海机场股票的成交量差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中远海特' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '上海机场' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.01595926284790039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016829967498779297]]}, {"query": "中远海特和上海机场股票的成交量差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中远海特' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '上海机场' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005915164947509766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" \nRETURN temp\nLIMIT 50", 0, 0.00032138824462890625]]}, {"query": "中远海特和上海机场股票的成交量差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中远海特' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '上海机场' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.016382455825805664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016896724700927734]]}, {"query": "兰花科创和南京化纤股票的开盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '兰花科创' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '南京化纤' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"兰花科创\" OR s.stock.name == \"南京化纤\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005197525024414062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"兰花科创\" OR s.stock.name == \"南京化纤\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003104209899902344]]}]