[{"query": "华鼎股份2014年4月27日到2021年6月8日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华鼎股份' AND sd.stock_data.`date` >= date('2014-04-27') AND sd.stock_data.`date` <= date('2021-06-08') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-4-27\" ) AND sd.stock_data.`date` == date( \"2021-6-8\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020236968994140625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-8\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2014-4-27\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018100738525390625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-4-27\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-6-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017268657684326172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-8\" ) AND sd.stock_data.`date` == date( \"2014-4-27\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018634796142578125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2014-4-27\" ) AND sd.stock_data.`date` == date( \"2021-6-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0019927024841308594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-6-8\" ) AND sd.stock_data.`date` == date( \"2014-4-27\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001712799072265625]]}, {"query": "豫光金铅股票近19日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '豫光金铅' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-19 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"豫光金铅\" \nRETURN s.stock\nLIMIT 50", 0, 0.019657611846923828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"豫光金铅\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.021156787872314453]]}, {"query": "近19日豫光金铅股票的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '豫光金铅' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-19 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"豫光金铅\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.017481327056884766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"豫光金铅\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.017578125]]}, {"query": "豫光金铅股票近19日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '豫光金铅' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-19 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"豫光金铅\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.019289493560791016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"豫光金铅\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.018006324768066406]]}, {"query": "航天长峰股票近39日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航天长峰' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-39 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"航天长峰\" \nRETURN s.stock\nLIMIT 50", 0, 0.017923593521118164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天长峰\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.022156238555908203]]}, {"query": "航天长峰股票近39日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航天长峰' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-39 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天长峰\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.02075505256652832], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"航天长峰\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.020270109176635742]]}, {"query": "近39日航天长峰股票的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航天长峰' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-39 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天长峰\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01826643943786621], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"航天长峰\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01905083656311035]]}, {"query": "佳都科技上市公司近37日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '佳都科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-37 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020699501037597656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019266605377197266]]}, {"query": "佳都科技上市公司近37日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '佳都科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-37 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0019345283508300781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017862319946289062]]}, {"query": "近37日佳都科技上市公司的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '佳都科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-37 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017917156219482422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017435550689697266]]}, {"query": "福元医股票近67日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '福元医' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-67 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018146038055419922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医股\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016062259674072266]]}, {"query": "福元医股票近67日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '福元医' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-67 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医股\" \nRETURN s.stock\nLIMIT 50", 0, 0.001768350601196289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018453598022460938]]}, {"query": "近67日福元医股票的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '福元医' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-67 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017840862274169922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医股\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015316009521484375]]}, {"query": "近38日国机汽车的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国机汽车' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-38 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001941680908203125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0020864009857177734]]}, {"query": "国机汽车近38日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国机汽车' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-38 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.002668142318725586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001800537109375]]}, {"query": "国机汽车近38日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国机汽车' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-38 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021178722381591797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020470619201660156]]}, {"query": "重庆啤酒上市公司近65日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆啤酒' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-65 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆啤酒\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.02129220962524414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆啤酒\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.02146601676940918]]}, {"query": "重庆啤酒上市公司近65日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆啤酒' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-65 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆啤酒\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.02050948143005371], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆啤酒\" \nRETURN s.stock\nLIMIT 50", 0, 0.01819896697998047]]}, {"query": "平煤股份上市公司近29日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '平煤股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.002288818359375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0023779869079589844]]}, {"query": "平煤股份上市公司近29日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '平煤股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001934051513671875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.002040863037109375]]}, {"query": "近75日三友化工股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '三友化工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-75 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三友化工\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.018748998641967773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三友化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0182497501373291]]}, {"query": "三友化工股票近75日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '三友化工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-75 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三友化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.01712512969970703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三友化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0166168212890625]]}, {"query": "三友化工股票近75日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '三友化工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-75 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三友化工\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0174407958984375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三友化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.017019987106323242]]}, {"query": "航天晨光2020年1月27日前26日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航天晨光' AND sd.stock_data.`date` <= date('2020-01-27') AND sd.stock_data.`date` > date('2020-01-27')-26 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.01764392852783203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.017846107482910156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.018761396408081055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0170135498046875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.019260168075561523], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.018649816513061523]]}, {"query": "2020年1月27日前26日的航天晨光的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航天晨光' AND sd.stock_data.`date` <= date('2020-01-27') AND sd.stock_data.`date` > date('2020-01-27')-26 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.02140212059020996], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.017247676849365234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.016835689544677734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.020511865615844727], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.027460098266601562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.019402027130126953]]}, {"query": "航天晨光2020年1月27日前26日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航天晨光' AND sd.stock_data.`date` <= date('2020-01-27') AND sd.stock_data.`date` > date('2020-01-27')-26 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN s.stock\nLIMIT 50", 0, 0.019419193267822266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015549659729003906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01823902130126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" \nRETURN s.stock\nLIMIT 50", 0, 0.019225358963012695], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" \nRETURN s.stock\nLIMIT 50", 0, 0.01659560203552246], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN s.stock\nLIMIT 50", 0, 0.020596742630004883]]}, {"query": "航天晨光2020年1月27日前26天的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航天晨光' AND sd.stock_data.`date` <= date('2020-01-27') AND sd.stock_data.`date` > date('2020-01-27')-26 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.017873764038085938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.018344879150390625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" AND sd.stock_data.`date` == date( \"2020-1-27\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.017911911010742188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 26 AND s.stock.name == \"航天晨光\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0167233943939209], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" AND date('2023-11-11') - sd.stock_data.`date` <= 26 \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.016817331314086914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 26 AND sd.stock_data.`date` == date( \"2020-1-27\" ) AND s.stock.name == \"航天晨光\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.016387224197387695]]}, {"query": "2020年4月5日前9日的江苏有线股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏有线' AND sd.stock_data.`date` <= date('2020-04-05') AND sd.stock_data.`date` > date('2020-04-05')-9 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 9 AND sd.stock_data.`date` == date( \"2020-4-5\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02985358238220215], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-5\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.022505521774291992]]}, {"query": "江苏有线股票2020年4月5日前9日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏有线' AND sd.stock_data.`date` <= date('2020-04-05') AND sd.stock_data.`date` > date('2020-04-05')-9 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 9 AND sd.stock_data.`date` == date( \"2020-4-5\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021168947219848633], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-5\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.02446746826171875]]}, {"query": "江苏有线股票2020年4月5日前9天的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏有线' AND sd.stock_data.`date` <= date('2020-04-05') AND sd.stock_data.`date` > date('2020-04-05')-9 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 9 AND sd.stock_data.`date` == date( \"2020-4-5\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.022902727127075195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-5\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.023619651794433594]]}, {"query": "江苏有线股票2020年4月5日前9日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏有线' AND sd.stock_data.`date` <= date('2020-04-05') AND sd.stock_data.`date` > date('2020-04-05')-9 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 9 AND sd.stock_data.`date` == date( \"2020-4-5\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02220296859741211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-5\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 9 \nRETURN s.stock\nLIMIT 50", 0, 0.021758317947387695]]}, {"query": "正源股份2008年4月10日到2022年11月11日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '正源股份' AND sd.stock_data.`date` >= date('2008-04-10') AND sd.stock_data.`date` <= date('2022-11-11') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2008-4-10\" ) AND sd.stock_data.`date` == date( \"2022-11-11\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0020203590393066406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2008-4-10\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-11-11\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017261505126953125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-11\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2008-4-10\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016510486602783203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2008-4-10\" ) AND sd.stock_data.`date` == date( \"2022-11-11\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016086101531982422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-11-11\" ) AND sd.stock_data.`date` == date( \"2008-4-10\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015344619750976562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-11\" ) AND sd.stock_data.`date` == date( \"2008-4-10\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016245841979980469]]}]