[{"query": "2002年4月25日到2023年12月31日的复旦复华股票的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` >= date('2002-04-25') AND sd.stock_data.`date` <= date('2023-12-31') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2002-4-25\" ) AND sd.stock_data.`date` == date( \"2023-12-31\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01698160171508789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-31\" ) AND s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2002-4-25\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.017218351364135742], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-4-25\" ) AND sd.stock_data.`date` == date( \"2023-12-31\" ) AND s.stock.name == \"复旦复华\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01563858985900879], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2023-12-31\" ) AND sd.stock_data.`date` == date( \"2002-4-25\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01768183708190918], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-4-25\" ) AND s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2023-12-31\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.014894247055053711], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-31\" ) AND sd.stock_data.`date` == date( \"2002-4-25\" ) AND s.stock.name == \"复旦复华\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.015246391296386719]]}, {"query": "复旦复华股票2002年4月25日到2023年12月31日的成交量是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` >= date('2002-04-25') AND sd.stock_data.`date` <= date('2023-12-31') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-31\" ) AND sd.stock_data.`date` == date( \"2002-4-25\" ) AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.014961481094360352], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-31\" ) AND s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2002-4-25\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015402555465698242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-4-25\" ) AND s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2023-12-31\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01577138900756836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2002-4-25\" ) AND sd.stock_data.`date` == date( \"2023-12-31\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01485133171081543], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2023-12-31\" ) AND sd.stock_data.`date` == date( \"2002-4-25\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016063690185546875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-4-25\" ) AND sd.stock_data.`date` == date( \"2023-12-31\" ) AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.015910863876342773]]}, {"query": "复旦复华股票2002年4月25日到2023年12月31日的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` >= date('2002-04-25') AND sd.stock_data.`date` <= date('2023-12-31') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2002-4-25\" ) AND sd.stock_data.`date` == date( \"2023-12-31\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.017454147338867188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-31\" ) AND s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2002-4-25\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016736507415771484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-4-25\" ) AND sd.stock_data.`date` == date( \"2023-12-31\" ) AND s.stock.name == \"复旦复华\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.017975568771362305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2023-12-31\" ) AND sd.stock_data.`date` == date( \"2002-4-25\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01808452606201172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-4-25\" ) AND s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date( \"2023-12-31\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01780390739440918], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-31\" ) AND sd.stock_data.`date` == date( \"2002-4-25\" ) AND s.stock.name == \"复旦复华\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01513528823852539]]}, {"query": "黄山旅游股票近74日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '黄山旅游' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-74 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"黄山旅游\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016236305236816406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"黄山旅游\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.015922069549560547]]}, {"query": "黄山旅游股票近74日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '黄山旅游' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-74 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"黄山旅游\" \nRETURN s.stock\nLIMIT 50", 0, 0.0182342529296875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"黄山旅游\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015926837921142578]]}, {"query": "国机通用股票2022年6月8日前24天的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国机通用' AND sd.stock_data.`date` <= date('2022-06-08') AND sd.stock_data.`date` > date('2022-06-08')-24 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 24 AND sd.stock_data.`date` == date( \"2022-6-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.024263381958007812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-8\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 24 \nRETURN s.stock\nLIMIT 50", 0, 0.02332139015197754]]}, {"query": "国机通用股票2022年6月8日前24日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国机通用' AND sd.stock_data.`date` <= date('2022-06-08') AND sd.stock_data.`date` > date('2022-06-08')-24 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 24 AND sd.stock_data.`date` == date( \"2022-6-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02603936195373535], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-8\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 24 \nRETURN s.stock\nLIMIT 50", 0, 0.054811954498291016]]}, {"query": "2022年6月8日前24日的国机通用股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国机通用' AND sd.stock_data.`date` <= date('2022-06-08') AND sd.stock_data.`date` > date('2022-06-08')-24 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 24 AND sd.stock_data.`date` == date( \"2022-6-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.022778034210205078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-8\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 24 \nRETURN s.stock\nLIMIT 50", 0, 0.022785186767578125]]}, {"query": "国机通用股票2022年6月8日前24日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国机通用' AND sd.stock_data.`date` <= date('2022-06-08') AND sd.stock_data.`date` > date('2022-06-08')-24 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 24 AND sd.stock_data.`date` == date( \"2022-6-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.025076627731323242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-8\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 24 \nRETURN s.stock\nLIMIT 50", 0, 0.021954059600830078]]}, {"query": "近30日玉龙股份上市公司的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '玉龙股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-30 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0018570423126220703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0018115043640136719]]}, {"query": "玉龙股份上市公司近30日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '玉龙股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-30 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0018644332885742188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0017333030700683594]]}, {"query": "玉龙股份上市公司近30日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '玉龙股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-30 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017440319061279297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016326904296875]]}, {"query": "近67日兴发集团股票的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '兴发集团' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-67 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"兴发集团\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016251564025878906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"兴发集团\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016673803329467773]]}, {"query": "兴发集团股票近67日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '兴发集团' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-67 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"兴发集团\" \nRETURN s.stock\nLIMIT 50", 0, 0.016160011291503906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"兴发集团\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016050100326538086]]}, {"query": "近98日天房发展上市公司的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天房发展' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"天房发展\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01603841781616211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"天房发展\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.015594720840454102]]}, {"query": "天房发展上市公司近98日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天房发展' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"天房发展\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01580357551574707], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"天房发展\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01853799819946289]]}, {"query": "天房发展上市公司近98日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天房发展' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"天房发展\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016660690307617188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"天房发展\" \nRETURN s.stock\nLIMIT 50", 0, 0.01595926284790039]]}, {"query": "近16日金牛化工上市公司的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金牛化工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-16 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"化工\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019278526306152344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017185211181640625]]}, {"query": "金牛化工上市公司近16日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金牛化工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-16 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"化工\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0018243789672851562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001628875732421875]]}, {"query": "金牛化工上市公司近16日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金牛化工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-16 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017518997192382812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015330314636230469]]}, {"query": "海油工程2022年6月6日后95日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` >= date('2022-06-06') AND sd.stock_data.`date` < date('2022-06-06')+95 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-6\" ) AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.016097545623779297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date( \"2022-6-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01758265495300293]]}, {"query": "海油工程2022年6月6日后95天的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` >= date('2022-06-06') AND sd.stock_data.`date` < date('2022-06-06')+95 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date( \"2022-6-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.018493175506591797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-6\" ) AND s.stock.name == \"海油工程\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0156710147857666]]}, {"query": "海油工程2022年6月6日后95日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` >= date('2022-06-06') AND sd.stock_data.`date` < date('2022-06-06')+95 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date( \"2022-6-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01716303825378418], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-6\" ) AND s.stock.name == \"海油工程\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.015892744064331055]]}, {"query": "2022年6月6日后95日的海油工程的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` >= date('2022-06-06') AND sd.stock_data.`date` < date('2022-06-06')+95 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date( \"2022-6-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01567387580871582], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-6-6\" ) AND s.stock.name == \"海油工程\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01664590835571289]]}, {"query": "汉马科技上市公司近90日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '汉马科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-90 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018017292022705078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016682147979736328]]}, {"query": "汉马科技上市公司近90日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '汉马科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-90 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019085407257080078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0014925003051757812]]}, {"query": "近90日汉马科技上市公司的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '汉马科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-90 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017066001892089844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016090869903564453]]}, {"query": "江苏舜天近55日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏舜天' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-55 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"江苏舜天\" \nRETURN s.stock\nLIMIT 50", 0, 0.016335487365722656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏舜天\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01698780059814453]]}, {"query": "江苏舜天近55日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏舜天' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-55 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"江苏舜天\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017066001892089844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏舜天\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017286300659179688]]}, {"query": "2021年6月23日前1日的恒瑞医药的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '恒瑞医药' AND sd.stock_data.`date` <= date('2021-06-23') AND sd.stock_data.`date` > date('2021-06-23')-1 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01701188087463379], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.021338939666748047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01736140251159668], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017229795455932617], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.019015789031982422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01733112335205078]]}, {"query": "恒瑞医药2021年6月23日前1天的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '恒瑞医药' AND sd.stock_data.`date` <= date('2021-06-23') AND sd.stock_data.`date` > date('2021-06-23')-1 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017946243286132812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017492055892944336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017453908920288086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017390727996826172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.02147364616394043], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01755523681640625]]}, {"query": "恒瑞医药2021年6月23日前1日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '恒瑞医药' AND sd.stock_data.`date` <= date('2021-06-23') AND sd.stock_data.`date` > date('2021-06-23')-1 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017708301544189453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.018154382705688477], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01806354522705078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.018275976181030273], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017025232315063477], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.019452571868896484]]}]