[{"query": "船舶和海运和医疗保健的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013604164123535156], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014433860778808594]]}, {"query": "汽车和高科技的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"科技\" \nRETURN indus.industry\nLIMIT 50", 0, 0.0016570091247558594], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" AND indus.industry.name == \"汽车\" \nRETURN indus.industry\nLIMIT 50", 0, 0.0013988018035888672]]}, {"query": "汽车和高科技的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"科技\" \nRETURN indus.industry\nLIMIT 50", 0, 0.0016171932220458984], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" AND indus.industry.name == \"汽车\" \nRETURN indus.industry\nLIMIT 50", 0, 0.0013430118560791016]]}, {"query": "汽车和高科技的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" AND indus.industry.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.0002930164337158203], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.00020623207092285156]]}, {"query": "北大荒和金瑞矿业股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '北大荒' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '金瑞矿业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"北大荒\" AND s.stock.name == \"矿业\" \nRETURN s.stock\nLIMIT 50", 0, 0.001710653305053711], ["MATCH (s:stock)\nWHERE s.stock.name == \"矿业\" AND s.stock.name == \"北大荒\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013668537139892578]]}, {"query": "北大荒和金瑞矿业股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '北大荒' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '金瑞矿业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"北大荒\" AND s.stock.name == \"矿业\" \nRETURN temp\nLIMIT 50", 0, 0.00029015541076660156], ["MATCH (s:stock)\nWHERE s.stock.name == \"矿业\" AND s.stock.name == \"北大荒\" \nRETURN temp\nLIMIT 50", 0, 0.0002570152282714844]]}, {"query": "外运发展和桐昆股份的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '外运发展' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '桐昆股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"外运发展\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.0003159046173095703], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"外运发展\" \nRETURN temp\nLIMIT 50", 0, 0.0002777576446533203]]}, {"query": "外运发展和桐昆股份的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '外运发展' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '桐昆股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"外运发展\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013608932495117188], ["MATCH (s:stock)\nWHERE s.stock.name == \"外运发展\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001623392105102539]]}, {"query": "豫园股份和中再资环股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '豫园股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中再资环' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资环\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.0002789497375488281], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"资环\" \nRETURN temp\nLIMIT 50", 0, 0.0002605915069580078]]}, {"query": "豫园股份和中再资环股票的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '豫园股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中再资环' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"资环\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013463497161865234], ["MATCH (s:stock)\nWHERE s.stock.name == \"资环\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013580322265625]]}, {"query": "电子设备和娱乐设备产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电子设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"娱乐\" AND indus.industry.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.0003323554992675781], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"电子\" AND indus.industry.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.00028705596923828125]]}, {"query": "电子设备和娱乐设备产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电子设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND indus.industry.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014324188232421875], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电子\" AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013859272003173828]]}, {"query": "娱乐设备和化妆品产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化妆品' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013995170593261719], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"化妆品\" AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022563934326171875]]}, {"query": "娱乐设备和化妆品产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化妆品' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"化妆品\" AND indus.industry.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.0003173351287841797], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"娱乐\" AND indus.industry.name == \"化妆品\" \nRETURN temp\nLIMIT 50", 0, 0.0002105236053466797]]}, {"query": "娱乐设备和化妆品产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化妆品' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.001430511474609375], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"化妆品\" AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022935867309570312]]}, {"query": "化学和农业机械的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '化学' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业机械' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002108335494995117], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002150297164916992], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"农业\" ) \nRETURN temp\nLIMIT 50", 0, 0.002656221389770508], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"农业\" ) \nRETURN temp\nLIMIT 50", 0, 0.002706766128540039]]}, {"query": "博闻科技和盘江股份的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '博闻科技' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '盘江股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"盘江股份\" ) AND s.stock.name == \"科技\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"盘江股份\" ) AND s.stock.name == \"盘江股份\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"盘江股份\" ) \nRETURN temp\nLIMIT 50", 0, 0.002492666244506836], ["MATCH (s:stock)\nWHERE s.stock.name == \"科技\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE s.stock.name == \"盘江股份\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"盘江股份\" ) \nRETURN temp\nLIMIT 50", 0, 0.0022377967834472656], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"盘江股份\" ) AND s.stock.name == \"科技\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE s.stock.name == \"盘江股份\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0020215511322021484], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"盘江股份\" ) AND s.stock.name == \"科技\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"盘江股份\" ) AND s.stock.name == \"盘江股份\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0021719932556152344]]}, {"query": "瀚叶股份和西部黄金股票的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '瀚叶股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '西部黄金' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001367807388305664], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"金股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0011854171752929688]]}, {"query": "瀚叶股份和西部黄金股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '瀚叶股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '西部黄金' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012869834899902344], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"金股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012257099151611328]]}, {"query": "纺织品和服装和电力工具和设备的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"服装\" OR t.trade.name == \"电力\" ) AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.001275777816772461], ["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND ( t.trade.name == \"服装\" OR t.trade.name == \"电力\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0013308525085449219]]}, {"query": "纺织品和服装和电力工具和设备的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"服装\" OR t.trade.name == \"电力\" ) AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013432502746582031], ["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND ( t.trade.name == \"服装\" OR t.trade.name == \"电力\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0013954639434814453]]}, {"query": "纺织品和服装和电力工具和设备的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"服装\" OR t.trade.name == \"电力\" ) AND t.trade.name == \"纺织\" \nRETURN temp\nLIMIT 50", 0, 0.0003516674041748047], ["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND ( t.trade.name == \"服装\" OR t.trade.name == \"电力\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002846717834472656]]}, {"query": "厦门钨业和退市中房股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '厦门钨业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '退市中房' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"中房股\" AND s.stock.name == \"厦门钨业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012865066528320312], ["MATCH (s:stock)\nWHERE s.stock.name == \"厦门钨业\" AND s.stock.name == \"中房股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016326904296875]]}, {"query": "厦门钨业和退市中房股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '厦门钨业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '退市中房' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"中房股\" AND s.stock.name == \"厦门钨业\" \nRETURN temp\nLIMIT 50", 0, 0.0002639293670654297], ["MATCH (s:stock)\nWHERE s.stock.name == \"厦门钨业\" AND s.stock.name == \"中房股\" \nRETURN temp\nLIMIT 50", 0, 0.00031280517578125]]}, {"query": "厦门钨业和退市中房股票的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '厦门钨业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '退市中房' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"中房股\" AND s.stock.name == \"厦门钨业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013012886047363281], ["MATCH (s:stock)\nWHERE s.stock.name == \"厦门钨业\" AND s.stock.name == \"中房股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017812252044677734]]}, {"query": "魏谷梁和朱云的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '魏谷梁' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '朱云' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"魏谷梁\" OR fm.fund_manager.name == \"朱云\" ) AND fm.fund_manager.name == \"魏谷梁\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"魏谷梁\" OR fm.fund_manager.name == \"朱云\" ) AND fm.fund_manager.name == \"朱云\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"魏谷梁\" OR fm.fund_manager.name == \"朱云\" ) \nRETURN temp\nLIMIT 50", 0, 0.00030922889709472656], ["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏谷梁\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱云\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"魏谷梁\" OR fm.fund_manager.name == \"朱云\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003070831298828125], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"魏谷梁\" OR fm.fund_manager.name == \"朱云\" ) AND fm.fund_manager.name == \"魏谷梁\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"魏谷梁\" OR fm.fund_manager.name == \"朱云\" ) AND fm.fund_manager.name == \"朱云\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00021457672119140625], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"魏谷梁\" OR fm.fund_manager.name == \"朱云\" ) AND fm.fund_manager.name == \"魏谷梁\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱云\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00017690658569335938]]}, {"query": "家居用品和媒体和娱乐产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"家居\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014328956604003906], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015225410461425781]]}, {"query": "家居用品和媒体和娱乐产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"家居\" \nRETURN temp\nLIMIT 50", 0, 0.00031828880310058594], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"家居\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002243518829345703]]}, {"query": "能源和农业机械的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '能源' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业机械' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"农业\" ) \nRETURN temp\nLIMIT 50", 0, 0.0026290416717529297], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002168893814086914], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"农业\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002031087875366211], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"机械\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"农业\" ) \nRETURN temp\nLIMIT 50", 0, 0.0025415420532226562]]}, {"query": "航天机电和华域汽车上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '航天机电' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '华域汽车' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"航天机电\" AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016818046569824219], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.name == \"航天机电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014395713806152344]]}, {"query": "航天机电和华域汽车上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '航天机电' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '华域汽车' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.name == \"航天机电\" \nRETURN temp\nLIMIT 50", 0, 0.00028324127197265625], ["MATCH (s:stock)\nWHERE s.stock.name == \"航天机电\" AND s.stock.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.0002760887145996094]]}, {"query": "航天机电和华域汽车上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '航天机电' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '华域汽车' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"航天机电\" AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016262531280517578], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.name == \"航天机电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013954639434814453]]}, {"query": "吴上官和魏闾丘的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '吴上官' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '魏闾丘' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吴上官\" OR fm.fund_manager.name == \"魏闾丘\" ) AND fm.fund_manager.name == \"吴上官\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吴上官\" OR fm.fund_manager.name == \"魏闾丘\" ) AND fm.fund_manager.name == \"魏闾丘\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002732276916503906], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吴上官\" OR fm.fund_manager.name == \"魏闾丘\" ) AND fm.fund_manager.name == \"吴上官\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吴上官\" OR fm.fund_manager.name == \"魏闾丘\" ) AND fm.fund_manager.name == \"魏闾丘\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吴上官\" OR fm.fund_manager.name == \"魏闾丘\" ) \nRETURN temp\nLIMIT 50", 0, 0.00022292137145996094], ["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴上官\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏闾丘\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吴上官\" OR fm.fund_manager.name == \"魏闾丘\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002105236053466797], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吴上官\" OR fm.fund_manager.name == \"魏闾丘\" ) AND fm.fund_manager.name == \"吴上官\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏闾丘\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00021457672119140625]]}, {"query": "娱乐设备和农产品产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农产品' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND s.stock.name == \"农产品\" \nRETURN temp\nLIMIT 50", 0, 0.00033354759216308594], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"农产品\" AND indus.industry.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.0002930164337158203]]}, {"query": "娱乐设备和农产品产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农产品' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014657974243164062], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"农产品\" AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.00139617919921875]]}, {"query": "娱乐设备和农产品产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农产品' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018491744995117188], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"农产品\" AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.001474618911743164]]}, {"query": "中信建投景益债券C和融通通泰保本A基金的管理费差多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '中信建投景益债券C' WITH pof.public_offering_fund.management_fee AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通通泰保本A' WITH ABS(pof.public_offering_fund.management_fee - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"建投\" \nRETURN temp\nLIMIT 50", 0, 0.0003037452697753906], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"建投\" AND pof.public_offering_fund.name == \"融通\" \nRETURN temp\nLIMIT 50", 0, 0.00024056434631347656]]}, {"query": "中信建投景益债券C和融通通泰保本A基金的管理费差额是多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '中信建投景益债券C' WITH pof.public_offering_fund.management_fee AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通通泰保本A' WITH ABS(pof.public_offering_fund.management_fee - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"建投\" AND pof.public_offering_fund.name == \"融通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013010501861572266], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"建投\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013346672058105469]]}, {"query": "风神股份和中国黄金股票的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '风神股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中国黄金' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013382434844970703], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"金股\" \nRETURN s.stock\nLIMIT 50", 0, 0.001277923583984375]]}, {"query": "风神股份和中国黄金股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '风神股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中国黄金' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.0002899169921875], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"金股\" \nRETURN temp\nLIMIT 50", 0, 0.00025081634521484375]]}, {"query": "风神股份和中国黄金股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '风神股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '中国黄金' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012912750244140625], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"金股\" \nRETURN s.stock\nLIMIT 50", 0, 0.001310110092163086]]}]