[{"query": "上海建工上市公司1995年8月3日到2021年10月24日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海建工' AND sd.stock_data.`date` >= date('1995-08-03') AND sd.stock_data.`date` <= date('2021-10-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-10-24\" ) AND sd.stock_data.`date` == date( \"1995-8-3\" ) AND s.stock.name == \"上海建工\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.022301673889160156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-10-24\" ) AND s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"1995-8-3\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.021674633026123047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1995-8-3\" ) AND s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"2021-10-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.017232179641723633], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"2021-10-24\" ) AND sd.stock_data.`date` == date( \"1995-8-3\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.02247142791748047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"1995-8-3\" ) AND sd.stock_data.`date` == date( \"2021-10-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.02168726921081543], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1995-8-3\" ) AND sd.stock_data.`date` == date( \"2021-10-24\" ) AND s.stock.name == \"上海建工\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.020338773727416992]]}, {"query": "1995年8月3日到2021年10月24日的上海建工上市公司的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海建工' AND sd.stock_data.`date` >= date('1995-08-03') AND sd.stock_data.`date` <= date('2021-10-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-10-24\" ) AND sd.stock_data.`date` == date( \"1995-8-3\" ) AND s.stock.name == \"上海建工\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.02120208740234375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-10-24\" ) AND s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"1995-8-3\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.018169641494750977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1995-8-3\" ) AND s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"2021-10-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01857280731201172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"2021-10-24\" ) AND sd.stock_data.`date` == date( \"1995-8-3\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.019977331161499023], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date( \"1995-8-3\" ) AND sd.stock_data.`date` == date( \"2021-10-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.02416396141052246], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1995-8-3\" ) AND sd.stock_data.`date` == date( \"2021-10-24\" ) AND s.stock.name == \"上海建工\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.019597291946411133]]}, {"query": "安彩高科股票近63日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '安彩高科' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-63 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0007731914520263672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"安彩高科\" \nRETURN s.stock\nLIMIT 50", 0, 0.052315711975097656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006957054138183594], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"安彩高科\" \nRETURN s.stock\nLIMIT 50", 0, 0.5230445861816406]]}, {"query": "安彩高科股票近63日的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '安彩高科' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-63 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0007889270782470703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.06693267822265625], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 5.775392293930054], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-9-5\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安彩高科\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0008833408355712891]]}, {"query": "紫江企业近20日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '紫江企业' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-20 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"紫江企业\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.016106605529785156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"紫江企业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.016596555709838867]]}, {"query": "紫江企业近20日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '紫江企业' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-20 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"紫江企业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01920175552368164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"紫江企业\" \nRETURN s.stock\nLIMIT 50", 0, 0.016492605209350586]]}, {"query": "博闻科技上市公司近67日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-67 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021228790283203125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002002239227294922]]}, {"query": "近67日博闻科技上市公司的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-67 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0020208358764648438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0018680095672607422]]}, {"query": "2020年8月6日前12日的盛和资源股票的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` <= date('2020-08-06') AND sd.stock_data.`date` > date('2020-08-06')-12 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017218589782714844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001622915267944336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.002322673797607422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015969276428222656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001489400863647461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015251636505126953]]}, {"query": "盛和资源股票2020年8月6日前12日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` <= date('2020-08-06') AND sd.stock_data.`date` > date('2020-08-06')-12 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017783641815185547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017063617706298828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0022296905517578125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016753673553466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001859903335571289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017688274383544922]]}, {"query": "盛和资源股票2020年8月6日前12日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` <= date('2020-08-06') AND sd.stock_data.`date` > date('2020-08-06')-12 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN s.stock\nLIMIT 50", 0, 0.0022912025451660156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020241737365722656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0019145011901855469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN s.stock\nLIMIT 50", 0, 0.0018475055694580078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016450881958007812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015845298767089844]]}, {"query": "盛和资源股票2020年8月6日前12天的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` <= date('2020-08-06') AND sd.stock_data.`date` > date('2020-08-06')-12 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017502307891845703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015251636505126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016274452209472656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-8-6\" ) AND s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016057491302490234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 12 AND s.stock.name == \"资源\" AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015132427215576172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND date('2023-11-11') - sd.stock_data.`date` <= 12 AND sd.stock_data.`date` == date( \"2020-8-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015492439270019531]]}, {"query": "中国人保1992年6月24日到2021年8月30日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国人保' AND sd.stock_data.`date` >= date('1992-06-24') AND sd.stock_data.`date` <= date('2021-08-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-30\" ) AND sd.stock_data.`date` == date( \"1992-6-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.026305675506591797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1992-6-24\" ) AND sd.stock_data.`date` == date( \"2021-8-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0020949840545654297]]}, {"query": "中国人保1992年6月24日到2021年8月30日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国人保' AND sd.stock_data.`date` >= date('1992-06-24') AND sd.stock_data.`date` <= date('2021-08-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-30\" ) AND sd.stock_data.`date` == date( \"1992-6-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018545150756835938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1992-6-24\" ) AND sd.stock_data.`date` == date( \"2021-8-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018143653869628906]]}, {"query": "山西焦化股票近98日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '山西焦化' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"山西焦化\" \nRETURN s.stock\nLIMIT 50", 0, 0.016785383224487305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"山西焦化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016535282135009766]]}, {"query": "山西焦化股票近98日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '山西焦化' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"山西焦化\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.015548229217529297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"山西焦化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.015549659729003906]]}, {"query": "近98日山西焦化股票的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '山西焦化' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"山西焦化\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016084671020507812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"山西焦化\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016434431076049805]]}, {"query": "近69日格力地产的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '格力地产' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-69 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0018973350524902344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017592906951904297]]}, {"query": "格力地产近69日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '格力地产' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-69 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.002246856689453125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0019347667694091797]]}, {"query": "近28日浙数文化的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙数文化' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.3446362018585205], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0032210350036621094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.001895904541015625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.00042057037353515625]]}, {"query": "浙数文化近28日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙数文化' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005686283111572266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0003705024719238281], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"文化\" \nRETURN s.stock\nLIMIT 50", 0, 0.34528684616088867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-10-10\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"文化\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"文化\" \nRETURN s.stock\nLIMIT 50", 0, 0.0031995773315429688]]}, {"query": "法拉电子上市公司近55日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '法拉电子' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-55 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"法拉电子\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.017815828323364258], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"法拉电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.019959211349487305]]}, {"query": "法拉电子上市公司近55日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '法拉电子' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-55 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"法拉电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.015961885452270508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"法拉电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01623368263244629]]}, {"query": "上海三毛2003年7月22日到2021年3月10日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海三毛' AND sd.stock_data.`date` >= date('2003-07-22') AND sd.stock_data.`date` <= date('2021-03-10') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2003-7-22\" ) AND sd.stock_data.`date` == date( \"2021-3-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.019938230514526367], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-10\" ) AND sd.stock_data.`date` == date( \"2003-7-22\" ) AND s.stock.name == \"上海三毛\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01702260971069336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-7-22\" ) AND sd.stock_data.`date` == date( \"2021-3-10\" ) AND s.stock.name == \"上海三毛\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016454696655273438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2021-3-10\" ) AND sd.stock_data.`date` == date( \"2003-7-22\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.015761613845825195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-10\" ) AND s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2003-7-22\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01584935188293457], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-7-22\" ) AND s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2021-3-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.015787601470947266]]}]