[{"query": "重庆水务和恒丰纸业上市公司的最低价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆水务' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '恒丰纸业' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒丰纸业\" \nRETURN s.stock\nLIMIT 50", 0, 0.020721912384033203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒丰纸业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017456769943237305]]}, {"query": "重庆水务和恒丰纸业上市公司的最低价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆水务' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '恒丰纸业' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"恒丰纸业\" \nRETURN s.stock\nLIMIT 50", 0, 0.01652240753173828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒丰纸业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015954256057739258]]}, {"query": "金融服务和金融技术行业的收盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006084442138671875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0004107952117919922]]}, {"query": "金融服务和金融技术行业的收盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007662773132324219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006612062454223633]]}, {"query": "金融服务和金融技术行业的收盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007027864456176758], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006285190582275391]]}, {"query": "华升股份和海欣股份股票的最高价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华升股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '海欣股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"海欣股份\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019625186920166016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"海欣股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021448850631713867]]}, {"query": "农产品和电信服务提供商行业的收盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农产品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"电信\" ) \nRETURN s.stock\nLIMIT 50", 0, 6.941783666610718], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.0532965660095215], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"电信\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.024178743362427], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"电信\" ) \nRETURN s.stock\nLIMIT 50", 0, 7.5870044231414795], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.3307764530181885], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"电信\" ) AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.190800666809082]]}, {"query": "能源和船舶和海运行业的涨跌幅差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"能源\" OR indus.industry.name == \"船舶\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.2248549461364746], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.22654938697814941]]}, {"query": "能源和船舶和海运行业的涨跌幅差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"能源\" OR indus.industry.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0007975101470947266], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"能源\" OR indus.industry.name == \"船舶\" ) \nRETURN temp\nLIMIT 50", 0, 0.0006206035614013672]]}, {"query": "光大证券和保税科技的现价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光大证券' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '保税科技' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"大证券\" WITH as temp1\nMATCH (s:stock)\nWHERE s.stock.name == \"保税科技\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"大证券\" OR s.stock.name == \"保税科技\" ) \nRETURN temp\nLIMIT 50", 0, 0.0006487369537353516], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"大证券\" OR s.stock.name == \"保税科技\" ) AND s.stock.name == \"大证券\" WITH as temp1\nMATCH (s:stock)\nWHERE ( s.stock.name == \"大证券\" OR s.stock.name == \"保税科技\" ) AND s.stock.name == \"保税科技\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"大证券\" OR s.stock.name == \"保税科技\" ) \nRETURN temp\nLIMIT 50", 0, 0.00045490264892578125], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"大证券\" OR s.stock.name == \"保税科技\" ) AND s.stock.name == \"大证券\" WITH as temp1\nMATCH (s:stock)\nWHERE s.stock.name == \"保税科技\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00041294097900390625], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"大证券\" OR s.stock.name == \"保税科技\" ) AND s.stock.name == \"大证券\" WITH as temp1\nMATCH (s:stock)\nWHERE ( s.stock.name == \"大证券\" OR s.stock.name == \"保税科技\" ) AND s.stock.name == \"保税科技\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0003082752227783203]]}, {"query": "消费品和汽车的最低价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '消费品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.024981260299682617], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.023999691009521484]]}, {"query": "消费品和汽车的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '消费品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0252687931060791], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.023269176483154297]]}, {"query": "消费品和汽车的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '消费品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.0008437633514404297], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005321502685546875]]}, {"query": "会稽山和财通证券的成交量差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '会稽山' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '财通证券' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0029332637786865234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.004119157791137695]]}, {"query": "会稽山和财通证券的成交量差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '会稽山' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '财通证券' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通证券\" \nRETURN s.stock\nLIMIT 50", 0, 0.0027112960815429688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通证券\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002484560012817383]]}, {"query": "农产品和汽车零部件行业的开盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农产品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.328732013702393], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.304954290390015], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) \nRETURN s.stock\nLIMIT 50", 0, 7.265745162963867], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.268998146057129], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.588268280029297], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) \nRETURN s.stock\nLIMIT 50", 0, 7.189613103866577]]}, {"query": "农产品和汽车零部件行业的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农产品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) \nRETURN temp\nLIMIT 50", 0, 0.0018703937530517578], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005004405975341797], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00040340423583984375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004138946533203125], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003097057342529297], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"汽车\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0002989768981933594]]}, {"query": "建筑材料和运输和物流行业的最高价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"建筑\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.0006000995635986328], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"建筑\" \nRETURN temp\nLIMIT 50", 0, 0.00037860870361328125]]}, {"query": "建筑材料和运输和物流行业的最高价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"建筑\" \nRETURN t.trade\nLIMIT 50", 0, 0.0026857852935791016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"建筑\" \nRETURN t.trade\nLIMIT 50", 0, 0.0025959014892578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"建筑\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0017664432525634766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"建筑\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016140937805175781], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015892982482910156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.016266345977783203]]}, {"query": "科力远和宁波富达的最低价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '科力远' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '宁波富达' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宁波富达\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017742156982421875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宁波富达\" \nRETURN s.stock\nLIMIT 50", 0, 0.019457101821899414]]}, {"query": "科力远和宁波富达的最低价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '科力远' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '宁波富达' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宁波富达\" \nRETURN temp\nLIMIT 50", 0, 0.0007233619689941406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宁波富达\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00038623809814453125]]}, {"query": "华光环能和南方航空的成交量差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华光环能' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '南方航空' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"南方航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.02250981330871582], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南方航空\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017424345016479492]]}, {"query": "华光环能和南方航空的成交量差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华光环能' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '南方航空' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"南方航空\" \nRETURN temp\nLIMIT 50", 0, 0.0005896091461181641], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南方航空\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004947185516357422]]}, {"query": "华光环能和南方航空的成交量差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华光环能' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '南方航空' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"南方航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.017590761184692383], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南方航空\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018376588821411133]]}, {"query": "公用事业和银行的开盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '银行' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0026350021362304688], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.002389669418334961]]}, {"query": "公用事业和银行的开盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '银行' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002774953842163086], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021779537200927734]]}, {"query": "博通股份和标准股份上市公司的收盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博通股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '标准股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"标准股份\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通股\" \nRETURN temp\nLIMIT 50", 0, 0.0006940364837646484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"标准股份\" ) AND s.stock.name == \"通股\" \nRETURN temp\nLIMIT 50", 0, 0.000720977783203125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通股\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"标准股份\" ) \nRETURN temp\nLIMIT 50", 0, 0.0004317760467529297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"标准股份\" ) AND s.stock.name == \"通股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00034809112548828125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通股\" AND ( s.stock.name == \"股份\" OR s.stock.name == \"标准股份\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003027915954589844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通股\" AND ( s.stock.name == \"股份\" OR s.stock.name == \"标准股份\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00038361549377441406]]}]