[{"query": "零售和电力的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电力' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"零售\" WITH as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"电力\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005414485931396484], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"零售\" WITH as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"电力\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002906322479248047], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"零售\" WITH as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"电力\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00023818016052246094], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"零售\" WITH as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"电力\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002849102020263672]]}, {"query": "中航电子和退市银鸽的最低价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中航电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '退市银鸽' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.0006842613220214844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005135536193847656]]}, {"query": "中航电子和退市银鸽的最低价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中航电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '退市银鸽' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0022912025451660156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021178722381591797]]}, {"query": "中航电子和退市银鸽的最低价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中航电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '退市银鸽' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0024213790893554688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.002008676528930664]]}, {"query": "电视和广播和能源的收盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.02102518081665039], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01902008056640625]]}, {"query": "电视和广播和能源的收盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005922317504882812], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"能源\" \nRETURN temp\nLIMIT 50", 0, 0.00040650367736816406]]}, {"query": "退市西水和盛和资源股票的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '退市西水' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0026290416717529297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"资源\" \nRETURN s.stock\nLIMIT 50", 0, 0.002038240432739258]]}, {"query": "退市西水和盛和资源股票的开盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '退市西水' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"资源\" \nRETURN temp\nLIMIT 50", 0, 0.0006022453308105469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004477500915527344]]}, {"query": "金融服务和公用事业行业的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.006685733795166016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008826017379760742]]}, {"query": "金融服务和公用事业行业的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006368160247802734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0004444122314453125]]}, {"query": "金融服务和公用事业行业的最低价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.00984811782836914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007157802581787109]]}, {"query": "鹏欣资源和大西洋的涨跌幅差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鹏欣资源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '大西洋' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"资源\" OR s.stock.name == \"大西洋\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020629405975341797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"资源\" OR s.stock.name == \"大西洋\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.020050764083862305]]}, {"query": "石油和天然气和酒精饮料的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006449222564697266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN temp\nLIMIT 50", 0, 0.00042176246643066406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN temp\nLIMIT 50", 0, 0.00044035911560058594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"饮料\" \nRETURN temp\nLIMIT 50", 0, 0.0003597736358642578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003533363342285156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003368854522705078]]}, {"query": "石油和天然气和酒精饮料的开盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '石油和天然气' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0026285648345947266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0023136138916015625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018758773803710938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001720428466796875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016617774963378906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016155242919921875]]}, {"query": "ST通葡和骆驼股份上市公司的成交量差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == 'ST通葡' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '骆驼股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0023827552795410156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019922256469726562]]}, {"query": "ST通葡和骆驼股份上市公司的成交量差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == 'ST通葡' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '骆驼股份' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0025758743286132812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002173900604248047]]}, {"query": "娱乐设备和医疗保健设施的开盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0023262500762939453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018939971923828125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0017974376678466797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016562938690185547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015521049499511719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017368793487548828]]}, {"query": "娱乐设备和医疗保健设施的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.0006053447723388672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND t.trade.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0004165172576904297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0004277229309082031], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.0003237724304199219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0002529621124267578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0002627372741699219]]}, {"query": "第一医药和*ST目药股票的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '第一医药' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '*ST目药' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"第一医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017898082733154297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"第一医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.01768970489501953]]}, {"query": "第一医药和*ST目药股票的开盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '第一医药' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '*ST目药' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"第一医药\" \nRETURN temp\nLIMIT 50", 0, 0.0006737709045410156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"第一医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004734992980957031]]}, {"query": "娱乐设备和电信服务提供商行业的最低价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0025053024291992188], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020945072174072266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019686222076416016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0018513202667236328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001722574234008789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015976428985595703]]}, {"query": "娱乐设备和电信服务提供商行业的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0023772716522216797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0022003650665283203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021762847900390625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0019307136535644531], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017871856689453125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001651763916015625]]}, {"query": "娱乐设备和电信服务提供商行业的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信服务提供商' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006501674652099609], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0004258155822753906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.0003876686096191406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003609657287597656], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.0003190040588378906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003228187561035156]]}, {"query": "东材科技和西藏珠峰上市公司的收盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东材科技' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '西藏珠峰' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006496906280517578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.0004425048828125]]}, {"query": "东材科技和西藏珠峰上市公司的收盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东材科技' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '西藏珠峰' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.002472400665283203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002048969268798828]]}, {"query": "化学和银行的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '银行' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"化学\" WITH as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"银行\" ) \nRETURN temp\nLIMIT 50", 0, 0.00047850608825683594], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"银行\" ) AND indus.industry.name == \"化学\" WITH as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"银行\" ) AND indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0003139972686767578], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"银行\" ) AND indus.industry.name == \"化学\" WITH as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"银行\" ) AND indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"银行\" ) \nRETURN temp\nLIMIT 50", 0, 0.00023365020751953125], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"银行\" ) AND indus.industry.name == \"化学\" WITH as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002574920654296875]]}]