[{"query": "酒精饮料近89日的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-89 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0006771087646484375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.003226041793823242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0004742145538330078], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.025571584701538086]]}, {"query": "酒精饮料近89日的涨跌幅是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-89 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0007493495941162109], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)\nWHERE t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.021811246871948242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006227493286132812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)\nWHERE t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.0029582977294921875]]}, {"query": "近89日酒精饮料的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-89 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0006251335144042969], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.002954721450805664], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0004374980926513672], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.020066261291503906]]}, {"query": "近98日信息技术的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-98 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.002821207046508789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0023183822631835938]]}, {"query": "信息技术近98日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-98 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.00254058837890625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0021283626556396484]]}, {"query": "信息技术近98日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-98 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.002197265625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0021028518676757812]]}, {"query": "航天和国防行业近37日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-37 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0026497840881347656], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0024971961975097656]]}, {"query": "近37日航天和国防行业的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-37 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002645730972290039], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0026323795318603516]]}, {"query": "航天和国防行业近37日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-37 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002574920654296875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002725362777709961]]}, {"query": "近43日酒精饮料行业的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-43 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0024535655975341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021677017211914062]]}, {"query": "酒精饮料行业近43日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-43 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021347999572753906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019123554229736328]]}, {"query": "近64日农产品行业的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农产品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-64 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 8.512292861938477], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 8.56091833114624], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE s.stock.name == \"农产品\" AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 8.530672550201416], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 8.725613832473755], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 8.262102365493774], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 8.833969354629517]]}, {"query": "农产品行业近64日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农产品' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-64 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 8.713082313537598], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 8.468101024627686], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 8.423352479934692], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE s.stock.name == \"农产品\" AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 8.73903775215149], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 8.376993894577026], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 8.635141372680664]]}, {"query": "航空公司1990年3月14日到2020年5月20日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` >= date('1990-03-14') AND td.trade_data.`date` <= date('2020-05-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1990-3-14\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2020-5-20\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0024962425231933594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1990-3-14\" ) AND td.trade_data.`date` == date( \"2020-5-20\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0023355484008789062], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2020-5-20\" ) AND td.trade_data.`date` == date( \"1990-3-14\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002155780792236328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-5-20\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1990-3-14\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002126932144165039], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1990-3-14\" ) AND td.trade_data.`date` == date( \"2020-5-20\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021135807037353516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-5-20\" ) AND td.trade_data.`date` == date( \"1990-3-14\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019314289093017578]]}, {"query": "1990年3月14日到2020年5月20日的航空公司的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` >= date('1990-03-14') AND td.trade_data.`date` <= date('2020-05-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1990-3-14\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2020-5-20\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002057313919067383], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1990-3-14\" ) AND td.trade_data.`date` == date( \"2020-5-20\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0020215511322021484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2020-5-20\" ) AND td.trade_data.`date` == date( \"1990-3-14\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001953601837158203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-5-20\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1990-3-14\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019676685333251953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1990-3-14\" ) AND td.trade_data.`date` == date( \"2020-5-20\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019080638885498047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-5-20\" ) AND td.trade_data.`date` == date( \"1990-3-14\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0016682147979736328]]}, {"query": "近34日航空公司的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-34 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-10-4\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0006301403045654297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-10-4\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0028867721557617188], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-4\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.020757675170898438], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-10-4\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0006265640258789062]]}, {"query": "医疗保健设施行业近66日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-66 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002767801284790039], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0022749900817871094]]}, {"query": "近66日医疗保健设施行业的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-66 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002508878707885742], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.001973390579223633]]}, {"query": "医疗保健设施行业近66日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-66 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002235889434814453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020449161529541016]]}, {"query": "电信行业2021年6月10日后36日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信' AND td.trade_data.`date` >= date('2021-06-10') AND td.trade_data.`date` < date('2021-06-10')+36 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2021-6-10\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02349090576171875], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-10\" ) AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.022375822067260742]]}, {"query": "电信行业2021年6月10日后36天的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信' AND td.trade_data.`date` >= date('2021-06-10') AND td.trade_data.`date` < date('2021-06-10')+36 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2021-6-10\" ) \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.023706436157226562], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-10\" ) AND indus.industry.name == \"电信\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.02114725112915039]]}, {"query": "近49日金融服务的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-49 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-9-19\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.024736404418945312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-9-19\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0006704330444335938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-9-19\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.01949596405029297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-9-19\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0006587505340576172]]}, {"query": "食品和饮料行业近10日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-10 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.010772228240966797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.008948802947998047]]}, {"query": "食品和饮料行业近10日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-10 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price,m.name\nLIMIT 50", 0, 0.000583648681640625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.closing_price,m.name\nLIMIT 50", 0, 0.0004391670227050781]]}, {"query": "医疗保健设施行业近84日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-84 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0022356510162353516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0021805763244628906]]}, {"query": "近84日医疗保健设施行业的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-84 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.001984119415283203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0017845630645751953]]}]