[{"query": "魏司空基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏司空' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏司空\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015153884887695312], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏司空\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014982223510742188]]}, {"query": "杨长孙基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '杨长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001438140869140625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"杨长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015480518341064453]]}, {"query": "有哪些托管给杨长孙基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '杨长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013649463653564453], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"杨长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001407623291015625]]}, {"query": "纺织品和服装产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '纺织品和服装' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014355182647705078], ["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013420581817626953], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014448165893554688], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001384735107421875]]}, {"query": "有哪些上游是纺织品和服装产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '纺织品和服装' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001439809799194336], ["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014524459838867188], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015416145324707031], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014505386352539062]]}, {"query": "陈微生基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陈微生' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陈微生\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014753341674804688], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陈微生\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014722347259521484]]}, {"query": "科投有通制股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '科投有通制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"科投有通制\" AND ( s.stock.name == \"科投\" OR s.stock.name == \"有通\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013921260833740234], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"科投\" OR s.stock.name == \"有通\" ) AND s.stock.name == \"科投有通制\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013573169708251953]]}, {"query": "有哪些股东是科投有通制股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '科投有通制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"科投有通制\" AND ( s.stock.name == \"科投\" OR s.stock.name == \"有通\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002751350402832031], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"科投\" OR s.stock.name == \"有通\" ) AND s.stock.name == \"科投有通制\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002658367156982422]]}, {"query": "有哪些托管给华洛阳基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '华洛阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"华洛阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015392303466796875], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"华洛阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015637874603271484]]}, {"query": "农业机械产业关联的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '农业机械' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) AND indus.industry.name == \"机械\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014874935150146484], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE indus.industry.name == \"机械\" AND ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014841556549072266]]}, {"query": "股限讯股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '股限讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"股限\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"股限讯\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013458728790283203], ["MATCH (s:stock)\nWHERE s.stock.name == \"股限讯\" AND ( s.stock.name == \"股限\" OR s.stock.name == \"讯股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012884140014648438]]}, {"query": "有哪些股东是股限讯股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '股限讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股限讯\" AND ( s.stock.name == \"股限\" OR s.stock.name == \"讯股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003075599670410156], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"股限\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"股限讯\" \nRETURN n.name\nLIMIT 50", 0, 0.00023174285888671875]]}, {"query": "卫黎丘基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '卫黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"卫黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015892982482910156], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"卫黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017642974853515625]]}, {"query": "钱东郭基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '钱东郭' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"钱东郭\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014369487762451172], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"钱东郭\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014584064483642578]]}, {"query": "有哪些托管给钱东郭基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '钱东郭' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"钱东郭\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016398429870605469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"钱东郭\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013575553894042969]]}, {"query": "赵岳基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵岳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵岳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014812946319580078], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵岳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001508951187133789]]}, {"query": "秦仲孙基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦仲孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦仲孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014734268188476562], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦仲孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014362335205078125]]}, {"query": "孙南宫基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孙南宫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孙南宫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014963150024414062], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孙南宫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013821125030517578]]}, {"query": "讯能有建筑股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '讯能有建筑' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"讯能\" OR s.stock.name == \"有建\" ) AND s.stock.name == \"讯能有建筑\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014243125915527344], ["MATCH (s:stock)\nWHERE s.stock.name == \"讯能有建筑\" AND ( s.stock.name == \"讯能\" OR s.stock.name == \"有建\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012960433959960938]]}, {"query": "有哪些股东是讯能有建筑股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '讯能有建筑' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"讯能\" OR s.stock.name == \"有建\" ) AND s.stock.name == \"讯能有建筑\" \nRETURN n.name\nLIMIT 50", 0, 0.0003075599670410156], ["MATCH (s:stock)\nWHERE s.stock.name == \"讯能有建筑\" AND ( s.stock.name == \"讯能\" OR s.stock.name == \"有建\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002739429473876953]]}, {"query": "有哪些托管给沈南门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '沈南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"沈南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014452934265136719], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015745162963867188]]}, {"query": "发限讯造子股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发限讯造子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"发限讯造子\" AND ( s.stock.name == \"限讯\" OR s.stock.name == \"造子\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013432502746582031], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"限讯\" OR s.stock.name == \"造子\" ) AND s.stock.name == \"发限讯造子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014901161193847656]]}, {"query": "有哪些股东是发限讯造子股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发限讯造子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"限讯\" OR s.stock.name == \"造子\" ) AND s.stock.name == \"发限讯造子\" \nRETURN n.name\nLIMIT 50", 0, 0.0003223419189453125], ["MATCH (s:stock)\nWHERE s.stock.name == \"发限讯造子\" AND ( s.stock.name == \"限讯\" OR s.stock.name == \"造子\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003161430358886719]]}, {"query": "窦伯赏基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '窦伯赏' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"窦伯赏\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014796257019042969], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"窦伯赏\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013892650604248047]]}, {"query": "司公通科保股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '司公通科保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"司公\" AND s.stock.name == \"保股\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013163089752197266], ["MATCH (s:stock)\nWHERE s.stock.name == \"保股\" AND s.stock.name == \"司公\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013682842254638672]]}, {"query": "有哪些股东是司公通科保股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '司公通科保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"保股\" AND s.stock.name == \"司公\" \nRETURN n.name\nLIMIT 50", 0, 0.00033783912658691406], ["MATCH (s:stock)\nWHERE s.stock.name == \"司公\" AND s.stock.name == \"保股\" \nRETURN n.name\nLIMIT 50", 0, 0.00024080276489257812]]}, {"query": "有哪些托管给朱黎丘基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015137195587158203], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015172958374023438]]}, {"query": "有哪些托管给窦岳基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '窦岳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"窦岳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014774799346923828], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"窦岳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001617431640625]]}, {"query": "资药务造子股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资药务造子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"资药\" OR s.stock.name == \"务造\" ) AND s.stock.name == \"资药务造子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013637542724609375], ["MATCH (s:stock)\nWHERE s.stock.name == \"资药务造子\" AND ( s.stock.name == \"资药\" OR s.stock.name == \"务造\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013308525085449219]]}, {"query": "有哪些股东是资药务造子股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资药务造子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"资药\" OR s.stock.name == \"务造\" ) AND s.stock.name == \"资药务造子\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003268718719482422], ["MATCH (s:stock)\nWHERE s.stock.name == \"资药务造子\" AND ( s.stock.name == \"资药\" OR s.stock.name == \"务造\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002834796905517578]]}, {"query": "何赫连基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015857219696044922], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017518997192382812]]}, {"query": "有哪些持有建发股份上市公司的基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '建发股份' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"有建\" AND ( s.stock.name == \"建发\" OR s.stock.name == \"股份\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016260147094726562], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"建发\" OR s.stock.name == \"股份\" ) AND s.stock.name == \"有建\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018830299377441406]]}, {"query": "吴欧阳基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吴欧阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吴欧阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014429092407226562], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴欧阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018961429595947266]]}, {"query": "有哪些托管给秦北门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦北门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦北门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013973712921142578], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦北门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001486063003540039]]}, {"query": "何赫连基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001744985580444336], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014946460723876953]]}, {"query": "药服电技保股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '药服电技保' AND iso.shareholding_ratio < 62 RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"药服电技保\" AND ( s.stock.name == \"服电\" OR s.stock.name == \"技保\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013573169708251953], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"服电\" OR s.stock.name == \"技保\" ) AND s.stock.name == \"药服电技保\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001287221908569336]]}, {"query": "有哪些股东是药服电技保股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '药服电技保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"服电\" OR s.stock.name == \"技保\" ) AND s.stock.name == \"药服电技保\" \nRETURN n.name\nLIMIT 50", 0, 0.00028705596923828125], ["MATCH (s:stock)\nWHERE s.stock.name == \"药服电技保\" AND ( s.stock.name == \"服电\" OR s.stock.name == \"技保\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00028705596923828125]]}, {"query": "有哪些托管给王仲孙基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '王仲孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"王仲孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013895034790039062], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"王仲孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014081001281738281]]}, {"query": "技保集药限股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技保集药限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"技保集药限\" AND ( s.stock.name == \"技保\" OR s.stock.name == \"集药\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013632774353027344], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"技保\" OR s.stock.name == \"集药\" ) AND s.stock.name == \"技保集药限\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013039112091064453]]}, {"query": "有哪些股东是技保集药限股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技保集药限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"技保\" OR s.stock.name == \"集药\" ) AND s.stock.name == \"技保集药限\" \nRETURN n.name\nLIMIT 50", 0, 0.00031185150146484375], ["MATCH (s:stock)\nWHERE s.stock.name == \"技保集药限\" AND ( s.stock.name == \"技保\" OR s.stock.name == \"集药\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00025272369384765625]]}, {"query": "何南宫基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何南宫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何南宫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001447916030883789], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何南宫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001459360122680664]]}, {"query": "源有服资股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '源有服资' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"源有服资\" AND ( s.stock.name == \"有服\" OR s.stock.name == \"资股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013935565948486328], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"有服\" OR s.stock.name == \"资股\" ) AND s.stock.name == \"源有服资\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013637542724609375]]}, {"query": "有哪些股东是源有服资股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '源有服资' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"有服\" OR s.stock.name == \"资股\" ) AND s.stock.name == \"源有服资\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00033354759216308594], ["MATCH (s:stock)\nWHERE s.stock.name == \"源有服资\" AND ( s.stock.name == \"有服\" OR s.stock.name == \"资股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003001689910888672]]}, {"query": "数投通服产股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '数投通服产' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"投通\" OR s.stock.name == \"服产\" ) AND s.stock.name == \"数投通服产\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014410018920898438], ["MATCH (s:stock)\nWHERE s.stock.name == \"数投通服产\" AND ( s.stock.name == \"投通\" OR s.stock.name == \"服产\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014166831970214844]]}, {"query": "有哪些股东是数投通服产股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '数投通服产' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"投通\" OR s.stock.name == \"服产\" ) AND s.stock.name == \"数投通服产\" \nRETURN n.name\nLIMIT 50", 0, 0.0003142356872558594], ["MATCH (s:stock)\nWHERE s.stock.name == \"数投通服产\" AND ( s.stock.name == \"投通\" OR s.stock.name == \"服产\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00023412704467773438]]}, {"query": "有哪些管理华安创业板50ETF联接C公募基金的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '华安创业板50ETF联接C' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND pof.public_offering_fund.name == \"华安创\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014736652374267578], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"华安创\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014674663543701172]]}, {"query": "章上官基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '章上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"章上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015950202941894531], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"章上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015416145324707031]]}, {"query": "有哪些托管给章上官基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '章上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"章上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016031265258789062], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"章上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014450550079345703]]}, {"query": "博道睿见一年持有期混合基金的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '博道睿见一年持有期混合' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0012247562408447266], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0012364387512207031]]}, {"query": "资通份金股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资通份金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"通份\" OR s.stock.name == \"金股\" ) AND s.stock.name == \"资通份金\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012850761413574219], ["MATCH (s:stock)\nWHERE s.stock.name == \"资通份金\" AND ( s.stock.name == \"通份\" OR s.stock.name == \"金股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013148784637451172]]}, {"query": "有哪些股东是资通份金股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资通份金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"通份\" OR s.stock.name == \"金股\" ) AND s.stock.name == \"资通份金\" \nRETURN n.name\nLIMIT 50", 0, 0.00026726722717285156], ["MATCH (s:stock)\nWHERE s.stock.name == \"资通份金\" AND ( s.stock.name == \"通份\" OR s.stock.name == \"金股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00020384788513183594]]}, {"query": "郑洛阳基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '郑洛阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"郑洛阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014040470123291016], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"郑洛阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00136566162109375]]}]