[{"query": "开盘价小于6的家庭和个人用品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '家庭和个人用品' AND sd.stock_data.opening_price < 6 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price < 6 \nRETURN s.stock.name\nLIMIT 50", 0, 5.959367752075195], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price < 6 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.742838382720947], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price < 6 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.620630502700806], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price < 6 \nRETURN s.stock.name\nLIMIT 50", 0, 5.679753065109253], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price < 6 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.762765407562256], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price < 6 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.750909090042114]]}, {"query": "开盘价不大于30的电视和广播行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电视和广播' AND sd.stock_data.opening_price <= 30 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price <= 30 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.244485855102539], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price <= 30 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.375706911087036], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price <= 30 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.661413908004761], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price <= 30 \nRETURN s.stock.name\nLIMIT 50", 0, 7.241189241409302], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price <= 30 \nRETURN s.stock.name\nLIMIT 50", 0, 7.295172691345215], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price <= 30 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.364068508148193]]}, {"query": "最低价大于5的消费品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '消费品' AND sd.stock_data.minimum_price > 5 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price > 5 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.834896802902222], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price > 5 \nRETURN s.stock.name\nLIMIT 50", 0, 5.686342716217041], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price > 5 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.64288854598999], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price > 5 \nRETURN s.stock.name\nLIMIT 50", 0, 5.722024917602539], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price > 5 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.731255054473877], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price > 5 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 5.7921741008758545]]}, {"query": "涨跌幅不大于47的电视和广播行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电视和广播' AND sd.stock_data.range <= 47 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.range <= 47 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.545555353164673], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 47 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.320447683334351], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.range <= 47 \nRETURN s.stock.name\nLIMIT 50", 0, 7.262261390686035], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 47 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.336150646209717], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.range <= 47 \nRETURN s.stock.name\nLIMIT 50", 0, 8.332854986190796], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.range <= 47 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.8699791431427]]}, {"query": "成交量小于34的建筑材料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '建筑材料' AND sd.stock_data.volume < 34 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 34 AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"建筑\" \nRETURN s.stock\nLIMIT 50", 0, 0.040276288986206055], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume < 34 AND s.stock.name == \"建筑\" \nRETURN s.stock\nLIMIT 50", 0, 0.0738379955291748], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"建筑\" AND sd.stock_data.volume < 34 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.034732818603515625], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"建筑\" AND sd.stock_data.volume < 34 \nRETURN s.stock\nLIMIT 50", 0, 0.026900053024291992], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"建筑\" AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume < 34 \nRETURN s.stock\nLIMIT 50", 0, 0.025724411010742188], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 34 AND s.stock.name == \"建筑\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.026157855987548828]]}, {"query": "收盘价不大于45的家庭和个人用品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '家庭和个人用品' AND sd.stock_data.closing_price <= 45 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 45 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 8.492645025253296], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 45 \nRETURN s.stock.name\nLIMIT 50", 0, 7.1490044593811035], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 45 \nRETURN s.stock.name\nLIMIT 50", 0, 7.3501715660095215], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 45 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.355703353881836], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 45 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.410768747329712], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 45 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 7.052113771438599]]}, {"query": "最高价小于13的工业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.maximum_price < 13 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.maximum_price < 13 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.225329875946045], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.maximum_price < 13 \nRETURN s.stock\nLIMIT 50", 0, 7.02413272857666], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 13 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.238089323043823], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 13 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.333247900009155], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.maximum_price < 13 \nRETURN s.stock\nLIMIT 50", 0, 7.264739990234375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.maximum_price < 13 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.4203362464904785]]}, {"query": "涨跌幅不大于41的汽车行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '汽车' AND sd.stock_data.range <= 41 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.range <= 41 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0029566287994384766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.range <= 41 AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0020346641540527344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 41 AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.007161140441894531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 41 AND s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.005895137786865234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" AND sd.stock_data.range <= 41 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002249479293823242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.range <= 41 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016770362854003906]]}, {"query": "成交量不大于26的金融技术行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '金融技术' AND sd.stock_data.volume <= 26 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.volume <= 26 \nRETURN s.stock\nLIMIT 50", 0, 0.04026532173156738], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume <= 26 AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.02996349334716797], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.volume <= 26 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.028037071228027344], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 26 \nRETURN s.stock\nLIMIT 50", 0, 0.03186941146850586], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 26 AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.03180050849914551], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume <= 26 AND sd.stock_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.03270673751831055]]}, {"query": "成交量等于9的酒精饮料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '酒精饮料' AND sd.stock_data.volume == 9 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume == 9 AND t.trade.name == \"饮料\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.009940624237060547], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume == 9 AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.00859689712524414], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" AND sd.stock_data.volume == 9 \nRETURN s.stock\nLIMIT 50", 0, 0.015794754028320312], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND sd.stock_data.volume == 9 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.008254051208496094], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume == 9 AND sd.stock_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.013301610946655273], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume == 9 \nRETURN s.stock\nLIMIT 50", 0, 0.00806117057800293]]}, {"query": "成交量不大于29的金融技术行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '金融技术' AND sd.stock_data.volume <= 29 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.volume <= 29 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.03564167022705078], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 29 \nRETURN s.stock.name\nLIMIT 50", 0, 0.028072834014892578], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume <= 29 AND sd.stock_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.026983022689819336], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.volume <= 29 \nRETURN s.stock.name\nLIMIT 50", 0, 0.02771306037902832], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume <= 29 AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.026645421981811523], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 29 AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.029003143310546875]]}, {"query": "收盘价不大于41的公用事业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.closing_price <= 41 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 41 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.070012092590332], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 41 \nRETURN s.stock\nLIMIT 50", 0, 7.126448392868042], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 41 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.8828959465026855], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price <= 41 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.537396430969238], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 41 \nRETURN s.stock\nLIMIT 50", 0, 7.553789854049683], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.closing_price <= 41 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.406541585922241]]}, {"query": "最低价不大于50的原材料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '原材料' AND sd.stock_data.minimum_price <= 50 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price <= 50 \nRETURN s.stock\nLIMIT 50", 0, 7.252141714096069], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 50 AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.234893560409546], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price <= 50 AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.355729103088379], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price <= 50 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.162976503372192], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price <= 50 AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.396698713302612], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price <= 50 \nRETURN s.stock\nLIMIT 50", 0, 7.4855852127075195]]}, {"query": "成交量小于8的医疗设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '医疗设备' AND sd.stock_data.volume < 8 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 8 AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.021304845809936523], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" AND sd.stock_data.volume < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.02039480209350586], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume < 8 AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.019178390502929688], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.014797210693359375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.volume < 8 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.015063762664794922], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 8 AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.01828455924987793]]}, {"query": "成交量不大于16的汽车制造行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '汽车制造' AND sd.stock_data.volume <= 16 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 16 AND ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.033077239990234375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) AND sd.stock_data.volume <= 16 \nRETURN s.stock.name\nLIMIT 50", 0, 0.020552396774291992], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 16 \nRETURN s.stock.name\nLIMIT 50", 0, 0.019359588623046875], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) AND sd.stock_data.volume <= 16 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.017900705337524414], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 16 AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.02367091178894043], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 16 AND ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.017101049423217773]]}, {"query": "成交量不大于24的电子设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电子设备' AND sd.stock_data.volume <= 24 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 24 AND s.stock.name == \"电子\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.022870302200317383], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.volume <= 24 \nRETURN s.stock.name\nLIMIT 50", 0, 0.018343687057495117], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.volume <= 24 AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.01929759979248047], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 24 AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.01794719696044922], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 24 AND s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.018333911895751953], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" AND sd.stock_data.volume <= 24 \nRETURN s.stock.name\nLIMIT 50", 0, 0.020006418228149414]]}, {"query": "吴南门基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吴南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.005183696746826172], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吴南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002402782440185547]]}, {"query": "媒体和娱乐产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '媒体和娱乐' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018172264099121094], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015017986297607422]]}]