[{"query": "开盘价不大于航空公司行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.010893583297729492], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.006546497344970703]]}, {"query": "哪些行业的开盘价不比航空公司大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.00878000259399414], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0076770782470703125]]}, {"query": "最低价大于西藏药业上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西藏药业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"西藏药业\" WITH sd.stock_data.minimum_price as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > temp \nRETURN s.stock\nLIMIT 50", 0, 44.98298001289368], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"西藏药业\" WITH sd.stock_data.minimum_price as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > temp AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.7099344730377197], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"西藏药业\" WITH sd.stock_data.minimum_price as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price > temp \nRETURN s.stock\nLIMIT 50", 0, 0.07676196098327637]]}, {"query": "哪些上市公司的最低价比西藏药业大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西藏药业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"西藏药业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.22663617134094238], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"西藏药业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0354924201965332]]}, {"query": "哪些行业的涨跌幅和医疗设备相等", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.006753683090209961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.007308006286621094]]}, {"query": "最低价大于运输和物流行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND td.trade_data.minimum_price > temp AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.04854750633239746], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 8.069725275039673], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.05683755874633789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0216672420501709], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 7.878410816192627], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.minimum_price > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.03775286674499512], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 7.904855012893677], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.03257632255554199], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.020608186721801758], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"运输\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.019849300384521484]]}, {"query": "哪些行业的最低价比运输和物流大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0043392181396484375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.001316070556640625]]}, {"query": "涨跌幅大于污水处理行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.010811805725097656], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.003997325897216797]]}, {"query": "哪些行业的涨跌幅比污水处理大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.00886845588684082], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.012215137481689453]]}, {"query": "哪些股票的涨跌幅不比中华企业小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中华企业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"中华企业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.15169382095336914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中华企业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.034122467041015625]]}, {"query": "最低价大于船舶和海运行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.04812479019165039], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.02706146240234375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" WITH td.trade_data.minimum_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 7.935027360916138]]}, {"query": "哪些行业的最低价比船舶和海运大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.008609771728515625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.006952524185180664]]}, {"query": "哪些行业的涨跌幅比酒店和度假村小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.00803518295288086], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.010235786437988281]]}, {"query": "哪些行业的最高价和娱乐设备一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.02441549301147461], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.003773927688598633]]}, {"query": "开盘价大于电信行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" WITH td.trade_data.opening_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 8.415324211120605], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" WITH td.trade_data.opening_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND td.trade_data.opening_price > temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.04862380027770996], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" WITH td.trade_data.opening_price as temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > temp AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.13696861267089844]]}, {"query": "哪些行业的开盘价比电信大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" \nRETURN indus.industry.name,t.trade.name\nLIMIT 50", 0, 0.08610844612121582], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN indus.industry.name,t.trade.name\nLIMIT 50", 0, 0.02589559555053711]]}, {"query": "最低价等于污水处理行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.015708446502685547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0023517608642578125]]}, {"query": "哪些行业的最低价和污水处理相等", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.012435436248779297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.009340763092041016]]}, {"query": "哪些上市公司的开盘价比金自天正小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金自天正' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金自天正\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.10172891616821289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金自天正\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.020632266998291016]]}, {"query": "哪些行业的最高价和汽车一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" \nRETURN t.trade.name\nLIMIT 50", 1, 0.09628939628601074], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 1, 0.03302001953125]]}, {"query": "哪些股票的最低价比海正药业大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海正药业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海正药业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.20612597465515137], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海正药业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.07802677154541016]]}, {"query": "最高价不大于能源行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.04454302787780762], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"能源\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.023453712463378906]]}, {"query": "哪些行业的最高价不比能源大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"能源\" \nRETURN indus.industry.name,t.trade.name\nLIMIT 50", 0, 0.07092571258544922], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN indus.industry.name,t.trade.name\nLIMIT 50", 0, 0.04013466835021973]]}, {"query": "收盘价不大于瑞丰银行上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '瑞丰银行' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.03903555870056152], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.040334463119506836]]}, {"query": "哪些上市公司的收盘价不比瑞丰银行大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '瑞丰银行' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN n.name\nLIMIT 50", 0, 0.0057604312896728516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.0005791187286376953]]}, {"query": "哪些行业的最低价比电子设备小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电子\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.008270263671875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.02256464958190918]]}, {"query": "涨跌幅不大于西藏药业股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西藏药业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"西藏药业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.1749727725982666], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"西藏药业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.08692288398742676]]}, {"query": "哪些股票的涨跌幅不比西藏药业大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西藏药业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"西藏药业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.1348564624786377], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"西藏药业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.020572662353515625]]}, {"query": "哪些行业的收盘价和娱乐设备相等", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.01424407958984375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.007144927978515625]]}, {"query": "成交量大于千金药业股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '千金药业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.03980207443237305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金药\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.01837897300720215]]}, {"query": "哪些股票的成交量比千金药业大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '千金药业' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0325627326965332], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金药\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.026671886444091797]]}, {"query": "哪些行业的开盘价不比金融服务小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0008089542388916016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0004930496215820312]]}, {"query": "开盘价大于长城汽车上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长城汽车' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0385432243347168], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.08907365798950195]]}, {"query": "哪些上市公司的开盘价比长城汽车大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长城汽车' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN n.name\nLIMIT 50", 0, 0.0013763904571533203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name\nLIMIT 50", 0, 0.048862457275390625]]}]