[{"query": "哪个是在四创电子和东材科技和宝光股份中开盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['四创电子', '东材科技', '宝光股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018756389617919922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.001821756362915039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016477108001708984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015742778778076172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016138553619384766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015721321105957031]]}, {"query": "在四创电子和东材科技和宝光股份中开盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['四创电子', '东材科技', '宝光股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020122528076171875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.001703023910522461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.00160980224609375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016007423400878906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) AND s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015566349029541016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"科技\" OR s.stock.name == \"宝光股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016863346099853516]]}, {"query": "在化学和旅游和酒店行业中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['化学', '旅游和酒店'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"化学\" OR indus.industry.name == \"旅游\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.18417668342590332], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"化学\" OR indus.industry.name == \"旅游\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.18421602249145508]]}, {"query": "哪个是在金田股份和广电电气和两面针股票中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['金田股份', '广电电气', '两面针'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"广电电\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018931865692138672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"广电电\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021729707717895508]]}, {"query": "在金田股份和广电电气和两面针股票中涨跌幅最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['金田股份', '广电电气', '两面针'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"广电电\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018529653549194336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"广电电\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02124190330505371]]}, {"query": "在金田股份和广电电气和两面针股票中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['金田股份', '广电电气', '两面针'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"广电电\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.023156404495239258], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"广电电\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0201871395111084]]}, {"query": "哪个是在钢铁和食品和饮料和电脑硬件中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['钢铁', '食品和饮料', '电脑硬件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.006703853607177734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0062334537506103516]]}, {"query": "哪个是在中新集团和华域汽车和空港股份股票中现价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中新集团', '华域汽车', '空港股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"汽车\" \nRETURN s.stock, DESC AS D\nORDER BY D LIMIT 1", 0, 0.000431060791015625], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.name == \"股份\" \nRETURN s.stock, DESC AS D\nORDER BY D LIMIT 1", 0, 0.0003228187561035156]]}, {"query": "在中新集团和华域汽车和空港股份股票中现价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中新集团', '华域汽车', '空港股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"汽车\" \nRETURN s.stock, DESC AS D\nORDER BY D LIMIT 1", 0, 0.0004897117614746094], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.name == \"股份\" \nRETURN s.stock, DESC AS D\nORDER BY D LIMIT 1", 0, 0.00034928321838378906]]}, {"query": "在中新集团和华域汽车和空港股份股票中现价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中新集团', '华域汽车', '空港股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"汽车\" \nRETURN s.stock, DESC AS D\nORDER BY D LIMIT 1", 0, 0.00043702125549316406], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.name == \"股份\" \nRETURN s.stock, DESC AS D\nORDER BY D LIMIT 1", 0, 0.0003139972686767578]]}, {"query": "哪个是在工业和污水处理和船舶和海运中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['工业', '污水处理', '船舶和海运'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"水处理\" OR t.trade.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.006163835525512695], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"水处理\" OR t.trade.name == \"船舶\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.006394624710083008]]}, {"query": "哪个是在中天科技和均胜电子中收盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中天科技', '均胜电子'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"中天科技\" AND s.stock.name == \"电子\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.020622730255126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中天科技\" AND s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.017354726791381836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" AND s.stock.name == \"中天科技\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.0019266605377197266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND s.stock.name == \"中天科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.0017931461334228516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中天科技\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.01565098762512207], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"中天科技\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.0017306804656982422]]}, {"query": "哪个是在化妆品和电信设备中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['化妆品', '电信设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"化妆品\" OR indus.industry.name == \"电信\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.18259882926940918], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"化妆品\" OR indus.industry.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.18573880195617676]]}, {"query": "在三峡水利和西部黄金和中国电信股票中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['三峡水利', '西部黄金', '中国电信'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三峡水利\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电信\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.022407054901123047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三峡水利\" AND s.stock.name == \"电信\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01777338981628418], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电信\" AND s.stock.name == \"三峡水利\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0021028518676757812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电信\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三峡水利\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0025899410247802734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三峡水利\" AND s.stock.name == \"电信\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.016916513442993164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电信\" AND s.stock.name == \"三峡水利\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0020966529846191406]]}, {"query": "在运输和物流和公用事业中涨跌幅最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['运输和物流', '公用事业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.008427858352661133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007488250732421875]]}, {"query": "在运输和物流和公用事业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['运输和物流', '公用事业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.008379459381103516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006641864776611328]]}, {"query": "在健康元和安通控股上市公司中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['健康元', '安通控股'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"健康\" AND s.stock.name == \"通控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021109580993652344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通控股\" AND s.stock.name == \"健康\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.00202178955078125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通控股\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"健康\" \nRETURN s.stock\nLIMIT 50", 0, 0.001894235610961914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"健康\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.00174713134765625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"健康\" AND s.stock.name == \"通控股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020143985748291016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通控股\" AND s.stock.name == \"健康\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015113353729248047]]}, {"query": "在健康元和安通控股上市公司中成交量最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['健康元', '安通控股'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"健康\" AND s.stock.name == \"通控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022199153900146484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通控股\" AND s.stock.name == \"健康\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017895698547363281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通控股\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"健康\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017404556274414062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"健康\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016987323760986328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"健康\" AND s.stock.name == \"通控股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017342567443847656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通控股\" AND s.stock.name == \"健康\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014760494232177734]]}, {"query": "哪个是在健康元和安通控股上市公司中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['健康元', '安通控股'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"健康\" AND s.stock.name == \"通控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017476081848144531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通控股\" AND s.stock.name == \"健康\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016891956329345703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"通控股\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"健康\" \nRETURN s.stock\nLIMIT 50", 0, 0.001569986343383789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"健康\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通控股\" \nRETURN s.stock\nLIMIT 50", 0, 0.001554727554321289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"健康\" AND s.stock.name == \"通控股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0014793872833251953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"通控股\" AND s.stock.name == \"健康\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015192031860351562]]}, {"query": "哪个是在电力工具和设备和化妆品和工业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电力工具和设备', '化妆品', '工业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.018407583236694336], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.02039790153503418], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.018422842025756836], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" AND indus.industry.name == \"化妆品\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0184478759765625], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.01772308349609375], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" AND indus.industry.name == \"电力\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.022869110107421875]]}, {"query": "在航天和国防和零售和电力工具和设备行业中现价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航天和国防', '零售', '电力工具和设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018281936645507812], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0020503997802734375]]}, {"query": "在航天和国防和零售和电力工具和设备行业中现价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航天和国防', '零售', '电力工具和设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017201900482177734], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001558065414428711]]}, {"query": "哪个是在航天和国防和零售和电力工具和设备行业中现价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航天和国防', '零售', '电力工具和设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016133785247802734], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"电力\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001542806625366211]]}, {"query": "哪个是在珠宝和宝石和信息技术行业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['珠宝和宝石', '信息技术'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0019237995147705078], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0016574859619140625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" AND t.trade.name == \"宝石\" \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0017940998077392578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.001661539077758789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" AND t.trade.name == \"技术\" \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.001659393310546875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.001444101333618164]]}, {"query": "哪个是在皖新传媒和文一科技和开滦股份上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['皖新传媒', '文一科技', '开滦股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"科技\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.001687765121459961], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0016269683837890625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0014641284942626953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0015304088592529297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0014317035675048828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.001394033432006836]]}, {"query": "在广晟有色和北京银行股票中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['广晟有色', '北京银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0017137527465820312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0014641284942626953]]}, {"query": "哪个是在广晟有色和北京银行股票中涨跌幅最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['广晟有色', '北京银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.002063751220703125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0018625259399414062]]}]