[{"query": "有哪些股东是金地通能股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '金地通能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"地通\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"金地\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003044605255126953], ["MATCH (s:stock)\nWHERE s.stock.name == \"金地\" AND ( s.stock.name == \"地通\" OR s.stock.name == \"能股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030040740966796875]]}, {"query": "有哪些属于汽车制造行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '汽车制造' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013661384582519531], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014243125915527344]]}, {"query": "电脑硬件产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电脑硬件' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004212856292724609], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004189491271972656]]}, {"query": "有哪些上游是电脑硬件产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电脑硬件' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0044252872467041016], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003945112228393555]]}, {"query": "有哪些属于电信服务提供商行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '电信服务提供商' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电信\" AND ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014107227325439453], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"电信\" OR s.stock.name == \"服务\" ) AND s.stock.name == \"电信\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016756057739257812]]}, {"query": "喻洛阳基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '喻洛阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"喻洛阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0026357173919677734], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"喻洛阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016329288482666016]]}, {"query": "有哪些股东是科服建投股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '科服建投' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"科服\" OR s.stock.name == \"建投\" ) AND s.stock.name == \"科服建投\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003368854522705078], ["MATCH (s:stock)\nWHERE s.stock.name == \"科服建投\" AND ( s.stock.name == \"科服\" OR s.stock.name == \"建投\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002760887145996094]]}, {"query": "谢云基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '谢云' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"谢云\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015232563018798828], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"谢云\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001600503921508789]]}, {"query": "农业产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '农业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018813610076904297], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0022351741790771484]]}, {"query": "有哪些上游是农业产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '农业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018067359924316406], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"农业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0022840499877929688]]}, {"query": "能份源电股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '能份源电' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能份源电\" AND ( s.stock.name == \"能份\" OR s.stock.name == \"源电\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013997554779052734], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"能份\" OR s.stock.name == \"源电\" ) AND s.stock.name == \"能份源电\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014255046844482422]]}, {"query": "有哪些股东是能份源电股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '能份源电' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能份源电\" AND ( s.stock.name == \"能份\" OR s.stock.name == \"源电\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003094673156738281], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"能份\" OR s.stock.name == \"源电\" ) AND s.stock.name == \"能份源电\" \nRETURN n.name\nLIMIT 50", 0, 0.00032973289489746094]]}, {"query": "有哪些属于食品和饮料行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '食品和饮料' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"食品\" AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014619827270507812], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND s.stock.name == \"食品\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016505718231201172]]}, {"query": "船舶和海运产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '船舶和海运' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014531612396240234], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015349388122558594]]}, {"query": "有哪些上游是船舶和海运产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '船舶和海运' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001497030258178711], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014760494232177734]]}, {"query": "造医通投保股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '造医通投保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"造医通投保\" AND ( s.stock.name == \"通投\" OR s.stock.name == \"保股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013523101806640625], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"通投\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"造医通投保\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016617774963378906]]}, {"query": "有哪些股东是造医通投保股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '造医通投保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"造医通投保\" AND ( s.stock.name == \"通投\" OR s.stock.name == \"保股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003192424774169922], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"通投\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"造医通投保\" \nRETURN n.name\nLIMIT 50", 0, 0.00025582313537597656]]}, {"query": "融药服务讯股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融药服务讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"融药服务讯\" AND ( s.stock.name == \"服务\" OR s.stock.name == \"讯股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013766288757324219], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"服务\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"融药服务讯\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012884140014648438]]}, {"query": "有哪些股东是融药服务讯股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融药服务讯' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"服务\" OR s.stock.name == \"讯股\" ) AND s.stock.name == \"融药服务讯\" \nRETURN n.name\nLIMIT 50", 0, 0.0003211498260498047], ["MATCH (s:stock)\nWHERE s.stock.name == \"融药服务讯\" AND ( s.stock.name == \"服务\" OR s.stock.name == \"讯股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00023317337036132812]]}, {"query": "有哪些托管给金云基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '金云' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"金云\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014495849609375], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"金云\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014371871948242188]]}, {"query": "资建电股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资建电' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资建电\" AND ( s.stock.name == \"资建\" OR s.stock.name == \"电股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012569427490234375], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"资建\" OR s.stock.name == \"电股\" ) AND s.stock.name == \"资建电\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013802051544189453]]}, {"query": "有哪些股东是资建电股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资建电' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资建电\" AND ( s.stock.name == \"资建\" OR s.stock.name == \"电股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002868175506591797], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"资建\" OR s.stock.name == \"电股\" ) AND s.stock.name == \"资建电\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00034689903259277344]]}, {"query": "航空航天行业包括的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '航空航天' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0024292469024658203], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.002521991729736328]]}, {"query": "有哪些托管给姜微生基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '姜微生' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"姜微生\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015549659729003906], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"姜微生\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014884471893310547]]}, {"query": "戚东门基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '戚东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"戚东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015192031860351562], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"戚东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014891624450683594]]}, {"query": "有哪些属于石油和天然气行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '石油和天然气' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"石油\" AND ( s.stock.name == \"石油\" OR s.stock.name == \"天然\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013725757598876953], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"石油\" OR s.stock.name == \"天然\" ) AND s.stock.name == \"石油\" \nRETURN s.stock\nLIMIT 50", 0, 0.001346588134765625]]}, {"query": "有哪些托管给冯西门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '冯西门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"冯西门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015232563018798828], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"冯西门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014786720275878906]]}, {"query": "石油和天然气产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '石油和天然气' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015225410461425781], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001592874526977539]]}, {"query": "有哪些上游是石油和天然气产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '石油和天然气' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014896392822265625], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014872550964355469]]}, {"query": "家居用品产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '家居用品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013904571533203125], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014240741729736328]]}, {"query": "有哪些上游是家居用品产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '家居用品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014424324035644531], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001645803451538086]]}, {"query": "有哪些托管给窦司马基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '窦司马' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"窦司马\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015456676483154297], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"窦司马\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015289783477783203]]}, {"query": "国泰融信定增灵活配置混合基金涉及的公告", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '国泰融信定增灵活配置混合' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.001657724380493164], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0015332698822021484]]}, {"query": "有哪些托管给陶百里基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陶百里' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陶百里\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014951229095458984], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶百里\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014529228210449219]]}, {"query": "有哪些属于金融服务行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '金融服务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"金融\" OR s.stock.name == \"服务\" ) AND s.stock.name == \"金融\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013947486877441406], ["MATCH (s:stock)\nWHERE s.stock.name == \"金融\" AND ( s.stock.name == \"金融\" OR s.stock.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017142295837402344]]}, {"query": "褚南门基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015254020690917969], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014803409576416016]]}, {"query": "有哪些托管给褚南门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015671253204345703], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018906593322753906]]}, {"query": "吴宇文基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吴宇文' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吴宇文\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018312931060791016], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴宇文\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017275810241699219]]}, {"query": "公用事业产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '公用事业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004596233367919922], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00435638427734375]]}, {"query": "有哪些上游是公用事业产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '公用事业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0035195350646972656], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003937482833862305]]}, {"query": "医有地房环股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '医有地房环' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医有\" AND s.stock.name == \"房环\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013890266418457031], ["MATCH (s:stock)\nWHERE s.stock.name == \"房环\" AND s.stock.name == \"医有\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014352798461914062]]}, {"query": "有哪些股东是医有地房环股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '医有地房环' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医有\" AND s.stock.name == \"房环\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002880096435546875], ["MATCH (s:stock)\nWHERE s.stock.name == \"房环\" AND s.stock.name == \"医有\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00024437904357910156]]}, {"query": "航空公司产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '航空公司' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015864372253417969], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001489877700805664]]}, {"query": "有哪些上游是航空公司产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '航空公司' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016210079193115234], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015420913696289062]]}, {"query": "汽车产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '汽车' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021543502807617188], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0023195743560791016]]}, {"query": "有哪些上游是汽车产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '汽车' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018451213836669922], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021016597747802734]]}, {"query": "有哪些托管给李谷梁基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '李谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"李谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014562606811523438], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"李谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001415252685546875]]}, {"query": "股票太原重工2013年第一季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '太原重工' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"太原重工\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.003084897994995117], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"太原重工\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0030584335327148438], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"太原重工\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002915620803833008], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"太原重工\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.003147125244140625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"太原重工\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.003061056137084961], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"太原重工\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026907920837402344]]}, {"query": "2013年1到3月股票太原重工的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '太原重工' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"太原重工\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024306774139404297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"太原重工\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0022859573364257812]]}, {"query": "股票中国太保2013年第二季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '中国太保' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 2 \nRETURN s.stock\nLIMIT 50", 0, 0.00040149688720703125], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0003311634063720703]]}]