[{"query": "有哪些托管给杨仲孙基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '杨仲孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"杨仲孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013675689697265625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨仲孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014188289642333984]]}, {"query": "有哪些托管给蒋黎丘基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '蒋黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"蒋黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014438629150390625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"蒋黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001417398452758789]]}, {"query": "有哪些名下有建设机械股票的老板", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '建设机械' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"有建\" AND s.stock.name == \"机械\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012896060943603516], ["MATCH (s:stock)\nWHERE s.stock.name == \"机械\" AND s.stock.name == \"有建\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012583732604980469]]}, {"query": "有哪些属于易方达环保主题灵活配置混合基金的股票", "golden": "MATCH (pof1:public_offering_fund)-[h:hold]->(s2:stock) WHERE pof1.public_offering_fund.name == '易方达环保主题灵活配置混合' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"环保\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014142990112304688], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND s.stock.name == \"环保\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001360177993774414]]}, {"query": "有哪些托管给秦上官基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014605522155761719], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013692378997802734]]}, {"query": "建团发医股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建团发医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"建团\" AND s.stock.name == \"医股\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0011925697326660156], ["MATCH (s:stock)\nWHERE s.stock.name == \"医股\" AND s.stock.name == \"建团\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012454986572265625]]}, {"query": "有哪些股东是建团发医股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建团发医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"建团\" AND s.stock.name == \"医股\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030994415283203125], ["MATCH (s:stock)\nWHERE s.stock.name == \"医股\" AND s.stock.name == \"建团\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002675056457519531]]}, {"query": "水务产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '水务' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"务产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0012502670288085938], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"务产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013325214385986328]]}, {"query": "有哪些上游是水务产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '水务' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"务产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0012807846069335938], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"务产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001373291015625]]}, {"query": "科服发通股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '科服发通' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"科服\" AND s.stock.name == \"通股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012731552124023438], ["MATCH (s:stock)\nWHERE s.stock.name == \"通股\" AND s.stock.name == \"科服\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012907981872558594]]}, {"query": "有哪些股东是科服发通股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '科服发通' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"科服\" AND s.stock.name == \"通股\" \nRETURN n.name\nLIMIT 50", 0, 0.0002841949462890625], ["MATCH (s:stock)\nWHERE s.stock.name == \"通股\" AND s.stock.name == \"科服\" \nRETURN n.name\nLIMIT 50", 0, 0.0002510547637939453]]}, {"query": "有房限医股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '有房限医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"有房限医\" AND ( s.stock.name == \"房限\" OR s.stock.name == \"医股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013132095336914062], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"房限\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"有房限医\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013453960418701172]]}, {"query": "有哪些股东是有房限医股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '有房限医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"有房限医\" AND ( s.stock.name == \"房限\" OR s.stock.name == \"医股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00041174888610839844], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"房限\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"有房限医\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.000331878662109375]]}, {"query": "戚亓基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '戚亓' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"戚亓\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014061927795410156], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"戚亓\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013840198516845703]]}, {"query": "有哪些托管给戚亓基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '戚亓' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"戚亓\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014226436614990234], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"戚亓\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001444101333618164]]}, {"query": "融制造筑资股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融制造筑资' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"制造\" OR s.stock.name == \"筑资\" ) AND s.stock.name == \"融制造筑资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012340545654296875], ["MATCH (s:stock)\nWHERE s.stock.name == \"融制造筑资\" AND ( s.stock.name == \"制造\" OR s.stock.name == \"筑资\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0012807846069335938]]}, {"query": "有哪些股东是融制造筑资股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融制造筑资' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"融制造筑资\" AND ( s.stock.name == \"制造\" OR s.stock.name == \"筑资\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00028204917907714844], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"制造\" OR s.stock.name == \"筑资\" ) AND s.stock.name == \"融制造筑资\" \nRETURN n.name\nLIMIT 50", 0, 0.0002644062042236328]]}, {"query": "有哪些托管给曹闾丘基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '曹闾丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"曹闾丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013718605041503906], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"曹闾丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001444101333618164]]}, {"query": "有哪些托管给姜北门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '姜北门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"姜北门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014712810516357422], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"姜北门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016815662384033203]]}, {"query": "务发司通份股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务发司通份' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"务发\" OR s.stock.name == \"司通\" ) AND s.stock.name == \"务发司通份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014812946319580078], ["MATCH (s:stock)\nWHERE s.stock.name == \"务发司通份\" AND ( s.stock.name == \"务发\" OR s.stock.name == \"司通\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.00141143798828125]]}, {"query": "有哪些股东是务发司通份股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务发司通份' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"务发司通份\" AND ( s.stock.name == \"务发\" OR s.stock.name == \"司通\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030803680419921875], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"务发\" OR s.stock.name == \"司通\" ) AND s.stock.name == \"务发司通份\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00023317337036132812]]}, {"query": "戚东门基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '戚东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"戚东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015022754669189453], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"戚东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001608133316040039]]}, {"query": "张左丘基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '张左丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"张左丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014905929565429688], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"张左丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016613006591796875]]}, {"query": "限环电地金股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '限环电地金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"地金\" AND s.stock.name == \"限环\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014095306396484375], ["MATCH (s:stock)\nWHERE s.stock.name == \"限环\" AND s.stock.name == \"地金\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001398324966430664]]}, {"query": "有哪些股东是限环电地金股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '限环电地金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"地金\" AND s.stock.name == \"限环\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030231475830078125], ["MATCH (s:stock)\nWHERE s.stock.name == \"限环\" AND s.stock.name == \"地金\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002315044403076172]]}, {"query": "有哪些托管给张洛阳基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '张洛阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"张洛阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014259815216064453], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"张洛阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015676021575927734]]}, {"query": "龙头股份股票的老板", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '龙头股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"龙头股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙头股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015718936920166016], ["MATCH (s:stock)\nWHERE s.stock.name == \"龙头股份\" AND ( s.stock.name == \"龙头股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016238689422607422]]}, {"query": "务限有建金股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务限有建金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"有建\" OR s.stock.name == \"金股\" ) AND s.stock.name == \"务限有建金\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013782978057861328], ["MATCH (s:stock)\nWHERE s.stock.name == \"务限有建金\" AND ( s.stock.name == \"有建\" OR s.stock.name == \"金股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016171932220458984]]}, {"query": "有哪些股东是务限有建金股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务限有建金' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"有建\" OR s.stock.name == \"金股\" ) AND s.stock.name == \"务限有建金\" \nRETURN n.name\nLIMIT 50", 0, 0.0002930164337158203], ["MATCH (s:stock)\nWHERE s.stock.name == \"务限有建金\" AND ( s.stock.name == \"有建\" OR s.stock.name == \"金股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00023698806762695312]]}, {"query": "万家陆家嘴金融城金融债一年定开债券基金涉及的讯息", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '万家陆家嘴金融城金融债一年定开债券' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) AND pof.public_offering_fund.name == \"金融\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013210773468017578], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金融\" AND ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012543201446533203]]}, {"query": "有哪些提到万家陆家嘴金融城金融债一年定开债券公募基金的新闻", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '万家陆家嘴金融城金融债一年定开债券' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) AND pof.public_offering_fund.name == \"金融\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0014317035675048828], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金融\" AND ( pof.public_offering_fund.name == \"陆家嘴\" OR pof.public_offering_fund.name == \"金融\" ) \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012562274932861328]]}, {"query": "施司空基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '施司空' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"施司空\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014624595642089844], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"施司空\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014047622680664062]]}, {"query": "医疗保健设施产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '医疗保健设施' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014514923095703125], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0012252330780029297]]}, {"query": "有哪些上游是医疗保健设施产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '医疗保健设施' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013189315795898438], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013670921325683594]]}, {"query": "蒋北门基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '蒋北门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"蒋北门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013585090637207031], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"蒋北门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013403892517089844]]}, {"query": "电视和广播产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电视和广播' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0040929317474365234], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004011631011962891]]}, {"query": "有哪些上游是电视和广播产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电视和广播' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038602352142333984], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.009081125259399414]]}, {"query": "产能电资股股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '产能电资股' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"产能\" AND ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013842582702636719], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) AND s.stock.name == \"产能\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014679431915283203]]}, {"query": "有哪些股东是产能电资股股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '产能电资股' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) AND s.stock.name == \"产能\" \nRETURN n.name\nLIMIT 50", 0, 0.0003371238708496094], ["MATCH (s:stock)\nWHERE s.stock.name == \"产能\" AND ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003204345703125]]}, {"query": "运输和物流产业关联的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '运输和物流' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"物流\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014667510986328125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"物流\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016589164733886719]]}, {"query": "有哪些托管给钱西门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '钱西门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"钱西门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001470804214477539], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"钱西门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013980865478515625]]}, {"query": "蒋宰父基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '蒋宰父' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"蒋宰父\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016062259674072266], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"蒋宰父\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014510154724121094]]}, {"query": "龙建股份股票所属的公募基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '龙建股份' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙建股份\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002732992172241211], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"龙建股份\" AND ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002921581268310547]]}, {"query": "有哪些持有龙建股份股票的基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '龙建股份' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙建股份\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002694845199584961], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"龙建股份\" AND ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0027582645416259766]]}, {"query": "有哪些属于运输和物流行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '运输和物流' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"运输\" OR s.stock.name == \"物流\" ) AND s.stock.name == \"运输\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013909339904785156], ["MATCH (s:stock)\nWHERE s.stock.name == \"运输\" AND ( s.stock.name == \"运输\" OR s.stock.name == \"物流\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012981891632080078]]}, {"query": "有哪些托管给谢诸葛基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '谢诸葛' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"谢诸葛\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015358924865722656], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"谢诸葛\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014729499816894531]]}, {"query": "国泰中证动漫游戏ETF联接C公募基金涉及的消息", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '国泰中证动漫游戏ETF联接C' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"游戏\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013175010681152344], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"游戏\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013036727905273438]]}, {"query": "有哪些提到国泰中证动漫游戏ETF联接C基金的新闻", "golden": "MATCH (pof1:public_offering_fund)-[iv:involve]->(i2:information) WHERE pof1.public_offering_fund.name == '国泰中证动漫游戏ETF联接C' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"游戏\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012271404266357422], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"游戏\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0016405582427978516]]}, {"query": "纺织品和服装产业关联的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '纺织品和服装' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014715194702148438], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014414787292480469]]}, {"query": "有哪些关联纺织品和服装产业的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '纺织品和服装' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013594627380371094], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014884471893310547]]}, {"query": "有哪些托管给朱赫连基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015075206756591797], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001435995101928711]]}, {"query": "陶呼延基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陶呼延' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶呼延\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014693737030029297], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陶呼延\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001436471939086914]]}, {"query": "有哪些托管给陶呼延基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陶呼延' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶呼延\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013532638549804688], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陶呼延\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001379251480102539]]}, {"query": "制产份展保股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '制产份展保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"制产份展保\" AND ( s.stock.name == \"份展\" OR s.stock.name == \"保股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013327598571777344], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"份展\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"制产份展保\" \nRETURN s.stock\nLIMIT 50", 0, 0.001285552978515625]]}, {"query": "有哪些股东是制产份展保股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '制产份展保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"份展\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"制产份展保\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002827644348144531], ["MATCH (s:stock)\nWHERE s.stock.name == \"制产份展保\" AND ( s.stock.name == \"份展\" OR s.stock.name == \"保股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002684593200683594]]}, {"query": "有哪些股东是数技房限股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '数技房限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"数技房限\" AND ( s.stock.name == \"技房\" OR s.stock.name == \"限股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002696514129638672], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"技房\" OR s.stock.name == \"限股\" ) AND s.stock.name == \"数技房限\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00021409988403320312]]}]