[{"query": "股票新钢股份2016年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND s.stock.name == '新钢股份' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0004634857177734375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0003998279571533203]]}, {"query": "股票昂立教育2016年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND s.stock.name == '昂立教育' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"教育\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0014142990112304688], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"教育\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015418529510498047]]}, {"query": "股票千金药业2013年的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND s.stock.name == '千金药业' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"金药\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.00151824951171875], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"金药\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001569986343383789]]}, {"query": "股票王府井2013年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND s.stock.name == '王府井' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"王府井\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023238658905029297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"王府井\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002264738082885742]]}, {"query": "股票青海华鼎2014年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2014 AND s.stock.name == '青海华鼎' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"青海华鼎\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002549409866333008], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"青海华鼎\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002496004104614258]]}, {"query": "股票三峡新材2014年的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2014 AND s.stock.name == '三峡新材' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"三峡新材\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002611875534057617], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"三峡新材\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0029535293579101562]]}, {"query": "股票国发股份2014年的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2014 AND s.stock.name == '国发股份' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014383792877197266], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014357566833496094]]}, {"query": "股票西藏旅游2016年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND s.stock.name == '西藏旅游' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"旅游\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.001477956771850586], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"旅游\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0014603137969970703]]}, {"query": "股票浦东金桥2016年的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND s.stock.name == '浦东金桥' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"浦东金桥\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002306699752807617], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"浦东金桥\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002310514450073242]]}, {"query": "股票国电电力2013年的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND s.stock.name == '国电电力' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"国电电力\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002787351608276367], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"国电电力\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002554655075073242]]}, {"query": "股票中国联通2013年的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND s.stock.name == '中国联通' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"中国联通\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025680065155029297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"中国联通\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025589466094970703]]}, {"query": "股票盛和资源2014年的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2014 AND s.stock.name == '盛和资源' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"资源\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014498233795166016], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"资源\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015037059783935547]]}, {"query": "股票万东医疗2013年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND s.stock.name == '万东医疗' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"万东医疗\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0027730464935302734], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"万东医疗\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024209022521972656]]}, {"query": "股票大连热电2013年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND s.stock.name == '大连热电' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"大连热电\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025255680084228516], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"大连热电\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002422809600830078]]}, {"query": "股票东方通信2016年的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND s.stock.name == '东方通信' RETURN s.stock.name, sfi.stock_financial_information.year, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"东方通信\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023605823516845703], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"东方通信\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023758411407470703]]}, {"query": "哪些股票的涨跌幅不比宝光股份小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宝光股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range >= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝光股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0007386207580566406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝光股份\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0005331039428710938]]}, {"query": "最高价不大于纺织品和服装行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.011740922927856445], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.007160663604736328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.05672430992126465], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.003290891647338867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0041103363037109375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0018243789672851562]]}, {"query": "哪些行业的最高价不比纺织品和服装大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0007376670837402344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0004904270172119141], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0006322860717773438], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003600120544433594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00039124488830566406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003447532653808594]]}, {"query": "最低价大于特变电工上市公司的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '特变电工' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"特变电工\" WITH sd.stock_data.minimum_price as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > temp \nRETURN s.stock\nLIMIT 50", 0, 45.07553720474243], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"特变电工\" WITH sd.stock_data.minimum_price as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > temp AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.7725577354431152], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"特变电工\" WITH sd.stock_data.minimum_price as temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.minimum_price > temp \nRETURN s.stock\nLIMIT 50", 0, 0.0671701431274414]]}, {"query": "哪些上市公司的最低价比特变电工大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '特变电工' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"特变电工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.2037975788116455], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"特变电工\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.10087919235229492]]}, {"query": "哪些行业的涨跌幅和零售一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"零售\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.05037426948547363], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.05841398239135742]]}, {"query": "涨跌幅大于渤海汽车股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '渤海汽车' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0410456657409668], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.05183219909667969]]}, {"query": "哪些股票的涨跌幅比渤海汽车大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '渤海汽车' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汽车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0008180141448974609], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"汽车\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0004379749298095703]]}, {"query": "哪些行业的收盘价不比航天和国防小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航天和国防' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price >= temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.010100603103637695], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.008215904235839844]]}, {"query": "哪些股票的最低价和金地集团一样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金地集团' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金地集团\" \nRETURN s.stock.name\nLIMIT 50", 1, 0.0996859073638916], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金地集团\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 1, 0.038405656814575195]]}, {"query": "开盘价等于珠宝和宝石行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.021723270416259766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.005987405776977539]]}, {"query": "哪些行业的开盘价和珠宝和宝石一样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.007621288299560547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.003189563751220703]]}, {"query": "哪些上市公司的涨跌幅和冠农股份相等", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '冠农股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range == temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"冠农股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.23055720329284668], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"冠农股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.04381728172302246]]}, {"query": "哪些行业的收盘价和汽车制造一样大", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车制造' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price == temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.03519797325134277], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.012367010116577148]]}, {"query": "哪些股票的开盘价比百花医药小", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '百花医药' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0013072490692138672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"百花\" OR s.stock.name == \"医药\" ) \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0004284381866455078]]}, {"query": "哪些行业的涨跌幅比船舶和海运小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.range AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.028032302856445312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.007863759994506836]]}, {"query": "开盘价小于污水处理行业的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.01387333869934082], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.002866506576538086]]}, {"query": "哪些行业的开盘价比污水处理小", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < temp RETURN t.trade.name\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.011357545852661133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade.name\nLIMIT 50", 0, 0.0034837722778320312]]}, {"query": "涨跌幅大于大龙地产股票的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '大龙地产' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0389857292175293], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0026810169219970703]]}, {"query": "哪些股票的涨跌幅比大龙地产大", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '大龙地产' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0007305145263671875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN n.name,s.stock.name\nLIMIT 50", 0, 0.0005285739898681641]]}]