[{"query": "开盘价高于国泰君安的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国泰君安' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0005781650543212891], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0004067420959472656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND sd.stock_data.opening_price > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.00029277801513671875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND sd.stock_data.opening_price > temp AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0002841949462890625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock.name\nLIMIT 50", 0, 0.000247955322265625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price > temp AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0003809928894042969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0003254413604736328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price > temp AND s.stock.name == \"国泰君安\" WITH sd.stock_data.opening_price as temp , temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND sd.stock_data.opening_price > temp AND sd.stock_data.opening_price > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0003361701965332031]]}, {"query": "成立日期不大于内蒙华电股票的股票", "golden": "MATCH (s:stock) WHERE s.stock.name == '内蒙华电' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"内蒙华电\" AND ( s.stock.name == \"内蒙华\" OR s.stock.name == \"电股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.002338409423828125], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"内蒙华\" OR s.stock.name == \"电股\" ) AND s.stock.name == \"内蒙华电\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0019297599792480469]]}, {"query": "最新净值小于华泰柏瑞现代服务业混合基金的基金", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '华泰柏瑞现代服务业混合' WITH pof.public_offering_fund.net_worth AS temp MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.net_worth < temp RETURN pof.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"服务\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002917766571044922], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"服务\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018122196197509766]]}, {"query": "规模大于运输和物流产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"运输\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.25702738761901855], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"运输\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.26746535301208496], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"运输\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2643561363220215]]}, {"query": "成立日期不大于华泰股份股票的股票", "golden": "MATCH (s:stock) WHERE s.stock.name == '华泰股份' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"华泰股份\" AND ( s.stock.name == \"华泰股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.002542734146118164], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"华泰股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"华泰股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0022292137145996094]]}, {"query": "哪些产业的规模和纺织品和服装一样", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale == temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.002429485321044922], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0017714500427246094]]}, {"query": "规模大于食品和饮料产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"食品\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2803356647491455], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"食品\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2444159984588623], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"食品\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.24622225761413574]]}, {"query": "规模大于农业机械产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '农业机械' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.26946401596069336], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.250685453414917], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2606818675994873]]}, {"query": "规模大于金融技术产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '金融技术' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.27277112007141113], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"金融\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2786870002746582], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2707710266113281]]}, {"query": "哪些产业的规模不比航空航天小", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale >= temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.005661964416503906], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.00816655158996582]]}, {"query": "哪些产业的规模不比纺织品和服装小", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale >= temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0029480457305908203], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0017795562744140625]]}, {"query": "规模大于电信服务提供商产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"电信\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2948477268218994], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"电信\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2546815872192383], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"电信\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.25493383407592773]]}, {"query": "成立日期大于龙建股份股票的股票", "golden": "MATCH (s:stock) WHERE s.stock.name == '龙建股份' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙建股份\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE s.stock.establishment_date > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.018388032913208008], ["MATCH (s:stock)\nWHERE s.stock.name == \"龙建股份\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE s.stock.establishment_date > temp AND ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.02200460433959961], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙建股份\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) AND s.stock.establishment_date > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.017000198364257812]]}, {"query": "哪些产业的规模比纺织品和服装小", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale < temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0025093555450439453], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0018837451934814453]]}, {"query": "成立日期不大于悦达投资股票的股票", "golden": "MATCH (s:stock) WHERE s.stock.name == '悦达投资' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"悦达投资\" AND ( s.stock.name == \"悦达投\" OR s.stock.name == \"资股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.002123117446899414], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"悦达投\" OR s.stock.name == \"资股\" ) AND s.stock.name == \"悦达投资\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0019257068634033203]]}, {"query": "规模大于媒体和娱乐产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"媒体\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.26218414306640625], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"媒体\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2440178394317627], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"媒体\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.24409031867980957]]}, {"query": "最新净值大于融通多元收益一年持有期混合基金的基金", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通多元收益一年持有期混合' WITH pof.public_offering_fund.net_worth AS temp MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.net_worth > temp RETURN pof.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"融通\" WITH pof.public_offering_fund.net_worth as temp\nMATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.net_worth > temp \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.8428919315338135], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" WITH pof.public_offering_fund.net_worth as temp\nMATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.net_worth > temp AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0028533935546875], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"融通\" WITH pof.public_offering_fund.net_worth as temp\nMATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.net_worth > temp \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00255584716796875]]}, {"query": "规模不大于航空航天产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale <= temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.006242513656616211], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0050449371337890625]]}, {"query": "哪些产业的规模不比航空航天大", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale <= temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.006337881088256836], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.006628513336181641]]}, {"query": "哪些产业的规模和纺织品和服装相等", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale == temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0030639171600341797], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0019268989562988281]]}, {"query": "规模大于航空航天产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.24043631553649902], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.255037784576416], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.25176143646240234]]}, {"query": "哪些产业的规模比航空航天大", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.005750894546508789], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0057904720306396484]]}, {"query": "认购结束时间大于融通新趋势灵活配置混合基金的基金", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通新趋势灵活配置混合' WITH pof.public_offering_fund.subscription_end_time AS temp MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.subscription_end_time > temp RETURN pof.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"融通\" WITH pof.public_offering_fund.subscription_end_time as temp\nMATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.subscription_end_time > temp \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.8528332710266113], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"融通\" WITH pof.public_offering_fund.subscription_end_time as temp\nMATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.subscription_end_time > temp \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0033571720123291016], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" WITH pof.public_offering_fund.subscription_end_time as temp\nMATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.subscription_end_time > temp AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00290679931640625]]}, {"query": "哪些产业的规模比航空航天小", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale < temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.006622791290283203], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.00494074821472168]]}, {"query": "规模大于石油和天然气产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale > temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"石油\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2555575370788574], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"石油\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp \nRETURN indus.industry.name\nLIMIT 50", 0, 0.2520616054534912], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"石油\" WITH indus.industry.scale as temp\nMATCH (indus:industry)\nWHERE indus.industry.scale > temp AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.24011850357055664]]}, {"query": "成立日期不大于山东黄金股票的股票", "golden": "MATCH (s:stock) WHERE s.stock.name == '山东黄金' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"山东黄\" OR s.stock.name == \"金股\" ) AND s.stock.name == \"山东黄金\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0026390552520751953], ["MATCH (s:stock)\nWHERE s.stock.name == \"山东黄金\" AND ( s.stock.name == \"山东黄\" OR s.stock.name == \"金股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023326873779296875]]}, {"query": "规模不大于纺织品和服装产业的产业", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale <= temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.002517223358154297], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0020530223846435547]]}, {"query": "哪些产业的规模不比纺织品和服装大", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp MATCH (n:industry) WHERE n.industry.scale <= temp RETURN n.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.002366304397583008], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0018379688262939453]]}, {"query": "成立日期不大于交运股份股票的股票", "golden": "MATCH (s:stock) WHERE s.stock.name == '交运股份' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date <= temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"交运股份\" AND ( s.stock.name == \"交运股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023775100708007812], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"交运股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"交运股份\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018868446350097656]]}, {"query": "成立日期大于交通银行上市公司的上市公司", "golden": "MATCH (s:stock) WHERE s.stock.name == '交通银行' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"交通\" OR s.stock.name == \"银行\" ) AND s.stock.name == \"交通\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"交通\" OR s.stock.name == \"银行\" ) AND s.stock.establishment_date > temp \nRETURN s.stock\nLIMIT 50", 0, 0.016555070877075195], ["MATCH (s:stock)\nWHERE s.stock.name == \"交通\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE s.stock.establishment_date > temp AND ( s.stock.name == \"交通\" OR s.stock.name == \"银行\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018663883209228516], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"交通\" OR s.stock.name == \"银行\" ) AND s.stock.name == \"交通\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE s.stock.establishment_date > temp \nRETURN s.stock\nLIMIT 50", 0, 0.016327857971191406]]}, {"query": "成立日期大于武钢股份股票的股票", "golden": "MATCH (s:stock) WHERE s.stock.name == '武钢股份' WITH s.stock.establishment_date AS temp MATCH (s:stock) WHERE s.stock.establishment_date > temp RETURN s.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"武钢股份\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE s.stock.establishment_date > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.02034592628479004], ["MATCH (s:stock)\nWHERE s.stock.name == \"武钢股份\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE s.stock.establishment_date > temp AND ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.02255845069885254], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"武钢股份\" WITH s.stock.establishment_date as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"武钢股\" OR s.stock.name == \"份股\" ) AND s.stock.establishment_date > temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.015788555145263672]]}, {"query": "管理费不大于南方人工智能主题混合基金的基金", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '南方人工智能主题混合' WITH pof.public_offering_fund.management_fee AS temp MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.management_fee <= temp RETURN pof.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"人工智能\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002778768539428711], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"人工智能\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.002262592315673828]]}]