[{"query": "酒店和度假村和航空公司产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"航空\" AND indus.industry.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0003116130828857422], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"航空\" \nRETURN temp\nLIMIT 50", 0, 0.00026917457580566406]]}, {"query": "酒店和度假村和航空公司产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015575885772705078], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航空\" AND indus.industry.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015461444854736328]]}, {"query": "酒店和度假村和航空公司产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015168190002441406], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航空\" AND indus.industry.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014109611511230469]]}, {"query": "国泰民享稳健养老目标一年持有期混合(FOF)和工银瑞信中证稀有金属主题ETF联接A基金的管理费差距", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰民享稳健养老目标一年持有期混合(FOF)' WITH pof.public_offering_fund.management_fee AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '工银瑞信中证稀有金属主题ETF联接A' WITH ABS(pof.public_offering_fund.management_fee - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"国泰君安\" AND s.stock.name == \"金属\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016782283782958984], ["MATCH (s:stock)\nWHERE s.stock.name == \"金属\" AND s.stock.name == \"国泰君安\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013191699981689453]]}, {"query": "国泰民享稳健养老目标一年持有期混合(FOF)和工银瑞信中证稀有金属主题ETF联接A基金的管理费差多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰民享稳健养老目标一年持有期混合(FOF)' WITH pof.public_offering_fund.management_fee AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '工银瑞信中证稀有金属主题ETF联接A' WITH ABS(pof.public_offering_fund.management_fee - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金属\" AND s.stock.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.0002994537353515625], ["MATCH (s:stock)\nWHERE s.stock.name == \"国泰君安\" AND s.stock.name == \"金属\" \nRETURN temp\nLIMIT 50", 0, 0.0002853870391845703]]}, {"query": "医疗设备和化学的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化学' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"化学\" \nRETURN temp\nLIMIT 50", 0, 0.0002849102020263672], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"化学\" AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.00022864341735839844]]}, {"query": "医疗设备和化学的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化学' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014410018920898438], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"化学\" AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021491050720214844]]}, {"query": "医疗设备和化学的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化学' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.001459360122680664], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"化学\" AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.002157926559448242]]}, {"query": "物流服务和化妆品的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '物流服务' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化妆品' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"服务\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"化妆品\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002064943313598633], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"服务\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"化妆品\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0023345947265625], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服务\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"化妆品\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.002622842788696289], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"服务\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"化妆品\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.001970529556274414]]}, {"query": "汽车零部件和酒精饮料的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016407966613769531], ["MATCH (t:trade)\nWHERE t.trade.name == \"饮料\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013208389282226562]]}, {"query": "汽车零部件和酒精饮料的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"饮料\" \nRETURN temp\nLIMIT 50", 0, 0.00034356117248535156], ["MATCH (t:trade)\nWHERE t.trade.name == \"饮料\" AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.00028443336486816406]]}, {"query": "农产品和食品和饮料的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '农产品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"食品\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"食品\" ) \nRETURN temp\nLIMIT 50", 0, 0.00024890899658203125], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"食品\" ) AND t.trade.name == \"食品\" WITH as temp1\nMATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"食品\" ) AND t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00019025802612304688], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"食品\" ) AND t.trade.name == \"食品\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00017547607421875], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"食品\" ) AND t.trade.name == \"食品\" WITH as temp1\nMATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"食品\" ) AND t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"食品\" ) \nRETURN temp\nLIMIT 50", 0, 0.00022602081298828125]]}, {"query": "家居用品和船舶和海运的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"家居\" AND t.trade.name == \"船舶\" \nRETURN temp\nLIMIT 50", 0, 0.0002963542938232422], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"家居\" \nRETURN temp\nLIMIT 50", 0, 0.0002613067626953125]]}, {"query": "家居用品和船舶和海运的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家居用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"家居\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013189315795898438], ["MATCH (t:trade)\nWHERE t.trade.name == \"家居\" AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013353824615478516]]}, {"query": "电力工具和设备和农业产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"农业\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016095638275146484], ["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015704631805419922]]}, {"query": "电力工具和设备和农业产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.0002799034118652344], ["MATCH (t:trade)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"农业\" \nRETURN temp\nLIMIT 50", 0, 0.00023484230041503906]]}, {"query": "电力工具和设备和农业产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"农业\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017273426055908203], ["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015997886657714844]]}, {"query": "医疗设备和运输和物流产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.000335693359375], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.00037169456481933594]]}, {"query": "医疗设备和运输和物流产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016379356384277344], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016264915466308594]]}, {"query": "医疗设备和运输和物流产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001596212387084961], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.001608133316040039]]}, {"query": "农业和金融技术的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '农业' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金融技术' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0020570755004882812], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"金融\" ) \nRETURN temp\nLIMIT 50", 0, 0.0026693344116210938], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"金融\" ) \nRETURN temp\nLIMIT 50", 0, 0.0024056434631347656], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0020542144775390625]]}, {"query": "工商银行和深高速的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '工商银行' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '深高速' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE s.stock.name == \"深高速\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"银行\" OR s.stock.name == \"深高速\" ) \nRETURN temp\nLIMIT 50", 0, 0.002524137496948242], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"银行\" OR s.stock.name == \"深高速\" ) AND s.stock.name == \"银行\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE ( s.stock.name == \"银行\" OR s.stock.name == \"深高速\" ) AND s.stock.name == \"深高速\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (s:stock)\nWHERE ( s.stock.name == \"银行\" OR s.stock.name == \"深高速\" ) \nRETURN temp\nLIMIT 50", 0, 0.0024144649505615234], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"银行\" OR s.stock.name == \"深高速\" ) AND s.stock.name == \"银行\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE ( s.stock.name == \"银行\" OR s.stock.name == \"深高速\" ) AND s.stock.name == \"深高速\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0021965503692626953], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"银行\" OR s.stock.name == \"深高速\" ) AND s.stock.name == \"银行\" WITH s.stock.establishment_date as temp1\nMATCH (s:stock)\nWHERE s.stock.name == \"深高速\" WITH s.stock.establishment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0021314620971679688]]}, {"query": "船舶和海运和汽车的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0027511119842529297], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"汽车\" AND t.trade.name == \"船舶\" \nRETURN s.stock\nLIMIT 50", 0, 0.002615213394165039]]}, {"query": "船舶和海运和汽车的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0025234222412109375], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"汽车\" AND t.trade.name == \"船舶\" \nRETURN s.stock\nLIMIT 50", 0, 0.002451181411743164]]}, {"query": "汽车零部件和航空航天的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016574859619140625], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016622543334960938], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001565694808959961], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"汽车\" AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016829967498779297], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND t.trade.name == \"汽车\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017113685607910156], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018334388732910156]]}, {"query": "汽车零部件和航空航天的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017745494842529297], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017402172088623047], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017397403717041016], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"汽车\" AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016951560974121094], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND t.trade.name == \"汽车\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001714468002319336], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.001634836196899414]]}, {"query": "电信服务提供商和房地产的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '房地产' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"房地产\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003173351287841797], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"房地产\" \nRETURN temp\nLIMIT 50", 0, 0.00027441978454589844]]}, {"query": "电信服务提供商和房地产的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '房地产' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"房地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.002161264419555664], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"房地产\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0021276473999023438]]}, {"query": "电信服务提供商和房地产的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '房地产' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"房地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.002090930938720703], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"房地产\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002121448516845703]]}, {"query": "酒店和度假村和电信服务提供商的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013363361358642578], ["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0013408660888671875]]}, {"query": "酒店和度假村和电信服务提供商的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003314018249511719], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0002739429473876953]]}, {"query": "酒店和度假村和电信服务提供商的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013108253479003906], ["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0013446807861328125]]}, {"query": "高科技和金融技术的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '高科技' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金融技术' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00203704833984375], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"金融\" ) \nRETURN temp\nLIMIT 50", 0, 0.0021550655364990234], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002044677734375], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"金融\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"金融\" ) AND indus.industry.name == \"技术\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"金融\" ) \nRETURN temp\nLIMIT 50", 0, 0.0024721622467041016]]}, {"query": "电科芯片和华微电子股票的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '电科芯片' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '华微电子' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"华微电子\" AND s.stock.name == \"电科\" \nRETURN s.stock\nLIMIT 50", 0, 0.001619577407836914], ["MATCH (s:stock)\nWHERE s.stock.name == \"电科\" AND s.stock.name == \"华微电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013511180877685547]]}, {"query": "电科芯片和华微电子股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '电科芯片' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '华微电子' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"华微电子\" AND s.stock.name == \"电科\" \nRETURN temp\nLIMIT 50", 0, 0.0003204345703125], ["MATCH (s:stock)\nWHERE s.stock.name == \"电科\" AND s.stock.name == \"华微电子\" \nRETURN temp\nLIMIT 50", 0, 0.0002231597900390625]]}, {"query": "姜皇甫和褚西门的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '姜皇甫' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '褚西门' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"姜皇甫\" OR fm.fund_manager.name == \"褚西门\" ) AND fm.fund_manager.name == \"姜皇甫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"姜皇甫\" OR fm.fund_manager.name == \"褚西门\" ) AND fm.fund_manager.name == \"褚西门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"姜皇甫\" OR fm.fund_manager.name == \"褚西门\" ) \nRETURN temp\nLIMIT 50", 0, 0.00025773048400878906], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"姜皇甫\" OR fm.fund_manager.name == \"褚西门\" ) AND fm.fund_manager.name == \"姜皇甫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"姜皇甫\" OR fm.fund_manager.name == \"褚西门\" ) AND fm.fund_manager.name == \"褚西门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00019860267639160156], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"姜皇甫\" OR fm.fund_manager.name == \"褚西门\" ) AND fm.fund_manager.name == \"姜皇甫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚西门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00023365020751953125], ["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"姜皇甫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚西门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"姜皇甫\" OR fm.fund_manager.name == \"褚西门\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002300739288330078]]}, {"query": "船舶和海运和医疗保健的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"船舶\" \nRETURN temp\nLIMIT 50", 0, 0.0002872943878173828], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.00021409988403320312]]}]