[{"query": "2008年4月10日到2022年11月11日的正源股份的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '正源股份' AND sd.stock_data.`date` >= date('2008-04-10') AND sd.stock_data.`date` <= date('2022-11-11') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2008-4-10\" ) AND sd.stock_data.`date` == date( \"2022-11-11\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001852273941040039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2008-4-10\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-11-11\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015795230865478516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-11\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2008-4-10\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015664100646972656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2008-4-10\" ) AND sd.stock_data.`date` == date( \"2022-11-11\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001501321792602539], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-11-11\" ) AND sd.stock_data.`date` == date( \"2008-4-10\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0014233589172363281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-11\" ) AND sd.stock_data.`date` == date( \"2008-4-10\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0014803409576416016]]}, {"query": "浪莎股份股票1996年9月21日到2021年8月20日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浪莎股份' AND sd.stock_data.`date` >= date('1996-09-21') AND sd.stock_data.`date` <= date('2021-08-20') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"1996-9-21\" ) AND sd.stock_data.`date` == date( \"2021-8-20\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0020592212677001953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-9-21\" ) AND sd.stock_data.`date` == date( \"2021-8-20\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0019593238830566406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-9-21\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-8-20\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0017240047454833984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-8-20\" ) AND sd.stock_data.`date` == date( \"1996-9-21\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0017974376678466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-20\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"1996-9-21\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.001495361328125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-20\" ) AND sd.stock_data.`date` == date( \"1996-9-21\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0016169548034667969]]}, {"query": "浪莎股份股票1996年9月21日到2021年8月20日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浪莎股份' AND sd.stock_data.`date` >= date('1996-09-21') AND sd.stock_data.`date` <= date('2021-08-20') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-9-21\" ) AND sd.stock_data.`date` == date( \"2021-8-20\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.002369403839111328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-20\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"1996-9-21\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0021762847900390625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-9-21\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-8-20\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001982450485229492], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"1996-9-21\" ) AND sd.stock_data.`date` == date( \"2021-8-20\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015866756439208984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-20\" ) AND sd.stock_data.`date` == date( \"1996-9-21\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015621185302734375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-8-20\" ) AND sd.stock_data.`date` == date( \"1996-9-21\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015561580657958984]]}, {"query": "1996年9月21日到2021年8月20日的浪莎股份股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浪莎股份' AND sd.stock_data.`date` >= date('1996-09-21') AND sd.stock_data.`date` <= date('2021-08-20') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"1996-9-21\" ) AND sd.stock_data.`date` == date( \"2021-8-20\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0017154216766357422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-9-21\" ) AND sd.stock_data.`date` == date( \"2021-8-20\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0015645027160644531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-9-21\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-8-20\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0015075206756591797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-8-20\" ) AND sd.stock_data.`date` == date( \"1996-9-21\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0015721321105957031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-20\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"1996-9-21\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.001439809799194336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-8-20\" ) AND sd.stock_data.`date` == date( \"1996-9-21\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.001435995101928711]]}, {"query": "豫园股份股票2019年2月9日到2020年5月22日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '豫园股份' AND sd.stock_data.`date` >= date('2019-02-09') AND sd.stock_data.`date` <= date('2020-05-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-2-9\" ) AND sd.stock_data.`date` == date( \"2020-5-22\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0018477439880371094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-22\" ) AND sd.stock_data.`date` == date( \"2019-2-9\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016291141510009766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2020-5-22\" ) AND sd.stock_data.`date` == date( \"2019-2-9\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016865730285644531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-22\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-2-9\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0013518333435058594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-2-9\" ) AND sd.stock_data.`date` == date( \"2020-5-22\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0014185905456542969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-2-9\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2020-5-22\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001453399658203125]]}, {"query": "2019年2月9日到2020年5月22日的豫园股份股票的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '豫园股份' AND sd.stock_data.`date` >= date('2019-02-09') AND sd.stock_data.`date` <= date('2020-05-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-2-9\" ) AND sd.stock_data.`date` == date( \"2020-5-22\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019402503967285156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-22\" ) AND sd.stock_data.`date` == date( \"2019-2-9\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015940666198730469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2020-5-22\" ) AND sd.stock_data.`date` == date( \"2019-2-9\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015404224395751953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-22\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-2-9\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017299652099609375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-2-9\" ) AND sd.stock_data.`date` == date( \"2020-5-22\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019011497497558594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-2-9\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2020-5-22\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016865730285644531]]}, {"query": "豫园股份股票2019年2月9日到2020年5月22日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '豫园股份' AND sd.stock_data.`date` >= date('2019-02-09') AND sd.stock_data.`date` <= date('2020-05-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-2-9\" ) AND sd.stock_data.`date` == date( \"2020-5-22\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018463134765625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2020-5-22\" ) AND sd.stock_data.`date` == date( \"2019-2-9\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017170906066894531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-2-9\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2020-5-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015578269958496094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-2-9\" ) AND sd.stock_data.`date` == date( \"2020-5-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015254020690917969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-22\" ) AND sd.stock_data.`date` == date( \"2019-2-9\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001516580581665039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-5-22\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-2-9\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015704631805419922]]}, {"query": "中直股份近19日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中直股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-19 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.3387613296508789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006861686706542969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005626678466796875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0028295516967773438]]}, {"query": "中直股份近19日的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中直股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-19 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.000598907470703125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0036869049072265625], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.35044169425964355], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-10-19\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0007479190826416016]]}, {"query": "科达制造上市公司近14日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '科达制造' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-14 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"制造\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020983219146728516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制造\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019333362579345703]]}, {"query": "科达制造上市公司近14日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '科达制造' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-14 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制造\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0018625259399414062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"制造\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015816688537597656]]}, {"query": "近46日宝钢股份上市公司的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宝钢股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-46 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝钢股份\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017518997192382812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016599655151367188]]}, {"query": "宝钢股份上市公司近46日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宝钢股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-46 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝钢股份\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016564369201660156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0170285701751709]]}, {"query": "宝钢股份上市公司近46日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '宝钢股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-46 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01539468765258789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝钢股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.016442298889160156]]}, {"query": "赣粤高速股票近12日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '赣粤高速' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-12 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"赣粤高速\" \nRETURN s.stock\nLIMIT 50", 0, 0.015354633331298828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"赣粤高速\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015336990356445312]]}, {"query": "近12日赣粤高速股票的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '赣粤高速' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-12 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"赣粤高速\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01719069480895996], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"赣粤高速\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016015052795410156]]}, {"query": "赣粤高速股票近12日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '赣粤高速' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-12 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"赣粤高速\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016532182693481445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"赣粤高速\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016198396682739258]]}, {"query": "亿利洁能股票2020年12月25日前6日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '亿利洁能' AND sd.stock_data.`date` <= date('2020-12-25') AND sd.stock_data.`date` > date('2020-12-25')-6 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.002229928970336914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019774436950683594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017521381378173828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001650094985961914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016770362854003906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016613006591796875]]}, {"query": "亿利洁能股票2020年12月25日前6日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '亿利洁能' AND sd.stock_data.`date` <= date('2020-12-25') AND sd.stock_data.`date` > date('2020-12-25')-6 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0028333663940429688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016772747039794922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015997886657714844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN s.stock\nLIMIT 50", 0, 0.0015163421630859375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001583099365234375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN s.stock\nLIMIT 50", 0, 0.001550436019897461]]}, {"query": "亿利洁能股票2020年12月25日前6天的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '亿利洁能' AND sd.stock_data.`date` <= date('2020-12-25') AND sd.stock_data.`date` > date('2020-12-25')-6 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017843246459960938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016298294067382812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.00152587890625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015044212341308594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001489877700805664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001506805419921875]]}, {"query": "2020年12月25日前6日的亿利洁能股票的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '亿利洁能' AND sd.stock_data.`date` <= date('2020-12-25') AND sd.stock_data.`date` > date('2020-12-25')-6 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019698143005371094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001669168472290039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.00167083740234375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND s.stock.name == \"能股\" AND date('2023-11-11') - sd.stock_data.`date` <= 6 \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0018048286437988281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-12-25\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017142295837402344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 6 AND s.stock.name == \"能股\" AND sd.stock_data.`date` == date( \"2020-12-25\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016102790832519531]]}]