[{"query": "在杭钢股份和一汽富维股票中成交量最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['杭钢股份', '一汽富维'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"杭钢股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.016146183013916016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"杭钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016339778900146484]]}, {"query": "在杭钢股份和一汽富维股票中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['杭钢股份', '一汽富维'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"杭钢股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.016466140747070312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"杭钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017377614974975586]]}, {"query": "在物流服务和信息技术和电信行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '信息技术', '电信'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"电信\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17723941802978516], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"电信\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.19305944442749023], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"技术\" OR indus.industry.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17888736724853516], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17552685737609863], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"电信\" ) AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.1783313751220703], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"技术\" OR indus.industry.name == \"电信\" ) AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17089366912841797]]}, {"query": "在南京银行和鲁信创投中开盘价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['南京银行', '鲁信创投'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0023543834686279297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0018506050109863281]]}, {"query": "在南京银行和鲁信创投中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['南京银行', '鲁信创投'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0019593238830566406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0017251968383789062]]}, {"query": "在汽车制造和污水处理中最高价最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车制造', '污水处理'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0017609596252441406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016019344329833984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001583099365234375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.00164031982421875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0015175342559814453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND t.trade.name == \"水处理\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0015082359313964844]]}, {"query": "哪个是在酒店和度假村和酒精饮料中最高价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['酒店和度假村', '酒精饮料'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" AND t.trade.name == \"饮料\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016138553619384766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001546621322631836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0014758110046386719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001512289047241211], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" AND t.trade.name == \"酒店\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0014882087707519531], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001455545425415039]]}, {"query": "在东方通信和退市中天和工业富联上市公司中收盘价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['东方通信', '退市中天', '工业富联'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方通信\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.018657445907592773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方通信\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.01901698112487793]]}, {"query": "哪个是在东方通信和退市中天和工业富联上市公司中收盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['东方通信', '退市中天', '工业富联'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方通信\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.016582727432250977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方通信\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.016283512115478516]]}, {"query": "在东方通信和退市中天和工业富联上市公司中收盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['东方通信', '退市中天', '工业富联'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方通信\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.01677250862121582], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方通信\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.01696324348449707]]}, {"query": "在能源和电视和广播和电信设备中最低价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['能源', '电视和广播', '电信设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" AND indus.industry.name == \"能源\" \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.019742727279663086], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电信\" \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.020613908767700195], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"能源\" AND indus.industry.name == \"电信\" \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.019533157348632812], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND indus.industry.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.019495248794555664], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"能源\" \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.01829218864440918], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"能源\" AND indus.industry.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.01891160011291504]]}, {"query": "在宁波联合和康缘药业中最低价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['宁波联合', '康缘药业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"宁波联合\" OR s.stock.name == \"康缘药业\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020282268524169922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"宁波联合\" OR s.stock.name == \"康缘药业\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021767377853393555]]}, {"query": "在宁波联合和康缘药业中最低价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['宁波联合', '康缘药业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"宁波联合\" OR s.stock.name == \"康缘药业\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020457983016967773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"宁波联合\" OR s.stock.name == \"康缘药业\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.020979881286621094]]}, {"query": "在船舶和海运和信息技术和航空航天中涨跌幅最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['船舶和海运', '信息技术', '航空航天'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"航空航天\" ) AND t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0018918514251708984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"航空航天\" ) AND t.trade.name == \"船舶\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.00543665885925293], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"航空航天\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0017268657684326172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"航空航天\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0016710758209228516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"航空航天\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.001650094985961914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"航空航天\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0014977455139160156]]}, {"query": "在五矿发展和鄂尔多斯和广誉远上市公司中涨跌幅最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['五矿发展', '鄂尔多斯', '广誉远'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"发展\" OR s.stock.name == \"鄂尔多斯\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.01927804946899414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"发展\" OR s.stock.name == \"鄂尔多斯\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.017510414123535156]]}, {"query": "在五矿发展和鄂尔多斯和广誉远上市公司中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['五矿发展', '鄂尔多斯', '广誉远'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"发展\" OR s.stock.name == \"鄂尔多斯\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.018964529037475586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"发展\" OR s.stock.name == \"鄂尔多斯\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.01965808868408203]]}, {"query": "哪个是在亚通股份和中直股份和万华化股票中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['亚通股份', '中直股份', '万华化'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"亚通股份\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.002268552780151367], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"亚通股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.019071578979492188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"亚通股份\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0019512176513671875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"亚通股份\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01778721809387207], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"亚通股份\" AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.016498088836669922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"亚通股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.001894235610961914]]}, {"query": "在汽车制造和家庭和个人用品行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车制造', '家庭和个人用品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.006591081619262695], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.008759737014770508]]}, {"query": "哪个是在汽车制造和家庭和个人用品行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车制造', '家庭和个人用品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.007222175598144531], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.007319450378417969]]}, {"query": "在汽车制造和家庭和个人用品行业中涨跌幅最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车制造', '家庭和个人用品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0069658756256103516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.007154703140258789]]}, {"query": "在金地集团和中新集团和林洋能源中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['金地集团', '中新集团', '林洋能源'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" AND s.stock.name == \"金地集团\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0018770694732666016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金地集团\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0188295841217041], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金地集团\" AND s.stock.name == \"能源\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0157315731048584], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金地集团\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0017919540405273438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"金地集团\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.001575469970703125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金地集团\" AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.016118764877319336]]}, {"query": "哪个是在弘业股份和大商股份中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['弘业股份', '大商股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"弘业股份\" OR s.stock.name == \"大商股份\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.03157854080200195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"弘业股份\" OR s.stock.name == \"大商股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.03035593032836914]]}, {"query": "在弘业股份和大商股份中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['弘业股份', '大商股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"弘业股份\" OR s.stock.name == \"大商股份\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.024660110473632812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"弘业股份\" OR s.stock.name == \"大商股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.024051427841186523]]}, {"query": "哪个是在电脑硬件和船舶和海运行业中收盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电脑硬件', '船舶和海运'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0024514198303222656], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017385482788085938]]}, {"query": "在电脑硬件和船舶和海运行业中收盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电脑硬件', '船舶和海运'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016465187072753906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016484260559082031]]}, {"query": "在酒店和度假村和信息技术行业中最低价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['酒店和度假村', '信息技术'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.002048492431640625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017619132995605469], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001630544662475586], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018684864044189453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016613006591796875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016007423400878906]]}, {"query": "哪个是在酒店和度假村和信息技术行业中最低价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['酒店和度假村', '信息技术'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.004830837249755859], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015521049499511719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016782283782958984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021216869354248047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016508102416992188], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"技术\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0015475749969482422]]}]