[{"query": "哪个是在食品和饮料和家庭和个人用品和旅游和酒店行业中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['食品和饮料', '家庭和个人用品', '旅游和酒店'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006621837615966797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0077228546142578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007967472076416016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0066182613372802734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007335662841796875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0076291561126708984]]}, {"query": "在食品和饮料和家庭和个人用品和旅游和酒店行业中最高价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['食品和饮料', '家庭和个人用品', '旅游和酒店'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0057621002197265625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006584644317626953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005421638488769531], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006356477737426758], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.007614612579345703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00523686408996582]]}, {"query": "在食品和饮料和家庭和个人用品和旅游和酒店行业中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['食品和饮料', '家庭和个人用品', '旅游和酒店'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00571131706237793], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005061626434326172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005356311798095703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005168914794921875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005629062652587891], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00536346435546875]]}, {"query": "在日照港和江苏阳光上市公司中收盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['日照港', '江苏阳光'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏阳光\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018127918243408203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"江苏阳光\" \nRETURN s.stock\nLIMIT 50", 0, 0.017637252807617188]]}, {"query": "哪个是在日照港和江苏阳光上市公司中收盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['日照港', '江苏阳光'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏阳光\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018118619918823242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"江苏阳光\" \nRETURN s.stock\nLIMIT 50", 0, 0.016411304473876953]]}, {"query": "哪个是在原材料和汽车中最低价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['原材料', '汽车'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.018505573272705078], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018355607986450195]]}, {"query": "在原材料和汽车中最低价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['原材料', '汽车'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.018555879592895508], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018777132034301758]]}, {"query": "在百联股份和外运发展和轻纺城股票中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['百联股份', '外运发展', '轻纺城'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"外运发展\" ) \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.018350601196289062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"外运发展\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.021001577377319336]]}, {"query": "在媒体和娱乐和零售中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['媒体和娱乐', '零售'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.18018198013305664], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17647385597229004]]}, {"query": "在同济科技和联创光电和恒顺醋业上市公司中成交量最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['同济科技', '联创光电', '恒顺醋业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"同济科技\" OR s.stock.name == \"联创光电\" ) \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.024947404861450195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"同济科技\" OR s.stock.name == \"联创光电\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01957535743713379]]}, {"query": "在厦门国贸和北大荒和宁夏建材上市公司中最高价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['厦门国贸', '北大荒', '宁夏建材'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"厦门国贸\" OR s.stock.name == \"北大荒\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.025192975997924805], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"厦门国贸\" OR s.stock.name == \"北大荒\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019745349884033203]]}, {"query": "哪个是在厦门国贸和北大荒和宁夏建材上市公司中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['厦门国贸', '北大荒', '宁夏建材'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"厦门国贸\" OR s.stock.name == \"北大荒\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01948714256286621], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"厦门国贸\" OR s.stock.name == \"北大荒\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019940614700317383]]}, {"query": "在厦门国贸和北大荒和宁夏建材上市公司中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['厦门国贸', '北大荒', '宁夏建材'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"厦门国贸\" OR s.stock.name == \"北大荒\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018743276596069336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"厦门国贸\" OR s.stock.name == \"北大荒\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019026517868041992]]}, {"query": "哪个是在信息技术和船舶和海运和医疗保健设施中最低价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['信息技术', '船舶和海运', '医疗保健设施'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.001993417739868164], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019462108612060547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0017211437225341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001753091812133789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016987323760986328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014617443084716797]]}, {"query": "在信息技术和船舶和海运和医疗保健设施中最低价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['信息技术', '船舶和海运', '医疗保健设施'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016434192657470703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014438629150390625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0014731884002685547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0015540122985839844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015032291412353516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"船舶\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014255046844482422]]}, {"query": "哪个是在中国北车和盛屯矿业股票中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中国北车', '盛屯矿业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"矿业\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0017628669738769531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"矿业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0015091896057128906]]}, {"query": "在中国北车和盛屯矿业股票中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中国北车', '盛屯矿业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"矿业\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0018799304962158203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"矿业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0016884803771972656]]}, {"query": "在中国北车和盛屯矿业股票中成交量最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中国北车', '盛屯矿业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"矿业\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.001718759536743164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"矿业\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0017178058624267578]]}, {"query": "在信息技术和银行和珠宝和宝石中最低价最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['信息技术', '银行', '珠宝和宝石'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND s.stock.name == \"宝石\" AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"银行\" ) \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0018954277038574219], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE s.stock.name == \"宝石\" AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"银行\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001760721206665039], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"银行\" ) AND s.stock.name == \"宝石\" \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001791238784790039], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE s.stock.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"银行\" ) \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0019538402557373047], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"技术\" OR indus.industry.name == \"银行\" ) AND td.trade_data.`date` == date('2023-11-11') AND s.stock.name == \"宝石\" \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0017940998077392578], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"技术\" OR indus.industry.name == \"银行\" ) AND s.stock.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0018165111541748047]]}, {"query": "在信息技术和农业和酒精饮料中收盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['信息技术', '农业', '酒精饮料'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"农业\" ) \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0017447471618652344], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"技术\" OR indus.industry.name == \"农业\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0016846656799316406], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"农业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0018086433410644531], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"农业\" ) AND t.trade.name == \"饮料\" \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0016608238220214844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"农业\" ) \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0018482208251953125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"技术\" OR indus.industry.name == \"农业\" ) AND t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0016872882843017578]]}, {"query": "在化妆品和公用事业中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['化妆品', '公用事业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019114255905151367], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.01766800880432129]]}, {"query": "哪个是在化妆品和公用事业中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['化妆品', '公用事业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019196748733520508], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.01752018928527832]]}, {"query": "在上海机场和大秦铁路和中直股份中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['上海机场', '大秦铁路', '中直股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.016774654388427734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017052173614501953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002055644989013672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0156400203704834], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.001821756362915039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.001661539077758789]]}, {"query": "哪个是在上海机场和大秦铁路和中直股份中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['上海机场', '大秦铁路', '中直股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.01605534553527832], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017247438430786133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002014636993408203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.017852306365966797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018436908721923828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.001730203628540039]]}, {"query": "在上海机场和大秦铁路和中直股份中最高价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['上海机场', '大秦铁路', '中直股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.015572547912597656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01585102081298828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016443729400634766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海机场\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.015451431274414062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.001768350601196289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海机场\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016326904296875]]}, {"query": "在信息技术和房地产和石油和天然气行业中最高价最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['信息技术', '房地产', '石油和天然气'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"技术\" OR indus.industry.name == \"房地产\" ) \nRETURN s.stock, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.17068719863891602], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"技术\" OR indus.industry.name == \"房地产\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.1927356719970703]]}]