[{"query": "2022年7月26日汽车零部件行业的最高价和开盘价和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2022-07-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date( \"2022-7-26\" ) \nRETURN td.trade_data.opening_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.017747163772583008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-26\" ) AND t.trade.name == \"汽车\" \nRETURN td.trade_data.opening_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.018321514129638672]]}, {"query": "2023年5月9日物流服务的开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-05-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-5-9\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.008243560791015625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-9\" ) AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.006642341613769531]]}, {"query": "2023年5月9日的物流服务的开盘价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-05-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-9\" ) AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006754159927368164], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-5-9\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0060443878173828125]]}, {"query": "物流服务的开盘价和更新时间在2023年5月9日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-05-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-9\" ) AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006139516830444336], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-5-9\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008235692977905273]]}, {"query": "2023年5月9日的物流服务的开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2023-05-09') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-5-9\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.006535768508911133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-9\" ) AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0063855648040771484]]}, {"query": "2020年2月14日航空公司的最高价和最低价和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` == date('2020-02-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.minimum_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-2-14\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.002256631851196289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2020-2-14\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.0018162727355957031]]}, {"query": "航空公司的最高价和最低价和收盘价在2020年2月14日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` == date('2020-02-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.minimum_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2020-2-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0021178722381591797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-2-14\" ) AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018019676208496094]]}, {"query": "2020年2月14日的航空公司的最高价和最低价和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` == date('2020-02-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.minimum_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-2-14\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.0020668506622314453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2020-2-14\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.0018732547760009766]]}, {"query": "纺织品和服装行业的更新时间和最高价和涨跌幅在2022年7月29日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` == date('2022-07-29') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-29\" ) AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017485618591308594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-7-29\" ) AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016586780548095703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-7-29\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015077590942382812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-7-29\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015187263488769531], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-29\" ) AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014531612396240234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-7-29\" ) AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014505386352539062]]}, {"query": "运输和物流行业的收盘价和开盘价在2023年5月20日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-05-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-20\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012050628662109375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2023-5-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007855653762817383]]}, {"query": "2023年5月20日的运输和物流行业的收盘价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-05-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2023-5-20\" ) \nRETURN td.trade_data.closing_price,td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0005133152008056641], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-20\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN td.trade_data.closing_price,td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0003750324249267578]]}, {"query": "2023年5月20日的运输和物流行业的收盘价和开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2023-05-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-5-20\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006524324417114258], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2023-5-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0057506561279296875]]}, {"query": "旅游和酒店的更新时间和最高价在2021年7月11日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2021-07-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date( \"2021-7-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0074198246002197266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-7-11\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005709409713745117]]}, {"query": "2021年7月11日旅游和酒店的更新时间和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2021-07-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-7-11\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN td.trade_data.`date`,td.trade_data.maximum_price,m.name\nLIMIT 50", 0, 0.0004737377166748047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date( \"2021-7-11\" ) \nRETURN td.trade_data.`date`,td.trade_data.maximum_price,m.name\nLIMIT 50", 0, 0.0005068778991699219]]}, {"query": "2021年7月11日的旅游和酒店的更新时间和最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2021-07-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date( \"2021-7-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006580829620361328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-7-11\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005732536315917969]]}, {"query": "2021年7月11日的旅游和酒店的更新时间和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2021-07-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-7-11\" ) AND ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) \nRETURN td.trade_data.`date`,td.trade_data.maximum_price,m.name\nLIMIT 50", 0, 0.0004417896270751953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"旅游\" OR t.trade.name == \"酒店\" ) AND td.trade_data.`date` == date( \"2021-7-11\" ) \nRETURN td.trade_data.`date`,td.trade_data.maximum_price,m.name\nLIMIT 50", 0, 0.00037670135498046875]]}, {"query": "东方明珠的开盘价和更新时间和成交量在2020年4月11日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东方明珠' AND sd.stock_data.`date` == date('2020-04-11') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-11\" ) AND s.stock.name == \"东方明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.028640031814575195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方明珠\" AND sd.stock_data.`date` == date( \"2020-4-11\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02851247787475586]]}, {"query": "2020年4月11日的东方明珠的开盘价和更新时间和成交量的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '东方明珠' AND sd.stock_data.`date` == date('2020-04-11') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-11\" ) AND s.stock.name == \"东方明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.028528928756713867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方明珠\" AND sd.stock_data.`date` == date( \"2020-4-11\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.03063058853149414]]}, {"query": "2022年9月14日电子设备行业的最低价和开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2022-09-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2022-9-14\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.002277374267578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-14\" ) AND t.trade.name == \"电子\" \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.002073049545288086]]}, {"query": "2022年9月14日的电子设备行业的最低价和开盘价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2022-09-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2022-9-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002001523971557617], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-14\" ) AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017094612121582031]]}, {"query": "2022年9月14日的电子设备行业的最低价和开盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2022-09-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2022-9-14\" ) \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0019419193267822266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-14\" ) AND t.trade.name == \"电子\" \nRETURN td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.00177001953125]]}, {"query": "电子设备行业的最低价和开盘价和更新时间在2022年9月14日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2022-09-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2022-9-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018551349639892578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-14\" ) AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.00159454345703125]]}, {"query": "农业行业的涨跌幅在2021年4月2日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农业' AND td.trade_data.`date` == date('2021-04-02') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"农业\" AND td.trade_data.`date` == date( \"2021-4-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.033667564392089844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-4-2\" ) AND indus.industry.name == \"农业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0347900390625]]}, {"query": "2021年8月14日的酒精饮料的更新时间和开盘价和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` == date('2021-08-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-14\" ) AND t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.002115011215209961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2021-8-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018470287322998047]]}, {"query": "2021年8月14日的酒精饮料的更新时间和开盘价和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` == date('2021-08-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2021-8-14\" ) \nRETURN td.trade_data.opening_price,td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0019369125366210938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-14\" ) AND t.trade.name == \"饮料\" \nRETURN td.trade_data.opening_price,td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.002004861831665039]]}, {"query": "酒精饮料的更新时间和开盘价和最低价在2021年8月14日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` == date('2021-08-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-14\" ) AND t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017325878143310547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date( \"2021-8-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015897750854492188]]}, {"query": "2022年3月20日的电力工具和设备的开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` == date('2022-03-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2022-3-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.02017974853515625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-20\" ) AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.019260644912719727]]}, {"query": "2022年3月20日电力工具和设备的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` == date('2022-03-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2022-3-20\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.01787590980529785], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-20\" ) AND t.trade.name == \"电力\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.01720881462097168]]}, {"query": "电力工具和设备的开盘价在2022年3月20日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` == date('2022-03-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2022-3-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01749396324157715], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-20\" ) AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.016427278518676758]]}, {"query": "2022年11月4日的民生银行上市公司的更新时间和最高价和收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '民生银行' AND sd.stock_data.`date` == date('2022-11-04') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.maximum_price, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"民生银行\" AND sd.stock_data.`date` == date( \"2022-11-4\" ) \nRETURN sd.stock_data.maximum_price,sd.stock_data.closing_price\nLIMIT 50", 1, 0.01909494400024414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-4\" ) AND s.stock.name == \"民生银行\" \nRETURN sd.stock_data.maximum_price,sd.stock_data.closing_price\nLIMIT 50", 1, 0.017207622528076172]]}, {"query": "2022年11月4日的民生银行上市公司的更新时间和最高价和收盘价的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '民生银行' AND sd.stock_data.`date` == date('2022-11-04') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.maximum_price, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"民生银行\" AND sd.stock_data.`date` == date( \"2022-11-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01704263687133789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-4\" ) AND s.stock.name == \"民生银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.01600503921508789]]}, {"query": "民生银行上市公司的更新时间和最高价和收盘价在2022年11月4日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '民生银行' AND sd.stock_data.`date` == date('2022-11-04') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.maximum_price, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"民生银行\" AND sd.stock_data.`date` == date( \"2022-11-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017891645431518555], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-4\" ) AND s.stock.name == \"民生银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.016778230667114258]]}, {"query": "2022年11月4日民生银行上市公司的更新时间和最高价和收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '民生银行' AND sd.stock_data.`date` == date('2022-11-04') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.maximum_price, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"民生银行\" AND sd.stock_data.`date` == date( \"2022-11-4\" ) \nRETURN sd.stock_data.maximum_price,sd.stock_data.closing_price\nLIMIT 50", 1, 0.017710208892822266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-11-4\" ) AND s.stock.name == \"民生银行\" \nRETURN sd.stock_data.maximum_price,sd.stock_data.closing_price\nLIMIT 50", 1, 0.017578125]]}, {"query": "淮河能源的涨跌幅和最高价和成交量在2021年4月7日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '淮河能源' AND sd.stock_data.`date` == date('2021-04-07') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.maximum_price, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-4-7\" ) AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0023856163024902344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2021-4-7\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0019409656524658203]]}, {"query": "2023年2月25日的医疗设备行业的开盘价和最低价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` == date('2023-02-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-2-25\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.002030611038208008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2023-2-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019745826721191406]]}, {"query": "2023年2月25日医疗设备行业的开盘价和最低价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` == date('2023-02-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2023-2-25\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0021505355834960938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-2-25\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0018658638000488281]]}, {"query": "2023年2月25日的医疗设备行业的开盘价和最低价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` == date('2023-02-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2023-2-25\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0020020008087158203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-2-25\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0019469261169433594]]}, {"query": "医疗设备行业的开盘价和最低价和更新时间在2023年2月25日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗设备' AND td.trade_data.`date` == date('2023-02-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-2-25\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021436214447021484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2023-2-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018124580383300781]]}, {"query": "物流服务的最低价和更新时间和涨跌幅在2022年4月21日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` == date('2022-04-21') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-21\" ) AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006162881851196289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-4-21\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005970478057861328]]}, {"query": "2023年10月5日的金融服务行业的更新时间和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-10-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-5\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0075206756591796875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-10-5\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006135463714599609]]}]