[{"query": "2023年3月12日的电视和广播的涨跌幅和开盘价和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-03-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.opening_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-12\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0007989406585693359], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-12\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-12\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01463770866394043], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-12\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01600790023803711], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-12\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006163120269775391]]}, {"query": "家居用品行业的最高价和收盘价和涨跌幅在2022年3月2日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` == date('2022-03-02') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.closing_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-3-2\" ) AND t.trade.name == \"家居\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019826889038085938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2022-3-2\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017819404602050781]]}, {"query": "2021年1月12日的电子设备行业的更新时间和最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2021-01-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2021-1-12\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.0020284652709960938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-12\" ) AND t.trade.name == \"电子\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.001990795135498047]]}, {"query": "2021年1月12日电子设备行业的更新时间和最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2021-01-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2021-1-12\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.0021779537200927734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-12\" ) AND t.trade.name == \"电子\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.0018169879913330078]]}, {"query": "电子设备行业的更新时间和最高价和开盘价在2021年1月12日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2021-01-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2021-1-12\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018241405487060547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-1-12\" ) AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016124248504638672]]}, {"query": "2021年9月14日珠宝和宝石行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2021-09-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2021-9-14\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0020856857299804688], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-9-14\" ) AND t.trade.name == \"宝石\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0017809867858886719]]}, {"query": "2021年9月14日的珠宝和宝石行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2021-09-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2021-9-14\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0018572807312011719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-9-14\" ) AND t.trade.name == \"宝石\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0016620159149169922]]}, {"query": "污水处理的涨跌幅和开盘价和收盘价在2022年11月25日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2022-11-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.opening_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-11-25\" ) AND t.trade.name == \"水处理\" \nRETURN t.trade\nLIMIT 50", 0, 0.002023458480834961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date( \"2022-11-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018405914306640625]]}, {"query": "2020年1月20日钢铁行业的收盘价和最低价和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '钢铁' AND td.trade_data.`date` == date('2020-01-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.minimum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-20\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04992508888244629], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-20\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.000705718994140625], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-20\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-20\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005328655242919922], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-20\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-20\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-20\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04612159729003906]]}, {"query": "农业行业的最低价和最高价在2022年7月24日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农业' AND td.trade_data.`date` == date('2022-07-24') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"农业\" AND td.trade_data.`date` == date( \"2022-7-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.03526449203491211], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-24\" ) AND indus.industry.name == \"农业\" \nRETURN s.stock\nLIMIT 50", 0, 0.031777381896972656]]}, {"query": "2022年7月24日的农业行业的最低价和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '农业' AND td.trade_data.`date` == date('2022-07-24') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-24\" ) AND indus.industry.name == \"农业\" \nRETURN td.trade_data.minimum_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.03446483612060547], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"农业\" AND td.trade_data.`date` == date( \"2022-7-24\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.03374528884887695]]}, {"query": "2022年5月24日的金属和矿业行业的最低价和开盘价和最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` == date('2022-05-24') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date( \"2022-5-24\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.009460210800170898], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-24\" ) AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00770115852355957]]}, {"query": "2022年5月24日金属和矿业行业的最低价和开盘价和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` == date('2022-05-24') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-24\" ) AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price,m.name,td.trade_data.minimum_price\nLIMIT 50", 0, 0.0006389617919921875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date( \"2022-5-24\" ) \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price,m.name,td.trade_data.minimum_price\nLIMIT 50", 0, 0.00043892860412597656]]}, {"query": "家居用品行业的最低价和开盘价和涨跌幅在2019年12月11日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '家居用品' AND td.trade_data.`date` == date('2019-12-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date( \"2019-12-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002260923385620117], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-12-11\" ) AND t.trade.name == \"家居\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019278526306152344]]}, {"query": "南宁百货上市公司的更新时间和收盘价和涨跌幅在2021年9月10日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '南宁百货' AND sd.stock_data.`date` == date('2021-09-10') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.closing_price, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南宁百货\" AND sd.stock_data.`date` == date( \"2021-9-10\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017486095428466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-10\" ) AND s.stock.name == \"南宁百货\" \nRETURN s.stock\nLIMIT 50", 0, 0.019841909408569336]]}, {"query": "2020年4月25日的广州港上市公司的收盘价和涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广州港' AND sd.stock_data.`date` == date('2020-04-25') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-25\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-25\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-25\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.043961524963378906], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-25\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-25\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0007414817810058594], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-25\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0459904670715332], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-25\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0007243156433105469]]}, {"query": "2023年3月18日中国联通上市公司的开盘价和成交量和最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国联通' AND sd.stock_data.`date` == date('2023-03-18') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.volume, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中国联通\" AND sd.stock_data.`date` == date( \"2023-3-18\" ) \nRETURN sd.stock_data.volume,sd.stock_data.minimum_price\nLIMIT 50", 1, 0.017654895782470703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-3-18\" ) AND s.stock.name == \"中国联通\" \nRETURN sd.stock_data.volume,sd.stock_data.minimum_price\nLIMIT 50", 1, 0.016796588897705078]]}, {"query": "2023年3月18日的中国联通上市公司的开盘价和成交量和最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国联通' AND sd.stock_data.`date` == date('2023-03-18') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.volume, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中国联通\" AND sd.stock_data.`date` == date( \"2023-3-18\" ) \nRETURN sd.stock_data.volume,sd.stock_data.minimum_price\nLIMIT 50", 1, 0.019940853118896484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-3-18\" ) AND s.stock.name == \"中国联通\" \nRETURN sd.stock_data.volume,sd.stock_data.minimum_price\nLIMIT 50", 1, 0.01765608787536621]]}, {"query": "2022年10月1日友好集团股票的成交量和更新时间和收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '友好集团' AND sd.stock_data.`date` == date('2022-10-01') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"友好集团\" AND sd.stock_data.`date` == date( \"2022-10-1\" ) \nRETURN sd.stock_data.`date`,sd.stock_data.closing_price\nLIMIT 50", 1, 0.01715254783630371], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-1\" ) AND s.stock.name == \"友好集团\" \nRETURN sd.stock_data.`date`,sd.stock_data.closing_price\nLIMIT 50", 1, 0.01912689208984375]]}, {"query": "2022年10月1日的友好集团股票的成交量和更新时间和收盘价的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '友好集团' AND sd.stock_data.`date` == date('2022-10-01') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-1\" ) AND s.stock.name == \"友好集团\" \nRETURN s.stock\nLIMIT 50", 0, 0.017308950424194336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"友好集团\" AND sd.stock_data.`date` == date( \"2022-10-1\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017772674560546875]]}, {"query": "2022年10月1日的友好集团股票的成交量和更新时间和收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '友好集团' AND sd.stock_data.`date` == date('2022-10-01') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"友好集团\" AND sd.stock_data.`date` == date( \"2022-10-1\" ) \nRETURN sd.stock_data.`date`,sd.stock_data.closing_price\nLIMIT 50", 1, 0.017045021057128906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-1\" ) AND s.stock.name == \"友好集团\" \nRETURN sd.stock_data.`date`,sd.stock_data.closing_price\nLIMIT 50", 1, 0.018019914627075195]]}, {"query": "友好集团股票的成交量和更新时间和收盘价在2022年10月1日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '友好集团' AND sd.stock_data.`date` == date('2022-10-01') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-1\" ) AND s.stock.name == \"友好集团\" \nRETURN s.stock\nLIMIT 50", 0, 0.0177462100982666], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"友好集团\" AND sd.stock_data.`date` == date( \"2022-10-1\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01781296730041504]]}, {"query": "2023年8月6日原材料的最低价和更新时间和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2023-08-06') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005900859832763672], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.015481948852539062], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013685941696166992], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.000553131103515625]]}, {"query": "2023年8月6日的原材料的最低价和更新时间和涨跌幅的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2023-08-06') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005152225494384766], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01312255859375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01402592658996582], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005173683166503906]]}, {"query": "2023年8月6日的原材料的最低价和更新时间和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` == date('2023-08-06') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005781650543212891], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.015284061431884766], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013387680053710938], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-6\" ) AND td.trade_data.`date` == date( \"2000-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005104541778564453]]}, {"query": "娱乐设备行业的开盘价和涨跌幅和最高价在2020年8月20日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2020-08-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.range, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date( \"2020-8-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00186920166015625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-8-20\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017230510711669922]]}, {"query": "建筑材料的最高价在2020年9月19日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2020-09-19') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-19\" ) AND t.trade.name == \"建筑\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021669864654541016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND td.trade_data.`date` == date( \"2020-9-19\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018925666809082031]]}, {"query": "2020年9月19日的建筑材料的最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2020-09-19') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-19\" ) AND t.trade.name == \"建筑\" \nRETURN t.trade\nLIMIT 50", 0, 0.002019166946411133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND td.trade_data.`date` == date( \"2020-9-19\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017251968383789062]]}, {"query": "2020年9月19日建筑材料的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2020-09-19') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-19\" ) AND t.trade.name == \"建筑\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018489360809326172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND td.trade_data.`date` == date( \"2020-9-19\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.001814126968383789]]}, {"query": "医疗保健行业的涨跌幅和收盘价和最高价在2022年12月28日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2022-12-28') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.closing_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-12-28\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018529891967773438], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2022-12-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016820430755615234]]}, {"query": "汽车零部件行业的最高价和开盘价和最低价在2022年7月26日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2022-07-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date( \"2022-7-26\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.020767688751220703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-26\" ) AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.01601123809814453]]}]