[{"query": "开盘价大于14的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > 14 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > 14 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.0030717849731445312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price > 14 \nRETURN s.stock.name\nLIMIT 50", 1, 0.002993345260620117]]}, {"query": "哪些股票的开盘价大于14", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price > 14 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price > 14 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.003176450729370117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price > 14 \nRETURN s.stock.name\nLIMIT 50", 1, 0.003681659698486328]]}, {"query": "收盘价小于26的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 26 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.020239591598510742], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 26 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017902612686157227]]}, {"query": "哪些上市公司的收盘价小于26", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 26 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02263045310974121], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 26 \nRETURN s.stock\nLIMIT 50", 0, 0.02279067039489746]]}, {"query": "最低价小于30的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 30 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 30 \nRETURN s.stock\nLIMIT 50", 0, 0.02269148826599121], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 30 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02270054817199707]]}, {"query": "哪些上市公司的最低价小于30", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price < 30 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 30 \nRETURN s.stock\nLIMIT 50", 0, 0.022352218627929688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 30 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.024569272994995117]]}, {"query": "哪些上市公司的开盘价不大于15", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 15 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 15 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023700237274169922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 15 \nRETURN s.stock\nLIMIT 50", 0, 0.022715330123901367]]}, {"query": "最高价大于17的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 17 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 17 \nRETURN s.stock\nLIMIT 50", 0, 0.00400233268737793], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.004492044448852539]]}, {"query": "哪些股票的最高价大于17", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 17 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.003480195999145508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 17 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0035207271575927734]]}, {"query": "涨跌幅不大于31的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 31 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 31 \nRETURN s.stock.name\nLIMIT 50", 1, 0.019804954528808594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.019717931747436523]]}, {"query": "哪些股票的涨跌幅不大于31", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 31 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 31 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017237186431884766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017502784729003906]]}, {"query": "成交量小于50的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 50 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 50 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01795196533203125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 50 \nRETURN s.stock.name\nLIMIT 50", 1, 0.019099950790405273]]}, {"query": "哪些股票的成交量小于50", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 50 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 50 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018602848052978516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 50 \nRETURN s.stock.name\nLIMIT 50", 1, 0.020821571350097656]]}, {"query": "最高价不大于49的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 49 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 49 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006618022918701172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 49 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006031036376953125]]}, {"query": "哪些行业的最高价不大于49", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 49 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 49 \nRETURN t.trade.name\nLIMIT 50", 1, 0.00645136833190918], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 49 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006402730941772461]]}, {"query": "哪些上市公司的收盘价不大于23", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price <= 23 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 23 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023894786834716797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 23 \nRETURN s.stock\nLIMIT 50", 0, 0.023051023483276367]]}, {"query": "最高价小于40的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 40 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 40 \nRETURN s.stock\nLIMIT 50", 0, 0.022971630096435547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 40 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022390365600585938]]}, {"query": "哪些股票的最高价小于40", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 40 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 40 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017509937286376953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 40 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017859935760498047]]}, {"query": "开盘价小于3的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0044078826904296875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.004748106002807617]]}, {"query": "哪些行业的开盘价小于3", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0044176578521728516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0035190582275390625]]}, {"query": "最高价大于1的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > 1 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price > 1 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005959749221801758], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price > 1 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005839347839355469]]}, {"query": "哪些行业的最高价大于1", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > 1 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price > 1 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006434917449951172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price > 1 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006872415542602539]]}, {"query": "开盘价小于20的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 20 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 20 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017369985580444336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 20 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017307281494140625]]}, {"query": "最高价大于12的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 12 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 12 \nRETURN s.stock\nLIMIT 50", 0, 0.0033757686614990234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.003191709518432617]]}, {"query": "哪些上市公司的最高价大于12", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price > 12 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price > 12 \nRETURN s.stock\nLIMIT 50", 0, 0.0034589767456054688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price > 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.003152132034301758]]}, {"query": "涨跌幅小于11的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 11 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 11 \nRETURN s.stock\nLIMIT 50", 0, 0.02208733558654785], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.021959543228149414]]}, {"query": "哪些上市公司的涨跌幅小于11", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 11 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 11 \nRETURN s.stock\nLIMIT 50", 0, 0.021803855895996094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02379441261291504]]}, {"query": "开盘价不大于30的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 30 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 30 \nRETURN t.trade.name\nLIMIT 50", 1, 0.008680582046508789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 30 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006873369216918945]]}, {"query": "哪些行业的开盘价不大于30", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 30 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 30 \nRETURN t.trade.name\nLIMIT 50", 1, 0.008744955062866211], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 30 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00725865364074707]]}, {"query": "最高价不大于46的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 46 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 46 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007044553756713867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 46 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007018566131591797]]}, {"query": "哪些行业的最高价不大于46", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 46 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 46 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006310462951660156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 46 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00658726692199707]]}, {"query": "涨跌幅不大于16的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 16 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 16 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0066242218017578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 16 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006265163421630859]]}, {"query": "哪些行业的涨跌幅不大于16", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 16 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 16 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005997896194458008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 16 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006322383880615234]]}, {"query": "最低价大于17的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > 17 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 17 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0030205249786376953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.0034613609313964844]]}, {"query": "开盘价小于42的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 42 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 42 \nRETURN t.trade.name\nLIMIT 50", 1, 0.008871316909790039], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 42 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00690460205078125]]}, {"query": "哪些行业的开盘价小于42", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 42 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 42 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005811452865600586], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 42 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005991458892822266]]}, {"query": "最高价小于41的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 41 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 41 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0069048404693603516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 41 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0067403316497802734]]}, {"query": "哪些行业的最高价小于41", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price < 41 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price < 41 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.008436918258666992], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price < 41 \nRETURN t.trade.name\nLIMIT 50", 1, 0.009184598922729492]]}, {"query": "涨跌幅不大于36的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 36 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 36 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006723642349243164], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 36 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006529092788696289]]}, {"query": "哪些行业的涨跌幅不大于36", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 36 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 36 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007158994674682617], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 36 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006547689437866211]]}, {"query": "开盘价小于4的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 4 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 4 \nRETURN s.stock\nLIMIT 50", 0, 0.013347387313842773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 4 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.013460397720336914]]}, {"query": "哪些上市公司的开盘价小于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 4 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 4 \nRETURN s.stock\nLIMIT 50", 0, 0.013508081436157227], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 4 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.013062000274658203]]}, {"query": "成交量小于9的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 9 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017656564712524414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 9 \nRETURN s.stock.name\nLIMIT 50", 1, 0.019977092742919922]]}, {"query": "最低价不大于6的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 6 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 6 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01577901840209961], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 6 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.013639688491821289]]}, {"query": "哪些股票的最低价不大于6", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 6 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 6 \nRETURN s.stock.name\nLIMIT 50", 1, 0.013050556182861328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 6 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.011358976364135742]]}, {"query": "涨跌幅小于31的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 31 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 31 \nRETURN s.stock\nLIMIT 50", 0, 0.026934146881103516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02748703956604004]]}, {"query": "哪些股票的涨跌幅小于31", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 31 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 31 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0175931453704834], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 31 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.023159503936767578]]}, {"query": "成交量小于2的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 2 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 2 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.008361577987670898], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 2 \nRETURN s.stock.name\nLIMIT 50", 1, 0.005864143371582031]]}, {"query": "哪些上市公司的成交量小于2", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 2 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 2 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.009168386459350586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 2 \nRETURN s.stock\nLIMIT 50", 0, 0.008839845657348633]]}]