[{"query": "最低价小于43的能源行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.minimum_price < 43 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 43 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002753734588623047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price < 43 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0022704601287841797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.minimum_price < 43 \nRETURN s.stock.name\nLIMIT 50", 0, 0.001997232437133789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 43 AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018644332885742188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 43 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002785921096801758], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.minimum_price < 43 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015654563903808594]]}, {"query": "涨跌幅不大于36的电脑硬件行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电脑硬件' AND sd.stock_data.range <= 36 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 36 \nRETURN s.stock.name\nLIMIT 50", 0, 7.225397348403931], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 36 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.034589767456055], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 36 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.594685792922974], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 36 \nRETURN s.stock.name\nLIMIT 50", 0, 7.049333333969116], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 36 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.972780466079712], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 36 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.60954213142395]]}, {"query": "成交量小于40的航空公司行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '航空公司' AND sd.stock_data.volume < 40 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"航空\" AND sd.stock_data.volume < 40 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.04043316841125488], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 40 AND s.stock.name == \"航空\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.020008325576782227], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 40 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"航空\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.018799543380737305], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 40 AND s.stock.name == \"航空\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.04809451103210449], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"航空\" AND sd.stock_data.volume < 40 \nRETURN s.stock.name\nLIMIT 50", 0, 0.018152236938476562], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"航空\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 40 \nRETURN s.stock.name\nLIMIT 50", 0, 0.019817829132080078]]}, {"query": "涨跌幅小于19的钢铁行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '钢铁' AND sd.stock_data.range < 19 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 19 \nRETURN s.stock\nLIMIT 50", 0, 0.027675390243530273], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 19 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.024353742599487305]]}, {"query": "成交量不小于5的农业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '农业' AND sd.stock_data.volume >= 5 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 5 AND indus.industry.name == \"农业\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0006926059722900391], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume >= 5 AND indus.industry.name == \"农业\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0004229545593261719], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"农业\" AND sd.stock_data.volume >= 5 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.00029540061950683594], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"农业\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 5 \nRETURN s1.stock\nLIMIT 50", 0, 0.0003314018249511719], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"农业\" AND sd.stock_data.volume >= 5 \nRETURN s1.stock\nLIMIT 50", 0, 0.00032448768615722656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume >= 5 AND sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"农业\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0003669261932373047]]}, {"query": "成交量小于43的农产品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '农产品' AND sd.stock_data.volume < 43 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 43 \nRETURN s.stock.name\nLIMIT 50", 0, 0.02267765998840332], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 43 AND s.stock.name == \"农产品\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0192720890045166], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 43 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"农产品\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.01786208152770996], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"农产品\" AND sd.stock_data.volume < 43 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.017486572265625], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"农产品\" AND sd.stock_data.volume < 43 \nRETURN s.stock.name\nLIMIT 50", 0, 0.018407821655273438], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 43 AND s.stock.name == \"农产品\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.01823258399963379]]}, {"query": "最低价小于6的消费品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '消费品' AND sd.stock_data.minimum_price < 6 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price < 6 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 5.5252134799957275], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 6 \nRETURN s.stock.name\nLIMIT 50", 0, 5.433973550796509], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 6 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 5.5108702182769775], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price < 6 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 5.6098034381866455], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 6 \nRETURN s.stock.name\nLIMIT 50", 0, 5.645762920379639], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 6 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 5.72371768951416]]}, {"query": "开盘价小于49的公用事业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.opening_price < 49 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 49 \nRETURN s.stock\nLIMIT 50", 0, 7.154636859893799], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 49 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.102929592132568], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 49 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.970431566238403], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price < 49 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.444629669189453], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 49 \nRETURN s.stock\nLIMIT 50", 0, 7.161720037460327], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price < 49 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 7.443957805633545]]}, {"query": "涨跌幅不大于5的原材料行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '原材料' AND sd.stock_data.range <= 5 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 5 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.575672626495361], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 5 \nRETURN s.stock.name\nLIMIT 50", 0, 6.552749395370483], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 5 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.182175636291504], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 5 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.501972436904907], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range <= 5 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.494629621505737], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 5 \nRETURN s.stock.name\nLIMIT 50", 0, 6.498833894729614]]}, {"query": "成交量小于17的信息技术行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '信息技术' AND sd.stock_data.volume < 17 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume < 17 AND sd.stock_data.`date` == date('2023-11-10') AND t.trade.name == \"技术\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.04463791847229004], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"技术\" AND sd.stock_data.volume < 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.03607034683227539], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume < 17 AND t.trade.name == \"技术\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.03431129455566406], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND t.trade.name == \"技术\" AND sd.stock_data.volume < 17 \nRETURN s.stock.name\nLIMIT 50", 0, 0.04080939292907715], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"技术\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 17 \nRETURN s.stock.name\nLIMIT 50", 0, 0.028649330139160156], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 17 AND t.trade.name == \"技术\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.02874922752380371]]}, {"query": "最低价小于17的工业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.minimum_price < 17 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 17 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.419115781784058], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price < 17 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.127343416213989], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.4576170444488525], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 17 \nRETURN s.stock.name\nLIMIT 50", 0, 7.169327735900879], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price < 17 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.312966585159302], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price < 17 \nRETURN s.stock.name\nLIMIT 50", 0, 7.233554363250732]]}, {"query": "成交量不大于8的娱乐设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '娱乐设备' AND sd.stock_data.volume <= 8 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 8 AND s.stock.name == \"娱乐\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0321047306060791], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 8 AND s.stock.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.03545951843261719], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"娱乐\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 8 \nRETURN s.stock\nLIMIT 50", 0, 0.020468711853027344], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 8 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.018250465393066406], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"娱乐\" AND sd.stock_data.volume <= 8 \nRETURN s.stock\nLIMIT 50", 0, 0.017223358154296875], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"娱乐\" AND sd.stock_data.volume <= 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.016653060913085938]]}, {"query": "成交量不大于30的电力行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '电力' AND sd.stock_data.volume <= 30 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.volume <= 30 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.003002166748046875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 30 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002127408981323242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 30 AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002174854278564453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电力\" AND sd.stock_data.volume <= 30 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018091201782226562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 30 AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015866756439208984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 30 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0022056102752685547]]}, {"query": "最高价不大于43的家庭和个人用品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '家庭和个人用品' AND sd.stock_data.maximum_price <= 43 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 43 \nRETURN s.stock.name\nLIMIT 50", 0, 7.58179497718811], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 43 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 8.049868106842041], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 43 \nRETURN s.stock.name\nLIMIT 50", 0, 7.211180210113525], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 43 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.570898056030273], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 43 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.131256818771362], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 43 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.179863214492798]]}, {"query": "成交量不大于18的化妆品行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '化妆品' AND sd.stock_data.volume <= 18 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume <= 18 AND indus.industry.name == \"化妆品\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0007619857788085938], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 18 AND indus.industry.name == \"化妆品\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0015256404876708984], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume <= 18 AND sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"化妆品\" \nRETURN s1.stock\nLIMIT 50", 0, 0.000354766845703125], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"化妆品\" AND sd.stock_data.volume <= 18 \nRETURN s1.stock\nLIMIT 50", 0, 0.0002613067626953125], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"化妆品\" AND sd.stock_data.volume <= 18 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.00023484230041503906], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"化妆品\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 18 \nRETURN s1.stock\nLIMIT 50", 0, 0.00022172927856445312]]}, {"query": "成交量大于9的航天和国防行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '航天和国防' AND sd.stock_data.volume > 9 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume > 9 AND s.stock.name == \"航天\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.016054630279541016], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume > 9 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"航天\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.008075475692749023], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"航天\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume > 9 \nRETURN s.stock.name\nLIMIT 50", 0, 0.00887441635131836], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"航天\" AND sd.stock_data.volume > 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.008903264999389648], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume > 9 AND s.stock.name == \"航天\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.008777141571044922], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"航天\" AND sd.stock_data.volume > 9 \nRETURN s.stock.name\nLIMIT 50", 0, 0.006432056427001953]]}, {"query": "成交量不大于25的零售行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '零售' AND sd.stock_data.volume <= 25 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume <= 25 AND sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"零售\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0010001659393310547], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"零售\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 25 \nRETURN s1.stock\nLIMIT 50", 0, 0.0005269050598144531], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 25 AND indus.industry.name == \"零售\" \nRETURN s1.stock\nLIMIT 50", 0, 0.0004069805145263672], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND indus.industry.name == \"零售\" AND sd.stock_data.volume <= 25 \nRETURN s1.stock\nLIMIT 50", 0, 0.0003542900085449219], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE sd.stock_data.volume <= 25 AND indus.industry.name == \"零售\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0003457069396972656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[a:associate]->(indus:industry)<-[a:associate]-(s1:stock)\nWHERE indus.industry.name == \"零售\" AND sd.stock_data.volume <= 25 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s1.stock\nLIMIT 50", 0, 0.0003101825714111328]]}, {"query": "成交量小于22的公用事业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '公用事业' AND sd.stock_data.volume < 22 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 22 \nRETURN s.stock\nLIMIT 50", 0, 0.028336286544799805], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 22 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.027864694595336914]]}]