[{"query": "2021年6月11日涨跌幅前28的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2021-6-11') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 28", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.0452573299407959], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.0006442070007324219], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.00041675567626953125], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.05411672592163086]]}, {"query": "2022年2月1日涨跌幅最低的上市公司是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-2-1') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05037379264831543], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04414701461791992], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006210803985595703], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.00045108795166015625]]}, {"query": "2021年6月11日涨跌幅最高的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2021-6-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0005209445953369141], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.015834808349609375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0005986690521240234], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.013000726699829102]]}, {"query": "2022年2月1日涨跌幅最高的行业是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2022-2-1') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-1\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.017486095428466797], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-1\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-1\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.012594223022460938], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-1\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-1\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0005714893341064453], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-1\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.00047469139099121094]]}, {"query": "2020年3月4日涨跌幅后19的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-3-4') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 19", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.04529690742492676], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.05286765098571777], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0006349086761474609], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0004162788391113281]]}, {"query": "2020年3月4日涨跌幅后19的股票是哪些", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-3-4') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 19", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0004904270172119141], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04383134841918945], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005707740783691406], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05051398277282715]]}, {"query": "2020年3月4日哪些股票的涨跌幅是后19的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-3-4') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 19", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.04601860046386719], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.045987844467163086], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0006866455078125], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name\nLIMIT 50", 0, 0.0005173683166503906]]}, {"query": "2020年1月12日涨跌幅最高的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-1-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.00043702125549316406], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0003662109375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.012992143630981445], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.012575149536132812]]}, {"query": "2020年1月12日哪个行业的涨跌幅最高", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-1-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0005075931549072266], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0004451274871826172], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.013390064239501953], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.012454748153686523]]}, {"query": "2020年1月12日涨跌幅最高的行业是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-1-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.00047087669372558594], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0003604888916015625], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.010422945022583008], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.01701521873474121]]}, {"query": "2022年2月1日哪个股票的涨跌幅最高", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-2-1') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.000469207763671875], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.000408172607421875], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.04633665084838867], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.048648834228515625]]}, {"query": "2022年2月1日涨跌幅最高的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-2-1') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0007288455963134766], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0005421638488769531], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.04590415954589844], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.04401874542236328]]}, {"query": "2022年2月1日涨跌幅最高的股票是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2022-2-1') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0005717277526855469], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0005285739898681641], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.04613208770751953], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2001-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-1\" ) \nRETURN s.stock.name, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0451812744140625]]}, {"query": "2020年1月12日涨跌幅前2的上市公司是哪些", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-1-12') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 2", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-12\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-12\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 2", 0, 0.000469207763671875], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-12\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 2", 0, 0.0003871917724609375], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-12\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-12\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-12\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 2", 0, 0.05085873603820801], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-12\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 2", 0, 0.04677748680114746]]}]