[{"query": "有哪些产业的上市公司股东是地造融源限", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '地造融源限' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"地造\" AND s.stock.name == \"源限\" AND s.stock.name == \"司股\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.00029468536376953125], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"地造\" AND s.stock.name == \"源限\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.0003027915954589844], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"源限\" AND s.stock.name == \"地造\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.0002574920654296875], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"源限\" AND s.stock.name == \"司股\" AND s.stock.name == \"地造\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.000209808349609375], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"源限\" AND s.stock.name == \"地造\" AND s.stock.name == \"司股\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.00023865699768066406], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"地造\" AND s.stock.name == \"司股\" AND s.stock.name == \"源限\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.00021600723266601562]]}, {"query": "关联南钢股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '南钢股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"南钢股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002753734588623047], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"南钢股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002262592315673828]]}, {"query": "有哪些产业上游的产业关联南钢股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '南钢股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"南钢股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002655982971191406], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"南钢股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002541542053222656]]}, {"query": "关联昊华科技的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '昊华科技' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013926029205322266], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001356363296508789]]}, {"query": "有哪些产业下游的产业关联昊华科技", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '昊华科技' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013856887817382812], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014576911926269531]]}, {"query": "关联重庆百货的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆百货' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"重庆百货\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002722740173339844], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"重庆百货\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00023865699768066406]]}, {"query": "有哪些产业下游的产业关联重庆百货", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆百货' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"重庆百货\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002732276916503906], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"重庆百货\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002186298370361328]]}, {"query": "上游是电力工具和设备的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电力工具和设备' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017876625061035156], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021271705627441406]]}, {"query": "有哪些产业上游的产业上游是电力工具和设备", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电力工具和设备' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016856193542480469], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020589828491210938]]}, {"query": "属于石油和天然气的股票关联的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '石油和天然气' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"石油\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0012879371643066406], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"石油\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0012226104736328125]]}, {"query": "有哪些产业关联的上市公司属于石油和天然气", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '石油和天然气' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"石油\" \nRETURN s.stock.name,indus.industry.name\nLIMIT 50", 0, 0.0015604496002197266], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"石油\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock.name,indus.industry.name\nLIMIT 50", 0, 0.0016450881958007812]]}, {"query": "关联维远股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '维远股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00025963783264160156], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.000186920166015625]]}, {"query": "有哪些产业上游的产业关联维远股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '维远股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0003151893615722656], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00025725364685058594]]}, {"query": "关联节能风电的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '节能风电' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036077499389648438], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033621788024902344]]}, {"query": "有哪些产业下游的产业关联节能风电", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '节能风电' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038247108459472656], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032765865325927734]]}, {"query": "关联福成股份的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '福成股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00030303001403808594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021982192993164062]]}, {"query": "有哪些产业下游的产业关联福成股份", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '福成股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0003147125244140625], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002377033233642578]]}, {"query": "关联鲁银投资的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '鲁银投资' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"鲁银投资\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002913475036621094], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"鲁银投资\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002601146697998047]]}, {"query": "有哪些产业上游的产业关联鲁银投资", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '鲁银投资' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"鲁银投资\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0003299713134765625], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"鲁银投资\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00025963783264160156]]}, {"query": "关联东方证券的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '东方证券' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003455638885498047], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032203197479248047]]}, {"query": "有哪些产业下游的产业关联东方证券", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '东方证券' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034360885620117188], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034825801849365234]]}, {"query": "关联广深铁路的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广深铁路' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003236055374145508], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0031893253326416016]]}, {"query": "有哪些产业下游的产业关联广深铁路", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广深铁路' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0031201839447021484], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037543773651123047]]}, {"query": "关联外服控股的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '外服控股' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"服控股\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.000293731689453125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"服控股\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002665519714355469]]}, {"query": "有哪些产业上游的产业关联外服控股", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '外服控股' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"服控股\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002734661102294922], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"服控股\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00020623207092285156]]}, {"query": "属于运输和物流的上市公司涉及的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '运输和物流' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"运输\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0015037059783935547], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"运输\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0014355182647705078]]}, {"query": "有哪些产业关联的上市公司属于运输和物流", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '运输和物流' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"运输\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0014348030090332031], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"运输\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0014009475708007812]]}, {"query": "上游是农产品的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '农产品' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00028061866760253906], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002582073211669922]]}, {"query": "有哪些产业上游的产业上游是农产品", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '农产品' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002789497375488281], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00020074844360351562]]}, {"query": "有哪些产业下游的产业关联恒源煤电", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '恒源煤电' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032346248626708984], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003295421600341797]]}, {"query": "关联均胜电子的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '均胜电子' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014789104461669922], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013360977172851562]]}, {"query": "有哪些产业上游的产业关联均胜电子", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '均胜电子' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015380382537841797], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016396045684814453]]}, {"query": "关联哈药股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '哈药股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003497600555419922], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00029349327087402344]]}, {"query": "有哪些产业上游的产业关联哈药股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '哈药股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00028967857360839844], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002732276916503906]]}, {"query": "属于物流服务的上市公司关联的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '物流服务' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"物流\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0014986991882324219], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"物流\" AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.001346588134765625]]}, {"query": "有哪些产业关联的上市公司属于物流服务", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '物流服务' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"物流\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.001420736312866211], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"物流\" AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0013124942779541016]]}, {"query": "关联建发股份的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '建发股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( s.stock.name == \"建发\" OR s.stock.name == \"股份\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00027632713317871094], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( s.stock.name == \"建发\" OR s.stock.name == \"股份\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002627372741699219]]}, {"query": "有哪些产业下游的产业关联建发股份", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '建发股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( s.stock.name == \"建发\" OR s.stock.name == \"股份\" ) \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00026726722717285156], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( s.stock.name == \"建发\" OR s.stock.name == \"股份\" ) \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00027251243591308594]]}, {"query": "关联广州发展的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广州发展' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"发展\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00027370452880859375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"发展\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002460479736328125]]}, {"query": "有哪些产业下游的产业关联广州发展", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广州发展' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"发展\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002999305725097656], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"发展\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00021886825561523438]]}, {"query": "关联四川金顶的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '四川金顶' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"四川金顶\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002887248992919922], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"四川金顶\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.000247955322265625]]}, {"query": "有哪些产业下游的产业关联四川金顶", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '四川金顶' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"四川金顶\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002739429473876953], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"四川金顶\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0001926422119140625]]}, {"query": "关联大秦铁路的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大秦铁路' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003713846206665039], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003718137741088867]]}, {"query": "有哪些产业下游的产业关联大秦铁路", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大秦铁路' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038733482360839844], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003943681716918945]]}, {"query": "关联乐凯胶片的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '乐凯胶片' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"乐凯胶片\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002791881561279297], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"乐凯胶片\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00024628639221191406]]}, {"query": "有哪些产业下游的产业关联乐凯胶片", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '乐凯胶片' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"乐凯胶片\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00027370452880859375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"乐凯胶片\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00020766258239746094]]}, {"query": "上游是电信服务提供商的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电信服务提供商' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018296241760253906], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0022857189178466797]]}, {"query": "有哪些产业上游的产业上游是电信服务提供商", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电信服务提供商' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017955303192138672], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002153158187866211]]}]