[{"query": "化妆品和酒精饮料的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '化妆品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND indus.industry.name == \"化妆品\" \nRETURN temp\nLIMIT 50", 0, 0.0003790855407714844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"化妆品\" AND t.trade.name == \"饮料\" \nRETURN temp\nLIMIT 50", 0, 0.0003082752227783203]]}, {"query": "化妆品和酒精饮料的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '化妆品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"化妆品\" AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.0026504993438720703], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.0025904178619384766]]}, {"query": "化妆品和酒精饮料的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '化妆品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"化妆品\" AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.0026345252990722656], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.0026161670684814453]]}, {"query": "科新发展和浙能电力股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '科新发展' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '浙能电力' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"发展\" AND s.stock.name == \"能电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012657642364501953], ["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND s.stock.name == \"发展\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012700557708740234]]}, {"query": "科新发展和浙能电力股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '科新发展' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '浙能电力' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"发展\" AND s.stock.name == \"能电\" \nRETURN temp\nLIMIT 50", 0, 0.00029349327087402344], ["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND s.stock.name == \"发展\" \nRETURN temp\nLIMIT 50", 0, 0.00021839141845703125]]}, {"query": "纺织品和服装和船舶和海运产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"船舶\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001425027847290039], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"船舶\" ) AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014119148254394531]]}, {"query": "纺织品和服装和船舶和海运产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"船舶\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014657974243164062], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"船舶\" ) AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016055107116699219]]}, {"query": "酒店和度假村和农业产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0003097057342529297], ["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"农业\" \nRETURN temp\nLIMIT 50", 0, 0.0002460479736328125]]}, {"query": "酒店和度假村和农业产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"农业\" \nRETURN t.trade\nLIMIT 50", 0, 0.001314401626586914], ["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014843940734863281]]}, {"query": "酒店和度假村和农业产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"农业\" \nRETURN t.trade\nLIMIT 50", 0, 0.001340627670288086], ["MATCH (t:trade)\nWHERE t.trade.name == \"农业\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016083717346191406]]}, {"query": "电子设备和汽车零部件的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电子设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016047954559326172], ["MATCH (t:trade)\nWHERE t.trade.name == \"电子\" AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013554096221923828]]}, {"query": "电子设备和汽车零部件的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电子设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"电子\" AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.00030517578125], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.00029730796813964844]]}, {"query": "运输和物流和食品和饮料的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"食品\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002765655517578125], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"食品\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002086162567138672], ["MATCH (t:trade)\nWHERE t.trade.name == \"食品\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.00021409988403320312], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"食品\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"饮料\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.00023174285888671875]]}, {"query": "京投发展和建设机械上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '京投发展' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '建设机械' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"机械\" AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012826919555664062], ["MATCH (s:stock)\nWHERE s.stock.name == \"投发\" AND s.stock.name == \"机械\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012977123260498047]]}, {"query": "京投发展和建设机械上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '京投发展' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '建设机械' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"机械\" AND s.stock.name == \"投发\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012941360473632812], ["MATCH (s:stock)\nWHERE s.stock.name == \"投发\" AND s.stock.name == \"机械\" \nRETURN s.stock\nLIMIT 50", 0, 0.001249074935913086]]}, {"query": "航空公司和制造产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '制造' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"制造\" AND indus.industry.name == \"航空\" \nRETURN temp\nLIMIT 50", 0, 0.0003070831298828125], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"航空\" AND indus.industry.name == \"制造\" \nRETURN temp\nLIMIT 50", 0, 0.0003025531768798828]]}, {"query": "航空公司和制造产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '制造' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航空\" AND indus.industry.name == \"制造\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016083717346191406], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"制造\" AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.002275705337524414]]}, {"query": "航空公司和制造产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '制造' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航空\" AND indus.industry.name == \"制造\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014116764068603516], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"制造\" AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.0023682117462158203]]}, {"query": "电力工具和设备和石油和天然气产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.002382993698120117], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电力\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0021092891693115234]]}, {"query": "电力工具和设备和石油和天然气产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '石油和天然气' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.002049684524536133], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电力\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002105236053466797]]}, {"query": "高科技和房地产的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '高科技' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '房地产' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"房地产\" ) AND indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"房地产\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0021448135375976562], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"房地产\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"房地产\" ) \nRETURN temp\nLIMIT 50", 0, 0.0024569034576416016], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"房地产\" ) AND indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"房地产\" ) AND indus.industry.name == \"房地产\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"房地产\" ) \nRETURN temp\nLIMIT 50", 0, 0.0027246475219726562], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"房地产\" ) AND indus.industry.name == \"科技\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"科技\" OR indus.industry.name == \"房地产\" ) AND indus.industry.name == \"房地产\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0019936561584472656]]}, {"query": "秦谷梁和周微生的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '秦谷梁' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '周微生' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦谷梁\" OR fm.fund_manager.name == \"周微生\" ) AND fm.fund_manager.name == \"秦谷梁\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦谷梁\" OR fm.fund_manager.name == \"周微生\" ) AND fm.fund_manager.name == \"周微生\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004265546798706055], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"秦谷梁\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"周微生\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"秦谷梁\" OR fm.fund_manager.name == \"周微生\" ) \nRETURN temp\nLIMIT 50", 0, 0.00427699089050293], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦谷梁\" OR fm.fund_manager.name == \"周微生\" ) AND fm.fund_manager.name == \"秦谷梁\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"周微生\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0039713382720947266], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦谷梁\" OR fm.fund_manager.name == \"周微生\" ) AND fm.fund_manager.name == \"秦谷梁\" WITH cm.chairman.appointment_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"秦谷梁\" OR fm.fund_manager.name == \"周微生\" ) AND fm.fund_manager.name == \"周微生\" WITH cm.chairman.appointment_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"秦谷梁\" OR fm.fund_manager.name == \"周微生\" ) \nRETURN temp\nLIMIT 50", 0, 0.004635810852050781]]}, {"query": "上海机电和均胜电子的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '上海机电' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '均胜电子' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"上海机\" AND s.stock.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.00028586387634277344], ["MATCH (s:stock)\nWHERE s.stock.name == \"电子\" AND s.stock.name == \"上海机\" \nRETURN temp\nLIMIT 50", 0, 0.00027823448181152344]]}, {"query": "上海机电和均胜电子的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '上海机电' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '均胜电子' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电子\" AND s.stock.name == \"上海机\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012865066528320312], ["MATCH (s:stock)\nWHERE s.stock.name == \"上海机\" AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013496875762939453]]}, {"query": "上海机电和均胜电子的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '上海机电' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '均胜电子' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电子\" AND s.stock.name == \"上海机\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014450550079345703], ["MATCH (s:stock)\nWHERE s.stock.name == \"上海机\" AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014257431030273438]]}, {"query": "吕澹台和严长孙的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '吕澹台' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '严长孙' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕澹台\" OR fm.fund_manager.name == \"严长孙\" ) AND fm.fund_manager.name == \"吕澹台\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"严长孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004493236541748047], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕澹台\" OR fm.fund_manager.name == \"严长孙\" ) AND fm.fund_manager.name == \"吕澹台\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕澹台\" OR fm.fund_manager.name == \"严长孙\" ) AND fm.fund_manager.name == \"严长孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004246711730957031], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"吕澹台\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"严长孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吕澹台\" OR fm.fund_manager.name == \"严长孙\" ) \nRETURN temp\nLIMIT 50", 0, 0.004361867904663086], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕澹台\" OR fm.fund_manager.name == \"严长孙\" ) AND fm.fund_manager.name == \"吕澹台\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕澹台\" OR fm.fund_manager.name == \"严长孙\" ) AND fm.fund_manager.name == \"严长孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吕澹台\" OR fm.fund_manager.name == \"严长孙\" ) \nRETURN temp\nLIMIT 50", 0, 0.004456043243408203]]}, {"query": "国泰国证医药卫生行业指数A和易方达长期价值混合A的认购开始时间差距", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰国证医药卫生行业指数A' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '易方达长期价值混合A' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND ( pof.public_offering_fund.name == \"医药\" OR pof.public_offering_fund.name == \"卫生\" ) \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0014202594757080078], ["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"医药\" OR pof.public_offering_fund.name == \"卫生\" ) AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0014181137084960938]]}, {"query": "国泰国证医药卫生行业指数A和易方达长期价值混合A的认购开始时间差额是多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰国证医药卫生行业指数A' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '易方达长期价值混合A' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND ( pof.public_offering_fund.name == \"医药\" OR pof.public_offering_fund.name == \"卫生\" ) \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013017654418945312], ["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"医药\" OR pof.public_offering_fund.name == \"卫生\" ) AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012891292572021484]]}, {"query": "国泰国证医药卫生行业指数A和易方达长期价值混合A的认购开始时间差多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰国证医药卫生行业指数A' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '易方达长期价值混合A' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE ( pof.public_offering_fund.name == \"医药\" OR pof.public_offering_fund.name == \"卫生\" ) AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN temp\nLIMIT 50", 0, 0.0003275871276855469], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND ( pof.public_offering_fund.name == \"医药\" OR pof.public_offering_fund.name == \"卫生\" ) \nRETURN temp\nLIMIT 50", 0, 0.00025081634521484375]]}, {"query": "酒精饮料和航空航天的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"航空航天\" ) AND t.trade.name == \"饮料\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"航空航天\" ) AND t.trade.name == \"航空航天\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002789497375488281], ["MATCH (t:trade)\nWHERE t.trade.name == \"饮料\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"航空航天\" ) \nRETURN temp\nLIMIT 50", 0, 0.00024366378784179688], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"航空航天\" ) AND t.trade.name == \"饮料\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00019121170043945312], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"航空航天\" ) AND t.trade.name == \"饮料\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"航空航天\" ) AND t.trade.name == \"航空航天\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"航空航天\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002288818359375]]}, {"query": "京城股份和浙数文化股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '京城股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '浙数文化' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"文化\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012900829315185547], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"文化\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013380050659179688]]}, {"query": "京城股份和浙数文化股票的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '京城股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '浙数文化' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"文化\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013692378997802734], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"文化\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014274120330810547]]}, {"query": "酒店和度假村和电力工具和设备的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0003094673156738281], ["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.00028252601623535156]]}, {"query": "酒店和度假村和电力工具和设备的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016319751739501953], ["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012753009796142578]]}, {"query": "酒店和度假村和电力工具和设备的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016584396362304688], ["MATCH (t:trade)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015075206756591797]]}, {"query": "航天和国防和船舶和海运的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"航天\" \nRETURN temp\nLIMIT 50", 0, 0.0002872943878173828], ["MATCH (t:trade)\nWHERE t.trade.name == \"航天\" AND t.trade.name == \"船舶\" \nRETURN temp\nLIMIT 50", 0, 0.0003058910369873047]]}, {"query": "航天和国防和船舶和海运的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"航天\" AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013415813446044922], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012345314025878906]]}, {"query": "航天和国防和船舶和海运的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"航天\" AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012905597686767578], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013394355773925781]]}, {"query": "航空公司和金融技术产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金融技术' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航空\" AND ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014674663543701172], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014369487762451172]]}]