[{"query": "有哪些产业上游的产业关联营口港", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '营口港' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00027680397033691406], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00021409988403320312]]}, {"query": "股东是房金据药服的股票关联的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '房金据药服' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( s.stock.name == \"金据\" OR s.stock.name == \"药服\" ) AND s.stock.name == \"房金据药服\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0017132759094238281], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"房金据药服\" AND ( s.stock.name == \"金据\" OR s.stock.name == \"药服\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0019524097442626953]]}, {"query": "有哪些产业的股票股东是房金据药服", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '房金据药服' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( s.stock.name == \"金据\" OR s.stock.name == \"药服\" ) AND s.stock.name == \"房金据药服\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.0003445148468017578], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"房金据药服\" AND ( s.stock.name == \"金据\" OR s.stock.name == \"药服\" ) \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.0002455711364746094]]}, {"query": "上游是家居用品的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '家居用品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014939308166503906], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014863014221191406]]}, {"query": "有哪些产业上游的产业上游是家居用品", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '家居用品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014843940734863281], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"家居\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014851093292236328]]}, {"query": "关联海尔智家的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '海尔智家' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00427699089050293], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004095554351806641]]}, {"query": "有哪些产业下游的产业关联海尔智家", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '海尔智家' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003937244415283203], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003791332244873047]]}, {"query": "关联长电科技的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长电科技' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"长电科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003426074981689453], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"长电科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00029587745666503906]]}, {"query": "有哪些产业下游的产业关联长电科技", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长电科技' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"长电科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002791881561279297], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"长电科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00028514862060546875]]}, {"query": "关联伊力特的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '伊力特' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"伊力特\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002815723419189453], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"伊力特\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.000194549560546875]]}, {"query": "有哪些产业下游的产业关联伊力特", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '伊力特' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"伊力特\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00034236907958984375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"伊力特\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.000301361083984375]]}, {"query": "有哪些产业关联的上市公司股东是数资", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '数资' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"数资\" AND s.stock.name == \"司股\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.00036144256591796875], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"数资\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.00027942657470703125]]}, {"query": "关联友好集团的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '友好集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"友好集团\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002834796905517578], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"友好集团\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002522468566894531]]}, {"query": "有哪些产业下游的产业关联友好集团", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '友好集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"友好集团\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00028014183044433594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"友好集团\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002288818359375]]}, {"query": "关联亿利洁能的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '亿利洁能' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003453969955444336], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003218412399291992]]}, {"query": "有哪些产业上游的产业关联亿利洁能", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '亿利洁能' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003262042999267578], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0031740665435791016]]}, {"query": "关联重庆燃气的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆燃气' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003149271011352539], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003260374069213867]]}, {"query": "有哪些产业上游的产业关联重庆燃气", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '重庆燃气' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038652420043945312], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036361217498779297]]}, {"query": "关联小商品城的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '小商品城' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"小商品城\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00031065940856933594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"小商品城\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021505355834960938]]}, {"query": "有哪些产业上游的产业关联小商品城", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '小商品城' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"小商品城\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002918243408203125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"小商品城\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.000225067138671875]]}, {"query": "关联云赛智联的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '云赛智联' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003951072692871094], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036385059356689453]]}, {"query": "有哪些产业上游的产业关联云赛智联", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '云赛智联' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037713050842285156], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037326812744140625]]}, {"query": "关联*ST同达的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '*ST同达' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST同达\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00030350685119628906], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST同达\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002372264862060547]]}, {"query": "有哪些产业下游的产业关联*ST同达", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '*ST同达' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST同达\" \nRETURN s.stock,indus1.industry.name\nLIMIT 50", 0, 0.00028777122497558594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST同达\" \nRETURN s.stock,indus1.industry.name\nLIMIT 50", 0, 0.0002524852752685547]]}, {"query": "关联金鹰股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '金鹰股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"金鹰股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002779960632324219], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"金鹰股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002777576446533203]]}, {"query": "有哪些产业上游的产业关联金鹰股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '金鹰股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"金鹰股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00026869773864746094], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"金鹰股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002512931823730469]]}, {"query": "关联大名城的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大名城' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003952503204345703], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037975311279296875]]}, {"query": "有哪些产业上游的产业关联大名城", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大名城' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003892660140991211], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036954879760742188]]}, {"query": "关联上海物贸的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海物贸' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003940582275390625], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003462076187133789]]}, {"query": "有哪些产业上游的产业关联上海物贸", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海物贸' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033445358276367188], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003387928009033203]]}, {"query": "关联ST中安的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST中安' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00027441978454589844], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0001900196075439453]]}, {"query": "有哪些产业下游的产业关联ST中安", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST中安' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002830028533935547], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST中\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00025343894958496094]]}, {"query": "关联益民集团的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '益民集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0041484832763671875], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003561735153198242]]}, {"query": "有哪些产业下游的产业关联益民集团", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '益民集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003403902053833008], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032858848571777344]]}, {"query": "关联长沙银行的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长沙银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001384735107421875], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013744831085205078]]}, {"query": "有哪些产业上游的产业关联长沙银行", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长沙银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001708984375], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001453399658203125]]}, {"query": "关联沧州大化的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '沧州大化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00028777122497558594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00020694732666015625]]}, {"query": "有哪些产业下游的产业关联沧州大化", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '沧州大化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0003075599670410156], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"沧州大化\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002799034118652344]]}, {"query": "关联文峰股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '文峰股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002582073211669922], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002410411834716797]]}, {"query": "有哪些产业上游的产业关联文峰股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '文峰股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002720355987548828], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002677440643310547]]}, {"query": "关联昊华科技的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '昊华科技' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015506744384765625], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015799999237060547]]}, {"query": "有哪些产业上游的产业关联昊华科技", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '昊华科技' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013647079467773438], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014142990112304688]]}, {"query": "有哪些行业的上市公司股东是份集建", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '份集建' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"份集建\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00028967857360839844], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"份集建\" AND s.stock.name == \"司股\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00021338462829589844]]}, {"query": "关联中国核建的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中国核建' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033571720123291016], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036661624908447266]]}, {"query": "有哪些产业上游的产业关联中国核建", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中国核建' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003569364547729492], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003433704376220703]]}, {"query": "上游是农业机械的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '农业机械' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019121170043945312], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0022385120391845703]]}, {"query": "有哪些产业上游的产业上游是农业机械", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '农业机械' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019195079803466797], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"农业\" OR indus.industry.name == \"机械\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021696090698242188]]}, {"query": "关联风范股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '风范股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00031685829162597656], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00026035308837890625]]}, {"query": "有哪些产业上游的产业关联风范股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '风范股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002906322479248047], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002834796905517578]]}, {"query": "关联鑫科材料的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '鑫科材料' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"鑫科材料\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002675056457519531], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"鑫科材料\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00020694732666015625]]}, {"query": "有哪些产业下游的产业关联鑫科材料", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '鑫科材料' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"鑫科材料\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00026345252990722656], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"鑫科材料\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00020599365234375]]}, {"query": "上游是建筑的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '建筑' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017542839050292969], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002010345458984375]]}, {"query": "有哪些产业上游的产业上游是建筑", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '建筑' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017025470733642578], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"建筑\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019910335540771484]]}, {"query": "上游是纺织品和服装的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '纺织品和服装' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001468658447265625], ["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014798641204833984], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001439809799194336], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013780593872070312]]}, {"query": "有哪些产业上游的产业上游是纺织品和服装", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '纺织品和服装' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014579296112060547], ["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014674663543701172], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014388561248779297], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001352548599243164]]}, {"query": "关联京投发展的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '京投发展' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"投发\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002627372741699219], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"投发\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0001900196075439453]]}, {"query": "有哪些产业下游的产业关联京投发展", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '京投发展' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"投发\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.000274658203125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"投发\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002224445343017578]]}, {"query": "股东是地造融源限的上市公司关联的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '地造融源限' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"源限\" AND s.stock.name == \"地造\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0014111995697021484], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"地造\" AND s.stock.name == \"源限\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.001428365707397461]]}]