[{"query": "在东方电气和*ST宜生和宝泰隆中开盘价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['东方电气', '*ST宜生', '宝泰隆'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宜\" AND s.stock.name == \"东方电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016956329345703125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宜\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015883445739746094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宜\" AND s.stock.name == \"东方电\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0014934539794921875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方电\" AND s.stock.name == \"ST宜\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017459392547607422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"东方电\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016105175018310547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"东方电\" AND s.stock.name == \"ST宜\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015544891357421875]]}, {"query": "在钢铁和娱乐设备中最低价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['钢铁', '娱乐设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.001588582992553711], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0015568733215332031]]}, {"query": "在钢铁和娱乐设备中最低价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['钢铁', '娱乐设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016019344329833984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0015156269073486328]]}, {"query": "哪个是在钢铁和娱乐设备中最低价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['钢铁', '娱乐设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015146732330322266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001550436019897461]]}, {"query": "在中信重工和*ST宏图和国药现代中最低价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中信重工', '*ST宏图', '国药现代'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宏\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017573833465576172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宏\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016064643859863281]]}, {"query": "在中信重工和*ST宏图和国药现代中最低价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中信重工', '*ST宏图', '国药现代'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宏\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017898082733154297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宏\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016472339630126953]]}, {"query": "哪个是在中信重工和*ST宏图和国药现代中最低价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中信重工', '*ST宏图', '国药现代'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宏\" \nRETURN s.stock\nLIMIT 50", 0, 0.001984119415283203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宏\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017774105072021484]]}, {"query": "在医疗保健设施和医疗保健和运输和物流行业中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['医疗保健设施', '医疗保健', '运输和物流'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019385814666748047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017352104187011719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0014801025390625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00151824951171875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015461444854736328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0014910697937011719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015027523040771484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016186237335205078], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016181468963623047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.001672983169555664], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001501321792602539], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016982555389404297]]}, {"query": "哪个是在医疗保健设施和医疗保健和运输和物流行业中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['医疗保健设施', '医疗保健', '运输和物流'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017971992492675781], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019071102142333984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001619577407836914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016646385192871094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00170135498046875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015528202056884766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015308856964111328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001630544662475586], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017056465148925781], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016815662384033203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016181468963623047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015692710876464844]]}, {"query": "在医疗保健设施和医疗保健和运输和物流行业中最高价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['医疗保健设施', '医疗保健', '运输和物流'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.001703023910522461], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017163753509521484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001619100570678711], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015995502471923828], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016248226165771484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015785694122314453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015981197357177734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016117095947265625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015914440155029297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015931129455566406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001569509506225586], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016257762908935547]]}, {"query": "在祁连山和ST美讯和海泰发展中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['祁连山', 'ST美讯', '海泰发展'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"发展\" AND ( s.stock.name == \"祁连山\" OR s.stock.name == \"ST美\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.00218963623046875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"发展\" AND ( s.stock.name == \"祁连山\" OR s.stock.name == \"ST美\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0018832683563232422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"祁连山\" OR s.stock.name == \"ST美\" ) AND s.stock.name == \"发展\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0017786026000976562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"发展\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"祁连山\" OR s.stock.name == \"ST美\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0017199516296386719], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"祁连山\" OR s.stock.name == \"ST美\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"发展\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0016629695892333984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"祁连山\" OR s.stock.name == \"ST美\" ) AND s.stock.name == \"发展\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0015854835510253906]]}, {"query": "哪个是在家居用品和零售和房地产行业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['家居用品', '零售', '房地产'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"房地产\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001821279525756836], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"房地产\" ) AND indus.industry.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017871856689453125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"房地产\" ) AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017435550689697266], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"房地产\" ) AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017733573913574219], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"家居\" AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"房地产\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001814126968383789], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"家居\" AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"房地产\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018007755279541016]]}, {"query": "哪个是在锦江酒店和绿能慧充和皖通高速上市公司中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['锦江酒店', '绿能慧充', '皖通高速'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"皖通高速\" AND s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016176462173461914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND s.stock.name == \"皖通高速\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017924308776855469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" AND s.stock.name == \"皖通高速\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017981529235839844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"皖通高速\" AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.016669273376464844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"皖通高速\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018284320831298828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"皖通高速\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.01753377914428711]]}, {"query": "在锦江酒店和绿能慧充和皖通高速上市公司中成交量最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['锦江酒店', '绿能慧充', '皖通高速'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"皖通高速\" AND s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01638507843017578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND s.stock.name == \"皖通高速\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018570423126220703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" AND s.stock.name == \"皖通高速\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016164779663085938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"皖通高速\" AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.015115022659301758], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"皖通高速\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018069744110107422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"皖通高速\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.015285015106201172]]}, {"query": "哪个是在航空公司和汽车零部件中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航空公司', '汽车零部件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.001569986343383789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0015647411346435547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0015342235565185547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.016964197158813477], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.016890764236450195], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" AND t.trade.name == \"航空\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.017391204833984375]]}, {"query": "在航空公司和汽车零部件中涨跌幅最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航空公司', '汽车零部件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0018358230590820312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0015649795532226562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0015485286712646484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.016371726989746094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.016918420791625977], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" AND t.trade.name == \"航空\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0159914493560791]]}, {"query": "在航空公司和汽车零部件中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航空公司', '汽车零部件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0019328594207763672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0016667842864990234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0015490055084228516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.016144752502441406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.016649961471557617], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" AND t.trade.name == \"航空\" \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.01725602149963379]]}, {"query": "在宇通重工和福元医和旭光电子上市公司中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['宇通重工', '福元医', '旭光电子'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0020160675048828125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0016777515411376953]]}, {"query": "哪个是在宇通重工和福元医和旭光电子上市公司中涨跌幅最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['宇通重工', '福元医', '旭光电子'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0018889904022216797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.001567840576171875]]}]