[{"query": "股票东风科技2013年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '东风科技' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"东风科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002522706985473633], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"东风科技\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025327205657958984], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"东风科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002493619918823242], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"东风科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024271011352539062], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"东风科技\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024433135986328125], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"东风科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024573802947998047]]}, {"query": "2013年7到9月股票东风科技的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '东风科技' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"东风科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023784637451171875], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"东风科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002460479736328125]]}, {"query": "股票人福医药2016年第四季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '人福医药' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"医药\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016007423400878906], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"医药\" AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015270709991455078], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"医药\" AND sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014522075653076172], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"医药\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014674663543701172], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"医药\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014379024505615234], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"医药\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015308856964111328]]}, {"query": "2016年10到12月股票人福医药的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '人福医药' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"医药\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016069412231445312], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"医药\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015566349029541016]]}, {"query": "股票华升股份2017年第二季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '华升股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015912055969238281], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016016960144042969], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015838146209716797], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"股份\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001711130142211914], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016083717346191406], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"股份\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015532970428466797]]}, {"query": "股票海南椰岛2017年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '海南椰岛' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"海南椰岛\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002445697784423828], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"海南椰岛\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024361610412597656], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"海南椰岛\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026149749755859375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"海南椰岛\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026361942291259766], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"海南椰岛\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025017261505126953], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"海南椰岛\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025720596313476562]]}, {"query": "2017年7到9月股票海南椰岛的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '海南椰岛' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"海南椰岛\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024328231811523438], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"海南椰岛\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0027103424072265625]]}, {"query": "股票康缘药业2013年第四季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '康缘药业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"康缘药业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002648591995239258], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"康缘药业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002535104751586914], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"康缘药业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.00250244140625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"康缘药业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024406909942626953], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"康缘药业\" AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002532958984375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"康缘药业\" AND sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002756834030151367]]}, {"query": "2013年10到12月股票康缘药业的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '康缘药业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"康缘药业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024404525756835938], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"康缘药业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002618074417114258]]}, {"query": "股票宝地矿业2013年第二季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '宝地矿业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"矿业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0017151832580566406], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"矿业\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015964508056640625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"矿业\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0016660690307617188], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"矿业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0016660690307617188], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"矿业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015473365783691406], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"矿业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.001451253890991211]]}, {"query": "2013年4到6月股票宝地矿业的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '宝地矿业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"矿业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.001596689224243164], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"矿业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0015687942504882812]]}, {"query": "股票龙江交通2016年第二季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '龙江交通' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"交通\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0016398429870605469], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"交通\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001547098159790039], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"交通\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015676021575927734], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"交通\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001491546630859375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"交通\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014698505401611328], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"交通\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015785694122314453]]}, {"query": "2016年4到6月股票龙江交通的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '龙江交通' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"交通\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015454292297363281], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"交通\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014948844909667969]]}, {"query": "股票海螺水泥2017年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '海螺水泥' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"海螺水泥\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002538442611694336], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"海螺水泥\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024309158325195312], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"海螺水泥\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024509429931640625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"海螺水泥\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0027751922607421875], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"海螺水泥\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025255680084228516], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"海螺水泥\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002746105194091797]]}, {"query": "2017年7到9月股票海螺水泥的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '海螺水泥' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"海螺水泥\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002518892288208008], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"海螺水泥\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026175975799560547]]}, {"query": "股票民丰特纸2013年第二季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '民丰特纸' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"民丰特纸\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025234222412109375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"民丰特纸\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.003352642059326172], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"民丰特纸\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002856731414794922], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"民丰特纸\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026481151580810547], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"民丰特纸\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025916099548339844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"民丰特纸\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025000572204589844]]}, {"query": "2013年4到6月股票民丰特纸的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '民丰特纸' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"民丰特纸\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002710103988647461], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"民丰特纸\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002577543258666992]]}, {"query": "股票春兰股份2016年第四季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '春兰股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"春兰股份\" AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002626180648803711], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"春兰股份\" AND sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0028181076049804688], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"春兰股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0027968883514404297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"春兰股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0032782554626464844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"春兰股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002886533737182617], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"春兰股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002755403518676758]]}]