[{"query": "电力工具和设备行业近37日的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-37 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 11.448715448379517], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0010440349578857422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0004203319549560547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.31094813346862793]]}, {"query": "电力工具和设备行业近37日的涨跌幅是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-37 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)\nWHERE t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0285184383392334], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)\nWHERE t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.04496574401855469], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006561279296875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004487037658691406]]}, {"query": "近37日电力工具和设备行业的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-37 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 11.329712390899658], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0011069774627685547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0007061958312988281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-10-1\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.3071565628051758]]}, {"query": "原材料1993年7月30日到2023年6月2日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` >= date('1993-07-30') AND td.trade_data.`date` <= date('2023-06-02') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-30\" ) AND td.trade_data.`date` == date( \"2023-6-2\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002737760543823242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-6-2\" ) AND td.trade_data.`date` == date( \"1993-7-30\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008217334747314453]]}, {"query": "原材料1993年7月30日到2023年6月2日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '原材料' AND td.trade_data.`date` >= date('1993-07-30') AND td.trade_data.`date` <= date('2023-06-02') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-30\" ) AND td.trade_data.`date` == date( \"2023-6-2\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0026226043701171875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-6-2\" ) AND td.trade_data.`date` == date( \"1993-7-30\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007889986038208008]]}, {"query": "近80日航空公司行业的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-80 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0025336742401123047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0020215511322021484]]}, {"query": "航空公司行业近80日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-80 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.002419710159301758], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002122163772583008]]}, {"query": "航空公司行业近80日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-80 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0024878978729248047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0022211074829101562]]}, {"query": "航空公司2022年4月20日前29日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` <= date('2022-04-20') AND td.trade_data.`date` > date('2022-04-20')-29 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2022-4-20\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN t.trade\nLIMIT 50", 0, 0.0030362606048583984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-20\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.0026226043701171875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-20\" ) AND t.trade.name == \"航空\" AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN t.trade\nLIMIT 50", 0, 0.0022296905517578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2022-4-20\" ) AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019366741180419922], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2022-4-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019636154174804688], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2022-4-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0021750926971435547]]}, {"query": "航空公司2022年4月20日前29日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` <= date('2022-04-20') AND td.trade_data.`date` > date('2022-04-20')-29 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2022-4-20\" ) \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002359151840209961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND td.trade_data.`date` == date( \"2022-4-20\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0020170211791992188], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-20\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"航空\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0018024444580078125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE date('2023-11-11') - td.trade_data.`date` <= 29 AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2022-4-20\" ) \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0017547607421875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2022-4-20\" ) AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0018353462219238281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-20\" ) AND t.trade.name == \"航空\" AND date('2023-11-11') - td.trade_data.`date` <= 29 \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0016961097717285156]]}, {"query": "近51日珠宝和宝石的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-51 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002922534942626953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0028579235076904297]]}, {"query": "珠宝和宝石近51日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-51 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002863168716430664], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0021784305572509766]]}, {"query": "2019年6月11日到2023年8月25日的公用事业行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` >= date('2019-06-11') AND td.trade_data.`date` <= date('2023-08-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-25\" ) AND td.trade_data.`date` == date( \"2019-6-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008345842361450195], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-6-11\" ) AND td.trade_data.`date` == date( \"2023-8-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002415895462036133]]}, {"query": "公用事业行业2019年6月11日到2023年8月25日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` >= date('2019-06-11') AND td.trade_data.`date` <= date('2023-08-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-25\" ) AND td.trade_data.`date` == date( \"2019-6-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007932901382446289], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-6-11\" ) AND td.trade_data.`date` == date( \"2023-8-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002338409423828125]]}, {"query": "公用事业行业2019年6月11日到2023年8月25日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` >= date('2019-06-11') AND td.trade_data.`date` <= date('2023-08-25') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-8-25\" ) AND td.trade_data.`date` == date( \"2019-6-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007856130599975586], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-6-11\" ) AND td.trade_data.`date` == date( \"2023-8-25\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0027086734771728516]]}, {"query": "近70日珠宝和宝石行业的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-70 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002782106399536133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0023713111877441406]]}, {"query": "珠宝和宝石行业近70日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-70 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN t.trade\nLIMIT 50", 0, 0.0025415420532226562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0021190643310546875]]}, {"query": "珠宝和宝石行业近70日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-70 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002843618392944336], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"宝石\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0021653175354003906]]}, {"query": "纺织品和服装行业近73日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-73 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002803802490234375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021941661834716797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0022094249725341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0019159317016601562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018811225891113281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018775463104248047]]}, {"query": "近73日纺织品和服装行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-73 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0026845932006835938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0021495819091796875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0020296573638916016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0018894672393798828], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0018246173858642578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0017116069793701172]]}, {"query": "纺织品和服装行业近73日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-73 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0026459693908691406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0023376941680908203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0020813941955566406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002368450164794922], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002279996871948242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002070188522338867]]}, {"query": "近17日酒精饮料行业的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-17 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0027303695678710938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0025894641876220703]]}, {"query": "酒精饮料行业近17日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-17 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002403736114501953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN t.trade\nLIMIT 50", 0, 0.002047300338745117]]}, {"query": "酒精饮料行业近17日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒精饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-17 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.0024623870849609375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.002185344696044922]]}, {"query": "2020年6月2日后100日的媒体和娱乐行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` >= date('2020-06-02') AND td.trade_data.`date` < date('2020-06-02')+100 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date( \"2020-6-2\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0006859302520751953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-2\" ) AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0003566741943359375]]}, {"query": "媒体和娱乐行业2020年6月2日后100日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` >= date('2020-06-02') AND td.trade_data.`date` < date('2020-06-02')+100 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date( \"2020-6-2\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0006957054138183594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-2\" ) AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0004115104675292969]]}, {"query": "媒体和娱乐行业2020年6月2日后100天的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` >= date('2020-06-02') AND td.trade_data.`date` < date('2020-06-02')+100 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date( \"2020-6-2\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0006005764007568359], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-2\" ) AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.00047707557678222656]]}, {"query": "媒体和娱乐行业2020年6月2日后100日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` >= date('2020-06-02') AND td.trade_data.`date` < date('2020-06-02')+100 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-2\" ) AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01032876968383789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date( \"2020-6-2\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008529901504516602]]}, {"query": "纺织品和服装行业近99日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-99 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0029621124267578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.003072500228881836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.002435445785522461], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002569913864135742], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021321773529052734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019540786743164062]]}]