[{"query": "在航空公司和电信和酒店和度假村中收盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航空公司', '电信', '酒店和度假村'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"航空\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0020918846130371094], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"航空\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.001886129379272461], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0018472671508789062], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0017325878143310547], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"航空\" \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.001712799072265625], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"航空\" \nRETURN s.stock, td.trade_data.closing_price AS TTDCP\nORDER BY TTDCP DESC LIMIT 1", 0, 0.0017268657684326172]]}, {"query": "哪个是在ST洲际和浦东金桥和退市海医中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['ST洲际', '浦东金桥', '退市海医'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浦东金桥\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01938796043395996], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浦东金桥\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01682591438293457]]}, {"query": "在ST洲际和浦东金桥和退市海医中最高价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['ST洲际', '浦东金桥', '退市海医'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浦东金桥\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01701045036315918], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浦东金桥\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.017129182815551758]]}, {"query": "在汽车零部件和原材料中最低价最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车零部件', '原材料'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.01786637306213379], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.018451213836669922]]}, {"query": "在汽车零部件和原材料中最低价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车零部件', '原材料'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.01772141456604004], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.017807483673095703]]}, {"query": "在腾达建设和青海华鼎和农发种业股票中最低价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['腾达建设', '青海华鼎', '农发种业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"腾达建设\" OR s.stock.name == \"青海华鼎\" ) \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.021250247955322266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"腾达建设\" OR s.stock.name == \"青海华鼎\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01974034309387207]]}, {"query": "哪个是在房地产和污水处理行业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['房地产', '污水处理'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"房地产\" AND t.trade.name == \"水处理\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.02150702476501465], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND indus.industry.name == \"房地产\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.01875615119934082], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" AND indus.industry.name == \"房地产\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.019624710083007812], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"房地产\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.018061399459838867], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"房地产\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.018848419189453125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"房地产\" AND t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0196075439453125]]}, {"query": "哪个是在房地产和家居用品和航空公司中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['房地产', '家居用品', '航空公司'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"房地产\" OR indus.industry.name == \"家居\" ) AND indus.industry.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018486976623535156], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"家居\" ) AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018513202667236328], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"航空\" AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"家居\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018956661224365234], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"房地产\" OR indus.industry.name == \"家居\" ) AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"航空\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019173622131347656], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"航空\" AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"家居\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017995834350585938], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"航空\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"房地产\" OR indus.industry.name == \"家居\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017852783203125]]}, {"query": "在苏能股份和雅戈尔股票中最低价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['苏能股份', '雅戈尔'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"雅戈尔\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能股\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.002113819122314453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"雅戈尔\" ) AND s.stock.name == \"能股\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.001827239990234375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"雅戈尔\" ) AND s.stock.name == \"能股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.001798391342163086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能股\" AND ( s.stock.name == \"股份\" OR s.stock.name == \"雅戈尔\" ) \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017123222351074219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"雅戈尔\" ) \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0016977787017822266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能股\" AND ( s.stock.name == \"股份\" OR s.stock.name == \"雅戈尔\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0016591548919677734]]}, {"query": "哪个是在银行和工业行业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['银行', '工业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0020363330841064453], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0017671585083007812]]}, {"query": "在鲁银投资和南网储和通策医疗上市公司中成交量最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['鲁银投资', '南网储', '通策医疗'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁银投资\" AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0210263729095459], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"鲁银投资\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002622842788696289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" AND s.stock.name == \"鲁银投资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019233226776123047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁银投资\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.017046451568603516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁银投资\" AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.01521158218383789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁银投资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019118785858154297]]}, {"query": "哪个是在鲁银投资和南网储和通策医疗上市公司中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['鲁银投资', '南网储', '通策医疗'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁银投资\" AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01825857162475586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"鲁银投资\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002001047134399414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" AND s.stock.name == \"鲁银投资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017864704132080078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁银投资\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.018468856811523438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁银投资\" AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.018920183181762695], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁银投资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019404888153076172]]}, {"query": "在鲁银投资和南网储和通策医疗上市公司中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['鲁银投资', '南网储', '通策医疗'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁银投资\" AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01630711555480957], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"鲁银投资\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001980304718017578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" AND s.stock.name == \"鲁银投资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018718242645263672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁银投资\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.017098188400268555], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁银投资\" AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.016187429428100586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁银投资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018968582153320312]]}, {"query": "哪个是在石油和天然气和化妆品中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['石油和天然气', '化妆品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0186159610748291], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020388364791870117], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.02175116539001465], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02073359489440918], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021798372268676758], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.018578290939331055]]}, {"query": "在马钢股份和新五丰中成交量最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['马钢股份', '新五丰'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"马钢股份\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.018702030181884766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"马钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.016644716262817383]]}, {"query": "哪个是在马钢股份和新五丰中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['马钢股份', '新五丰'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"马钢股份\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.016068458557128906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"马钢股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.016035795211791992]]}, {"query": "在物流服务和电视和广播行业中最高价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '电视和广播'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0067822933197021484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.008148670196533203]]}, {"query": "在隆基绿能和上海能源和爱建集团上市公司中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['隆基绿能', '上海能源', '爱建集团'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.017925500869750977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018907546997070312]]}, {"query": "哪个是在隆基绿能和上海能源和爱建集团上市公司中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['隆基绿能', '上海能源', '爱建集团'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.015416860580444336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01635885238647461]]}, {"query": "在汽车制造和电力工具和设备行业中最低价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车制造', '电力工具和设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.005797147750854492], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.008072853088378906]]}, {"query": "哪个是在中国海油和首旅酒店上市公司中收盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中国海油', '首旅酒店'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.0017926692962646484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.0016431808471679688]]}, {"query": "在中国海油和首旅酒店上市公司中收盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中国海油', '首旅酒店'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.closing_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.0017442703247070312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock, sd.stock_data.closing_price AS SSDCP\nORDER BY SSDCP DESC LIMIT 1", 0, 0.001638650894165039]]}, {"query": "哪个是在医疗保健和银行行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['医疗保健', '银行'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND indus.industry.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0017101764678955078], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"医疗\" AND indus.industry.name == \"银行\" \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0015697479248046875], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.00165557861328125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" AND indus.industry.name == \"医疗\" \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0016934871673583984], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"医疗\" \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0016436576843261719], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.001667022705078125]]}, {"query": "在上海建工和中国交建和航天动力股票中最高价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['上海建工', '中国交建', '航天动力'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海建工\" AND s.stock.name == \"航天动力\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01703023910522461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天动力\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海建工\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016936063766479492], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海建工\" AND s.stock.name == \"航天动力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01689934730529785], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"航天动力\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016953229904174805], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"航天动力\" AND s.stock.name == \"上海建工\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016219377517700195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"航天动力\" AND s.stock.name == \"上海建工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01694178581237793]]}]