[{"query": "陶太叔和蒋仲孙的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '陶太叔' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '蒋仲孙' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶太叔\" OR fm.fund_manager.name == \"蒋仲孙\" ) AND fm.fund_manager.name == \"陶太叔\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶太叔\" OR fm.fund_manager.name == \"蒋仲孙\" ) AND fm.fund_manager.name == \"蒋仲孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0045621395111083984], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶太叔\" OR fm.fund_manager.name == \"蒋仲孙\" ) AND fm.fund_manager.name == \"陶太叔\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶太叔\" OR fm.fund_manager.name == \"蒋仲孙\" ) AND fm.fund_manager.name == \"蒋仲孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶太叔\" OR fm.fund_manager.name == \"蒋仲孙\" ) \nRETURN temp\nLIMIT 50", 0, 0.004637956619262695], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"陶太叔\" OR fm.fund_manager.name == \"蒋仲孙\" ) AND fm.fund_manager.name == \"陶太叔\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"蒋仲孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00412297248840332], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"陶太叔\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"蒋仲孙\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶太叔\" OR fm.fund_manager.name == \"蒋仲孙\" ) \nRETURN temp\nLIMIT 50", 0, 0.004235744476318359]]}, {"query": "ST曙光和春兰股份股票的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST曙光' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '春兰股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"春兰股份\" AND ( s.stock.name == \"春兰股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015804767608642578], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"春兰股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"春兰股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016140937805175781]]}, {"query": "ST曙光和春兰股份股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST曙光' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '春兰股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"春兰股份\" AND ( s.stock.name == \"春兰股\" OR s.stock.name == \"份股\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003566741943359375], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"春兰股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"春兰股份\" \nRETURN temp\nLIMIT 50", 0, 0.0002884864807128906]]}, {"query": "ST曙光和春兰股份股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST曙光' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '春兰股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"春兰股份\" AND ( s.stock.name == \"春兰股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017542839050292969], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"春兰股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"春兰股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001767873764038086]]}, {"query": "酒店和度假村和制造的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '制造' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"制造\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014290809631347656], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"制造\" AND indus.industry.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021011829376220703]]}, {"query": "酒店和度假村和制造的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '制造' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"制造\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015528202056884766], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"制造\" AND indus.industry.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.002257823944091797]]}, {"query": "酒店和度假村和制造的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '制造' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"制造\" \nRETURN temp\nLIMIT 50", 0, 0.0003046989440917969], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"制造\" AND indus.industry.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0002391338348388672]]}, {"query": "船舶和海运和汽车零部件产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0027692317962646484], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"汽车\" AND t.trade.name == \"船舶\" \nRETURN s.stock\nLIMIT 50", 0, 0.002694368362426758]]}, {"query": "船舶和海运和汽车零部件产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.002665996551513672], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"汽车\" AND t.trade.name == \"船舶\" \nRETURN s.stock\nLIMIT 50", 0, 0.002589702606201172]]}, {"query": "京能电力和安泰集团上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '京能电力' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '安泰集团' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND ( s.stock.name == \"电力\" OR s.stock.name == \"安泰集团\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013010501861572266], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"电力\" OR s.stock.name == \"安泰集团\" ) AND s.stock.name == \"能电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013473033905029297]]}, {"query": "京能电力和安泰集团上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '京能电力' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '安泰集团' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"电力\" OR s.stock.name == \"安泰集团\" ) AND s.stock.name == \"能电\" \nRETURN temp\nLIMIT 50", 0, 0.0003032684326171875], ["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND ( s.stock.name == \"电力\" OR s.stock.name == \"安泰集团\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002658367156982422]]}, {"query": "京能电力和安泰集团上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '京能电力' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '安泰集团' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND ( s.stock.name == \"电力\" OR s.stock.name == \"安泰集团\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013604164123535156], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"电力\" OR s.stock.name == \"安泰集团\" ) AND s.stock.name == \"能电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013775825500488281]]}, {"query": "媒体和娱乐和高科技产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017881393432617188], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015189647674560547]]}, {"query": "媒体和娱乐和高科技产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.0003027915954589844], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002493858337402344]]}, {"query": "媒体和娱乐和高科技产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.001462697982788086], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.00147247314453125]]}, {"query": "食品和饮料和化学的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化学' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"化学\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0019636154174804688], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"化学\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN temp\nLIMIT 50", 0, 0.002483844757080078], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"化学\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN temp\nLIMIT 50", 0, 0.002307415008544922], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"化学\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002038717269897461]]}, {"query": "吕西门和李黎丘的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '吕西门' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '李黎丘' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕西门\" OR fm.fund_manager.name == \"李黎丘\" ) AND fm.fund_manager.name == \"吕西门\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕西门\" OR fm.fund_manager.name == \"李黎丘\" ) AND fm.fund_manager.name == \"李黎丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吕西门\" OR fm.fund_manager.name == \"李黎丘\" ) \nRETURN temp\nLIMIT 50", 0, 0.004452943801879883], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕西门\" OR fm.fund_manager.name == \"李黎丘\" ) AND fm.fund_manager.name == \"吕西门\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"李黎丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0038154125213623047], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"吕西门\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"李黎丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"吕西门\" OR fm.fund_manager.name == \"李黎丘\" ) \nRETURN temp\nLIMIT 50", 0, 0.004041910171508789], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕西门\" OR fm.fund_manager.name == \"李黎丘\" ) AND fm.fund_manager.name == \"吕西门\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"吕西门\" OR fm.fund_manager.name == \"李黎丘\" ) AND fm.fund_manager.name == \"李黎丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0037140846252441406]]}, {"query": "航空公司和金属和矿业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金属和矿业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013580322265625], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空\" AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0013728141784667969]]}, {"query": "航空公司和金属和矿业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空公司' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金属和矿业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013816356658935547], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空\" AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014350414276123047]]}, {"query": "纺织品和服装和化学的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化学' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"化学\" ) AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015769004821777344], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"化学\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001524209976196289]]}, {"query": "纺织品和服装和化学的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '化学' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"化学\" ) AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015633106231689453], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"化学\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017120838165283203]]}, {"query": "纺织品和服装和航空航天产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"航空航天\" ) AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.002015829086303711], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"航空航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015964508056640625]]}, {"query": "纺织品和服装和航空航天产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"航空航天\" ) AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016002655029296875], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"航空航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016384124755859375]]}, {"query": "纺织品和服装和航空航天产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航空航天' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"服装\" OR indus.industry.name == \"航空航天\" ) AND indus.industry.name == \"纺织\" \nRETURN temp\nLIMIT 50", 0, 0.00039768218994140625], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND ( indus.industry.name == \"服装\" OR indus.industry.name == \"航空航天\" ) \nRETURN temp\nLIMIT 50", 0, 0.000339508056640625]]}, {"query": "媒体和娱乐和农业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '媒体和娱乐' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"娱乐\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN temp\nLIMIT 50", 0, 0.0023980140686035156], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"娱乐\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN temp\nLIMIT 50", 0, 0.0024046897888183594], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"娱乐\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0019838809967041016], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"娱乐\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0019614696502685547]]}, {"query": "金牛化工和华鑫股份的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '金牛化工' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '华鑫股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012640953063964844], ["MATCH (s:stock)\nWHERE s.stock.name == \"化工\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012829303741455078]]}, {"query": "金牛化工和华鑫股份的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '金牛化工' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '华鑫股份' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"化工\" \nRETURN temp\nLIMIT 50", 0, 0.0003001689910888672], ["MATCH (s:stock)\nWHERE s.stock.name == \"化工\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.0002608299255371094]]}, {"query": "三峡新材和广西能源上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '三峡新材' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '广西能源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"三峡新材\" \nRETURN s.stock\nLIMIT 50", 0, 0.001306295394897461], ["MATCH (s:stock)\nWHERE s.stock.name == \"三峡新材\" AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016560554504394531]]}, {"query": "三峡新材和广西能源上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '三峡新材' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '广西能源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"三峡新材\" AND s.stock.name == \"能源\" \nRETURN temp\nLIMIT 50", 0, 0.00031566619873046875], ["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"三峡新材\" \nRETURN temp\nLIMIT 50", 0, 0.00023436546325683594]]}, {"query": "酒精饮料和建筑的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '建筑' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"建筑\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"建筑\" ) \nRETURN temp\nLIMIT 50", 0, 0.0024030208587646484], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"建筑\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"建筑\" ) AND indus.industry.name == \"建筑\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002122163772583008], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"建筑\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"建筑\" ) AND indus.industry.name == \"建筑\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"建筑\" ) \nRETURN temp\nLIMIT 50", 0, 0.0022745132446289062], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"建筑\" ) AND indus.industry.name == \"饮料\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"建筑\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002110719680786133]]}, {"query": "船舶和海运和运输和物流的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0013082027435302734], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012886524200439453]]}, {"query": "船舶和海运和运输和物流的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '运输和物流' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001383066177368164], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013566017150878906]]}, {"query": "饭店和度假村和纺织品和服装的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '饭店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.00144195556640625], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014319419860839844]]}, {"query": "饭店和度假村和纺织品和服装的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '饭店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015447139739990234], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016779899597167969]]}, {"query": "饭店和度假村和纺织品和服装的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '饭店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN temp\nLIMIT 50", 0, 0.00030612945556640625], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN temp\nLIMIT 50", 0, 0.00023889541625976562]]}, {"query": "海立股份和龙江交通上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '海立股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '龙江交通' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"海立股份\" AND s.stock.name == \"交通\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016827583312988281], ["MATCH (s:stock)\nWHERE s.stock.name == \"交通\" AND s.stock.name == \"海立股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013077259063720703]]}, {"query": "海立股份和龙江交通上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '海立股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '龙江交通' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"交通\" AND s.stock.name == \"海立股份\" \nRETURN temp\nLIMIT 50", 0, 0.0003039836883544922], ["MATCH (s:stock)\nWHERE s.stock.name == \"海立股份\" AND s.stock.name == \"交通\" \nRETURN temp\nLIMIT 50", 0, 0.00022554397583007812]]}, {"query": "金健米业和茂业商业的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '金健米业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '茂业商业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金健米业\" AND s.stock.name == \"商业\" \nRETURN s.stock\nLIMIT 50", 0, 0.00164794921875], ["MATCH (s:stock)\nWHERE s.stock.name == \"商业\" AND s.stock.name == \"金健米业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012767314910888672]]}]