[{"query": "运输和物流产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '运输和物流' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015878677368164062], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017161369323730469]]}, {"query": "有哪些上游是运输和物流产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '运输和物流' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017163753509521484], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015120506286621094]]}, {"query": "朱东门基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001596212387084961], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015935897827148438]]}, {"query": "有哪些托管给朱东门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016140937805175781], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014760494232177734]]}, {"query": "航空航天产业的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '航空航天' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.004477262496948242], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.004420042037963867]]}, {"query": "孙梁丘基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孙梁丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孙梁丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016181468963623047], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孙梁丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015604496002197266]]}, {"query": "投司技公限股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '投司技公限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"投司技公限\" AND ( s.stock.name == \"技公\" OR s.stock.name == \"限股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001374959945678711], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"技公\" OR s.stock.name == \"限股\" ) AND s.stock.name == \"投司技公限\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013346672058105469]]}, {"query": "有哪些股东是投司技公限股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '投司技公限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"投司技公限\" AND ( s.stock.name == \"技公\" OR s.stock.name == \"限股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003173351287841797], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"技公\" OR s.stock.name == \"限股\" ) AND s.stock.name == \"投司技公限\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003082752227783203]]}, {"query": "有哪些托管给吴南宫基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吴南宫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴南宫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015327930450439453], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吴南宫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014553070068359375]]}, {"query": "有哪些托管给陈公治基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陈公治' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陈公治\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014836788177490234], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陈公治\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014362335205078125]]}, {"query": "有哪些托管给华司空基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '华司空' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"华司空\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014591217041015625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"华司空\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014371871948242188]]}, {"query": "有哪些托管给吕岳基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吕岳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吕岳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016124248504638672], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吕岳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015392303466796875]]}, {"query": "服药电地有股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '服药电地有' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"服药\" AND ( s.stock.name == \"药电\" OR s.stock.name == \"地有\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013396739959716797], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"药电\" OR s.stock.name == \"地有\" ) AND s.stock.name == \"服药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012924671173095703]]}, {"query": "有哪些股东是服药电地有股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '服药电地有' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"药电\" OR s.stock.name == \"地有\" ) AND s.stock.name == \"服药\" \nRETURN n.name\nLIMIT 50", 0, 0.0003025531768798828], ["MATCH (s:stock)\nWHERE s.stock.name == \"服药\" AND ( s.stock.name == \"药电\" OR s.stock.name == \"地有\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00027871131896972656]]}, {"query": "有哪些托管给褚上官基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013797283172607422], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014522075653076172]]}, {"query": "务发金制股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务发金制' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"务发\" AND s.stock.name == \"制股\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013494491577148438], ["MATCH (s:stock)\nWHERE s.stock.name == \"制股\" AND s.stock.name == \"务发\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012900829315185547]]}, {"query": "有哪些关联兰生股份股票的产业", "golden": "MATCH (s1:stock)-[a:associate]->(n2:industry) WHERE s1.stock.name == '兰生股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( s.stock.name == \"兰生股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"兰生股份\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0025491714477539062], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"兰生股份\" AND ( s.stock.name == \"兰生股\" OR s.stock.name == \"份股\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0023643970489501953]]}, {"query": "有哪些托管给何岳基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何岳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何岳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016629695892333984], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何岳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0022106170654296875]]}, {"query": "张云基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '张云' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"张云\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016317367553710938], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"张云\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015082359313964844]]}, {"query": "有哪些托管给张云基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '张云' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"张云\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014529228210449219], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"张云\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013914108276367188]]}, {"query": "国泰中证细分化工产业主题ETF联接A基金托管给的基金代理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '国泰中证细分化工产业主题ETF联接A' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"化工\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012698173522949219], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"化工\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012402534484863281]]}, {"query": "有哪些托管给秦辕门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦辕门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦辕门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001482248306274414], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦辕门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001409292221069336]]}, {"query": "发产造司股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发产造司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"产造\" OR s.stock.name == \"司股\" ) AND s.stock.name == \"发产造司\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013418197631835938], ["MATCH (s:stock)\nWHERE s.stock.name == \"发产造司\" AND ( s.stock.name == \"产造\" OR s.stock.name == \"司股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0012233257293701172]]}, {"query": "有哪些股东是发产造司股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发产造司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"发产造司\" AND ( s.stock.name == \"产造\" OR s.stock.name == \"司股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003268718719482422], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"产造\" OR s.stock.name == \"司股\" ) AND s.stock.name == \"发产造司\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00031304359436035156]]}, {"query": "卫微生基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '卫微生' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"卫微生\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015873908996582031], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"卫微生\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014820098876953125]]}, {"query": "龙建股份股票涉及的公告", "golden": "MATCH (s1:stock)-[iv:involve]->(i2:information) WHERE s1.stock.name == '龙建股份' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙建股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001672506332397461], ["MATCH (s:stock)\nWHERE s.stock.name == \"龙建股份\" AND ( s.stock.name == \"龙建股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001739501953125]]}, {"query": "有哪些托管给吴云基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吴云' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吴云\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015003681182861328], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吴云\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014617443084716797]]}, {"query": "有哪些包括华泰股份股票的行业", "golden": "MATCH (s1:stock)-[bt:belong_to]->(t2:trade) WHERE s1.stock.name == '华泰股份' RETURN t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"华泰股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"华泰股份\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0023794174194335938], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"华泰股份\" AND ( s.stock.name == \"华泰股\" OR s.stock.name == \"份股\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.0021333694458007812]]}, {"query": "资份股能股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资份股能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资份股能\" AND ( s.stock.name == \"资份\" OR s.stock.name == \"股能\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013027191162109375], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"资份\" OR s.stock.name == \"股能\" ) AND s.stock.name == \"资份股能\" \nRETURN s.stock\nLIMIT 50", 0, 0.001390218734741211]]}, {"query": "有哪些股东是资份股能股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资份股能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资份股能\" AND ( s.stock.name == \"资份\" OR s.stock.name == \"股能\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002865791320800781], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"资份\" OR s.stock.name == \"股能\" ) AND s.stock.name == \"资份股能\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002741813659667969]]}, {"query": "有哪些托管给秦赫连基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015325546264648438], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014286041259765625]]}, {"query": "陈谷梁基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陈谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陈谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014960765838623047], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陈谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014820098876953125]]}, {"query": "有哪些托管给章端木基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '章端木' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"章端木\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015044212341308594], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"章端木\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001737356185913086]]}, {"query": "融限据股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融限据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"融限\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"融限据\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014390945434570312], ["MATCH (s:stock)\nWHERE s.stock.name == \"融限据\" AND ( s.stock.name == \"融限\" OR s.stock.name == \"据股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001420736312866211]]}, {"query": "有哪些股东是融限据股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融限据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"融限\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"融限据\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030303001403808594], ["MATCH (s:stock)\nWHERE s.stock.name == \"融限据\" AND ( s.stock.name == \"融限\" OR s.stock.name == \"据股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00031113624572753906]]}, {"query": "股公源融造股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '股公源融造' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股公源融造\" AND ( s.stock.name == \"股公\" OR s.stock.name == \"源融\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013418197631835938], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"股公\" OR s.stock.name == \"源融\" ) AND s.stock.name == \"股公源融造\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013225078582763672]]}, {"query": "有哪些股东是股公源融造股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '股公源融造' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股公源融造\" AND ( s.stock.name == \"股公\" OR s.stock.name == \"源融\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00030040740966796875], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"股公\" OR s.stock.name == \"源融\" ) AND s.stock.name == \"股公源融造\" \nRETURN n.name\nLIMIT 50", 0, 0.000255584716796875]]}, {"query": "喻谷梁基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '喻谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"喻谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013947486877441406], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"喻谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014841556549072266]]}, {"query": "有哪些提到天通股份股票的公告", "golden": "MATCH (s1:stock)-[iv:involve]->(i2:information) WHERE s1.stock.name == '天通股份' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"天通股份\" AND ( s.stock.name == \"天通股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016660690307617188], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"天通股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"天通股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015859603881835938]]}, {"query": "有哪些托管给赵洛阳基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵洛阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵洛阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001580953598022461], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵洛阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00146484375]]}, {"query": "建电司资子股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建电司资子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"电司\" OR s.stock.name == \"资子\" ) AND s.stock.name == \"建电司资子\" \nRETURN s.stock\nLIMIT 50", 0, 0.001447439193725586], ["MATCH (s:stock)\nWHERE s.stock.name == \"建电司资子\" AND ( s.stock.name == \"电司\" OR s.stock.name == \"资子\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014226436614990234]]}, {"query": "有哪些股东是建电司资子股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '建电司资子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"电司\" OR s.stock.name == \"资子\" ) AND s.stock.name == \"建电司资子\" \nRETURN n.name\nLIMIT 50", 0, 0.00031447410583496094], ["MATCH (s:stock)\nWHERE s.stock.name == \"建电司资子\" AND ( s.stock.name == \"电司\" OR s.stock.name == \"资子\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002703666687011719]]}, {"query": "何万俟基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何万俟' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何万俟\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014986991882324219], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何万俟\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015757083892822266]]}, {"query": "技资房建股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技资房建' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"技资\" OR s.stock.name == \"房建\" ) AND s.stock.name == \"技资房建\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014410018920898438], ["MATCH (s:stock)\nWHERE s.stock.name == \"技资房建\" AND ( s.stock.name == \"技资\" OR s.stock.name == \"房建\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.00146484375]]}, {"query": "有哪些股东是技资房建股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技资房建' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"技资房建\" AND ( s.stock.name == \"技资\" OR s.stock.name == \"房建\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002856254577636719], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"技资\" OR s.stock.name == \"房建\" ) AND s.stock.name == \"技资房建\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00021386146545410156]]}, {"query": "陈费莫基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陈费莫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陈费莫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016973018646240234], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陈费莫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014023780822753906]]}, {"query": "有哪些托管给陈费莫基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陈费莫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陈费莫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014026165008544922], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陈费莫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001382589340209961]]}, {"query": "魏西门基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏西门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏西门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001527547836303711], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏西门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001489400863647461]]}, {"query": "赵谷梁基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001440286636352539], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016977787017822266]]}, {"query": "有哪些管理易方达科汇灵活配置混合基金的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '易方达科汇灵活配置混合' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013470649719238281], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013713836669921875]]}, {"query": "迪马股份股票的股东", "golden": "MATCH (s1:stock)<-[iso:is_stockholder_of]-(sh2:stockholder) WHERE s1.stock.name == '迪马股份' RETURN sh2.stockholder.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"迪马股份\" AND ( s.stock.name == \"迪马股\" OR s.stock.name == \"份股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00030303001403808594], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"迪马股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"迪马股份\" \nRETURN n.name\nLIMIT 50", 0, 0.0002734661102294922]]}, {"query": "国泰中证港股通50ETF发起联接C基金的上市公司", "golden": "MATCH (pof1:public_offering_fund)-[h:hold]->(s2:stock) WHERE pof1.public_offering_fund.name == '国泰中证港股通50ETF发起联接C' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股通\" AND s.stock.name == \"国泰君安\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013284683227539062], ["MATCH (s:stock)\nWHERE s.stock.name == \"国泰君安\" AND s.stock.name == \"股通\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016531944274902344]]}, {"query": "有哪些属于国泰中证港股通50ETF发起联接C基金的股票", "golden": "MATCH (pof1:public_offering_fund)-[h:hold]->(s2:stock) WHERE pof1.public_offering_fund.name == '国泰中证港股通50ETF发起联接C' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"国泰君安\" AND s.stock.name == \"股通\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016434192657470703], ["MATCH (s:stock)\nWHERE s.stock.name == \"股通\" AND s.stock.name == \"国泰君安\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012671947479248047]]}]