[{"query": "哪个是在媒体和娱乐和酒精饮料和钢铁行业中最低价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['媒体和娱乐', '酒精饮料', '钢铁'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.002025127410888672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND t.trade.name == \"饮料\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001775503158569336], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0017642974853515625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016121864318847656], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND t.trade.name == \"饮料\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0015490055084228516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"饮料\" AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001603841781616211]]}, {"query": "哪个是在ST澄星和金发科技和云煤能源股票中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['ST澄星', '金发科技', '云煤能源'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"发科\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0017495155334472656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"发科\" AND s.stock.name == \"能源\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0015325546264648438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"发科\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.001470804214477539], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" AND s.stock.name == \"发科\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.001500844955444336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"发科\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0015518665313720703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"发科\" AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.0014357566833496094]]}, {"query": "哪个是在运输和物流和电脑硬件行业中收盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['运输和物流', '电脑硬件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005235433578491211], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00522923469543457]]}, {"query": "在运输和物流和电脑硬件行业中收盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['运输和物流', '电脑硬件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0052492618560791016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007101297378540039]]}, {"query": "在西藏旅游和航天信息中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['西藏旅游', '航天信息'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"航天信息\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.02105093002319336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"旅游\" OR s.stock.name == \"航天信息\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.018004894256591797]]}, {"query": "在西藏旅游和航天信息中涨跌幅最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['西藏旅游', '航天信息'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"航天信息\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.01923227310180664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"旅游\" OR s.stock.name == \"航天信息\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.021175384521484375]]}, {"query": "哪个是在西藏旅游和航天信息中涨跌幅最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['西藏旅游', '航天信息'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"航天信息\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.020368337631225586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"旅游\" OR s.stock.name == \"航天信息\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.023337602615356445]]}, {"query": "在银行和船舶和海运和媒体和娱乐行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['银行', '船舶和海运', '媒体和娱乐'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"银行\" OR indus.industry.name == \"船舶\" ) AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.2006995677947998], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"银行\" OR indus.industry.name == \"船舶\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.1774580478668213], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND ( indus.industry.name == \"银行\" OR indus.industry.name == \"船舶\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.1758873462677002], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"银行\" OR indus.industry.name == \"船舶\" ) AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.17656898498535156], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"银行\" OR indus.industry.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.18329977989196777], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND ( indus.industry.name == \"银行\" OR indus.industry.name == \"船舶\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.1756761074066162]]}, {"query": "在三峡水利和青海华鼎股票中涨跌幅最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['三峡水利', '青海华鼎'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"三峡水利\" OR s.stock.name == \"青海华鼎\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.021010875701904297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"三峡水利\" OR s.stock.name == \"青海华鼎\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.024123430252075195]]}, {"query": "哪个是在家居用品和金属和矿业和工业中最高价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['家居用品', '金属和矿业', '工业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001903533935546875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0017175674438476562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0018482208251953125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"家居\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016484260559082031], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0017256736755371094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0014789104461669922]]}, {"query": "哪个是在宏达股份和好当家上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['宏达股份', '好当家'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宏达股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.02026653289794922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宏达股份\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01746821403503418]]}, {"query": "在宏达股份和好当家上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['宏达股份', '好当家'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宏达股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.019988059997558594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宏达股份\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.019452333450317383]]}, {"query": "在农产品和化学和电力中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['农产品', '化学', '电力'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"化学\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01837325096130371], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"化学\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021793365478515625]]}, {"query": "哪个是在农产品和化学和电力中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['农产品', '化学', '电力'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"化学\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020932674407958984], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"化学\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018816709518432617]]}, {"query": "在农产品和化学和电力中开盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['农产品', '化学', '电力'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"农产品\" OR s.stock.name == \"化学\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01830601692199707], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"农产品\" OR s.stock.name == \"化学\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02253580093383789]]}, {"query": "在亚星客车和重庆水务和浙江东方中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['亚星客车', '重庆水务', '浙江东方'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浙江东\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"亚星客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018596649169921875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"亚星客车\" AND s.stock.name == \"浙江东\" \nRETURN s.stock\nLIMIT 50", 0, 0.018698930740356445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浙江东\" AND s.stock.name == \"亚星客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017664432525634766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"亚星客车\" AND s.stock.name == \"浙江东\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016675233840942383], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"亚星客车\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浙江东\" \nRETURN s.stock\nLIMIT 50", 0, 0.016124963760375977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浙江东\" AND s.stock.name == \"亚星客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018393993377685547]]}, {"query": "哪个是在亚星客车和重庆水务和浙江东方中成交量最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['亚星客车', '重庆水务', '浙江东方'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浙江东\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"亚星客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018460750579833984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"亚星客车\" AND s.stock.name == \"浙江东\" \nRETURN s.stock\nLIMIT 50", 0, 0.016806840896606445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浙江东\" AND s.stock.name == \"亚星客车\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017180442810058594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"亚星客车\" AND s.stock.name == \"浙江东\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015984296798706055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"亚星客车\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浙江东\" \nRETURN s.stock\nLIMIT 50", 0, 0.01578807830810547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浙江东\" AND s.stock.name == \"亚星客车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018558502197265625]]}, {"query": "在酒精饮料和运输和物流和媒体和娱乐行业中收盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['酒精饮料', '运输和物流', '媒体和娱乐'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016930103302001953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016391277313232422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0016028881072998047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015671253204345703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015616416931152344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015039443969726562]]}, {"query": "在酒精饮料和运输和物流和媒体和娱乐行业中收盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['酒精饮料', '运输和物流', '媒体和娱乐'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016400814056396484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0015804767608642578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0015990734100341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016372203826904297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015723705291748047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016682147979736328]]}, {"query": "哪个是在酒精饮料和运输和物流和媒体和娱乐行业中收盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['酒精饮料', '运输和物流', '媒体和娱乐'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015611648559570312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001546621322631836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0014328956604003906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016632080078125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016379356384277344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"运输\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013959407806396484]]}, {"query": "在香溢融通和厦门钨业上市公司中最高价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['香溢融通', '厦门钨业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"融通\" OR s.stock.name == \"厦门钨业\" ) \nRETURN s.stock\nLIMIT 50", 1, 0.02097177505493164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"融通\" OR s.stock.name == \"厦门钨业\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 1, 0.02012157440185547]]}, {"query": "哪个是在香溢融通和厦门钨业上市公司中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['香溢融通', '厦门钨业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"融通\" OR s.stock.name == \"厦门钨业\" ) \nRETURN s.stock\nLIMIT 50", 1, 0.02007770538330078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"融通\" OR s.stock.name == \"厦门钨业\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 1, 0.019638538360595703]]}, {"query": "在香溢融通和厦门钨业上市公司中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['香溢融通', '厦门钨业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"融通\" OR s.stock.name == \"厦门钨业\" ) \nRETURN s.stock\nLIMIT 50", 1, 0.0189056396484375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"融通\" OR s.stock.name == \"厦门钨业\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 1, 0.020270347595214844]]}, {"query": "在汽车和农业和家庭和个人用品行业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车', '农业', '家庭和个人用品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"汽车\" OR indus.industry.name == \"农业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.19599103927612305], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"农业\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.1951749324798584]]}, {"query": "在中储股份和大东方和信达地产中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中储股份', '大东方', '信达地产'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"中储股份\" AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.02123570442199707], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"中储股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.002176523208618164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND s.stock.name == \"中储股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020933151245117188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" AND s.stock.name == \"中储股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020139217376708984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中储股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.018694400787353516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中储股份\" AND s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018247365951538086]]}, {"query": "在中储股份和大东方和信达地产中最高价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中储股份', '大东方', '信达地产'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"中储股份\" AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.017389774322509766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"中储股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018703937530517578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND s.stock.name == \"中储股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018186569213867188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" AND s.stock.name == \"中储股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016472339630126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中储股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.015345096588134766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中储股份\" AND s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015779495239257812]]}]