[{"query": "有哪些产业上游的产业关联南京医药", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '南京医药' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"南京医药\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002875328063964844], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"南京医药\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002799034118652344]]}, {"query": "关联大众公用的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大众公用' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"大众公用\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002613067626953125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"大众公用\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00019311904907226562]]}, {"query": "有哪些产业下游的产业关联大众公用", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大众公用' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"大众公用\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002639293670654297], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"大众公用\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0001800060272216797]]}, {"query": "上游是医疗设备的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '医疗设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013821125030517578], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015821456909179688]]}, {"query": "有哪些产业上游的产业上游是医疗设备", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '医疗设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014271736145019531], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"医疗\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014564990997314453]]}, {"query": "关联宁波韵升的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '宁波韵升' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"宁波韵升\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.000324249267578125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"宁波韵升\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00024271011352539062]]}, {"query": "有哪些产业下游的产业关联宁波韵升", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '宁波韵升' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"宁波韵升\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002562999725341797], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"宁波韵升\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00022673606872558594]]}, {"query": "关联东风汽车的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '东风汽车' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"东风汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002808570861816406], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"东风汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002803802490234375]]}, {"query": "有哪些产业下游的产业关联东风汽车", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '东风汽车' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"东风汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002758502960205078], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"东风汽车\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021839141845703125]]}, {"query": "上游是金属和矿业的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '金属和矿业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016241073608398438], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015330314636230469]]}, {"query": "有哪些产业上游的产业上游是金属和矿业", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '金属和矿业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN t.trade.name,indus1.industry.name\nLIMIT 50", 0, 0.00029921531677246094], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN t.trade.name,indus1.industry.name\nLIMIT 50", 0, 0.0002624988555908203]]}, {"query": "上游是珠宝和宝石的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '珠宝和宝石' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013899803161621094], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001331329345703125]]}, {"query": "有哪些产业上游的产业上游是珠宝和宝石", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '珠宝和宝石' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0013074874877929688], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0014197826385498047]]}, {"query": "上游是航空航天的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '航空航天' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002429485321044922], ["MATCH (indus:industry)<-[a:affect]-(indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00019979476928710938], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021982192993164062], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00028824806213378906]]}, {"query": "关联长春燃气的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长春燃气' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"长春燃气\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002446174621582031], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"长春燃气\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00020170211791992188]]}, {"query": "有哪些产业下游的产业关联长春燃气", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '长春燃气' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"长春燃气\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002675056457519531], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"长春燃气\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002110004425048828]]}, {"query": "上游是电力的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电力' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016396045684814453], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020890235900878906]]}, {"query": "有哪些产业上游的产业上游是电力", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电力' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016896724700927734], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001932382583618164]]}, {"query": "关联鲁抗医药的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '鲁抗医药' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"鲁抗医药\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002841949462890625], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"鲁抗医药\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021600723266601562]]}, {"query": "有哪些产业上游的产业关联鲁抗医药", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '鲁抗医药' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"鲁抗医药\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00028896331787109375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"鲁抗医药\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002014636993408203]]}, {"query": "上游是石油和天然气的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '石油和天然气' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019071102142333984], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001577138900756836]]}, {"query": "有哪些产业上游的产业上游是石油和天然气", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '石油和天然气' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00029397010803222656], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"石油\" OR indus.industry.name == \"天然\" ) \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00024890899658203125]]}, {"query": "关联江苏索普的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '江苏索普' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"江苏索普\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00038123130798339844], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"江苏索普\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003581047058105469]]}, {"query": "有哪些产业上游的产业关联江苏索普", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '江苏索普' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"江苏索普\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002818107604980469], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"江苏索普\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00022673606872558594]]}, {"query": "关联上海梅林的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海梅林' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"上海梅林\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00038743019104003906], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"上海梅林\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003135204315185547]]}, {"query": "有哪些产业上游的产业关联上海梅林", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海梅林' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"上海梅林\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00028586387634277344], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"上海梅林\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00023102760314941406]]}, {"query": "关联广汇能源的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广汇能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018155574798583984], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002087831497192383]]}, {"query": "有哪些产业上游的产业关联广汇能源", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '广汇能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018315315246582031], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0024499893188476562]]}, {"query": "上游是运输和物流的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '运输和物流' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001638174057006836], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015687942504882812]]}, {"query": "有哪些产业上游的产业上游是运输和物流", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '运输和物流' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014431476593017578], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014312267303466797]]}, {"query": "关联上海银行的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013778209686279297], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015170574188232422]]}, {"query": "有哪些产业下游的产业关联上海银行", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014278888702392578], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001383066177368164]]}, {"query": "关联百川能源的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '百川能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018649101257324219], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002310514450073242]]}, {"query": "有哪些产业下游的产业关联百川能源", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '百川能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001817941665649414], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021696090698242188]]}, {"query": "关联*ST庞大的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '*ST庞大' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003892183303833008], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004098415374755859]]}, {"query": "有哪些产业下游的产业关联*ST庞大", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '*ST庞大' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037550926208496094], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004065036773681641]]}, {"query": "关联ST建元的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST建元' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004018545150756836], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003875732421875]]}, {"query": "有哪些产业下游的产业关联ST建元", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST建元' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003733396530151367], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037174224853515625]]}, {"query": "关联上港集团的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上港集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"上港集\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002865791320800781], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"上港集\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002942085266113281]]}, {"query": "有哪些产业下游的产业关联上港集团", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上港集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"上港集\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00029921531677246094], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"上港集\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002617835998535156]]}, {"query": "关联上汽集团的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上汽集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0039942264556884766], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003883838653564453]]}, {"query": "有哪些产业下游的产业关联上汽集团", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上汽集团' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037925243377685547], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0037331581115722656]]}, {"query": "关联宇通重工的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '宇通重工' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0031194686889648438], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036230087280273438]]}, {"query": "有哪些产业下游的产业关联宇通重工", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '宇通重工' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003164529800415039], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003059864044189453]]}, {"query": "上游是能源的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '能源' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017664432525634766], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0022101402282714844]]}, {"query": "有哪些产业上游的产业上游是能源", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '能源' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019283294677734375], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002112150192260742]]}, {"query": "关联马钢股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '马钢股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"马钢股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00026726722717285156], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"马钢股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00019359588623046875]]}, {"query": "有哪些产业上游的产业关联马钢股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '马钢股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"马钢股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00027370452880859375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"马钢股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002548694610595703]]}, {"query": "关联浦发银行的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '浦发银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"浦发银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002586841583251953], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"浦发银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00024819374084472656]]}, {"query": "有哪些产业上游的产业关联浦发银行", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '浦发银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"浦发银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00024628639221191406], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"浦发银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.000232696533203125]]}, {"query": "关联国新文化的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '国新文化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017724037170410156], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015511512756347656]]}, {"query": "有哪些产业上游的产业关联国新文化", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '国新文化' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015799999237060547], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"文化\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016231536865234375]]}, {"query": "上游是制造的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '制造' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017533302307128906], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020029544830322266]]}, {"query": "有哪些产业上游的产业上游是制造", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '制造' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016989707946777344], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002152681350708008]]}, {"query": "关联大有能源的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大有能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"有能\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002694129943847656], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"有能\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00025200843811035156]]}, {"query": "有哪些产业下游的产业关联大有能源", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '大有能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"有能\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003044605255126953], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"有能\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00028443336486816406]]}]