[{"query": "2021年2月13日公用事业行业的开盘价和最低价和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2021-02-13') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006132125854492188], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0003542900085449219], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012083053588867188], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01369619369506836]]}, {"query": "2021年2月13日的公用事业行业的开盘价和最低价和涨跌幅的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2021-02-13') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005712509155273438], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004475116729736328], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012878179550170898], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-2-13\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012184619903564453]]}, {"query": "2022年7月31日的化妆品行业的最高价和最低价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化妆品' AND td.trade_data.`date` == date('2022-07-31') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.minimum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-31\" ) AND indus.industry.name == \"化妆品\" \nRETURN td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.020952939987182617], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date( \"2022-7-31\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.02045750617980957]]}, {"query": "化妆品行业的最高价和最低价和更新时间在2022年7月31日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化妆品' AND td.trade_data.`date` == date('2022-07-31') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.minimum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date( \"2022-7-31\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019980430603027344], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-31\" ) AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.019419193267822266]]}, {"query": "2022年7月31日的化妆品行业的最高价和最低价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化妆品' AND td.trade_data.`date` == date('2022-07-31') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.minimum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date( \"2022-7-31\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021314620971679688], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-7-31\" ) AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.019280672073364258]]}, {"query": "船舶和海运行业的收盘价和最高价和更新时间在2022年4月26日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2022-04-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-26\" ) AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019085407257080078], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date( \"2022-4-26\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001848459243774414]]}, {"query": "2022年4月26日船舶和海运行业的收盘价和最高价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2022-04-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-26\" ) AND t.trade.name == \"船舶\" \nRETURN td.trade_data.maximum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0018045902252197266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date( \"2022-4-26\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0016465187072753906]]}, {"query": "2022年4月26日的船舶和海运行业的收盘价和最高价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2022-04-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-26\" ) AND t.trade.name == \"船舶\" \nRETURN td.trade_data.maximum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0017781257629394531], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date( \"2022-4-26\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0016551017761230469]]}, {"query": "2022年4月26日的船舶和海运行业的收盘价和最高价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '船舶和海运' AND td.trade_data.`date` == date('2022-04-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-26\" ) AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018973350524902344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"船舶\" AND td.trade_data.`date` == date( \"2022-4-26\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017399787902832031]]}, {"query": "2023年4月17日的酒店和度假村行业的最低价和开盘价和最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-04-17') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-17\" ) AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020525455474853516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-4-17\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018575191497802734]]}, {"query": "2023年4月17日的酒店和度假村行业的最低价和开盘价和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-04-17') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-4-17\" ) \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.002039670944213867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-17\" ) AND t.trade.name == \"酒店\" \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018148422241210938]]}, {"query": "2023年4月17日酒店和度假村行业的最低价和开盘价和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-04-17') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-4-17\" ) \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0019519329071044922], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-17\" ) AND t.trade.name == \"酒店\" \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0018172264099121094]]}, {"query": "酒店和度假村行业的最低价和开盘价和最高价在2023年4月17日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-04-17') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-4-17\" ) AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017366409301757812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-4-17\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.001611471176147461]]}, {"query": "电子设备的最低价和更新时间和涨跌幅在2020年11月7日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2020-11-07') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-11-7\" ) AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019385814666748047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date( \"2020-11-7\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019526481628417969]]}, {"query": "医疗保健行业的最低价和开盘价和涨跌幅在2020年6月30日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2020-06-30') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.opening_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-6-30\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.001978158950805664], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2020-6-30\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016994476318359375]]}, {"query": "2022年8月11日的航空航天的更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空航天' AND td.trade_data.`date` == date('2022-08-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0026273727416992188], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0020864009857177734]]}, {"query": "2022年8月11日的航空航天的更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空航天' AND td.trade_data.`date` == date('2022-08-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN n.`date`\nLIMIT 50", 0, 0.00045800209045410156], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN n.`date`\nLIMIT 50", 0, 0.00032782554626464844]]}, {"query": "南京银行的涨跌幅和最高价在2020年11月21日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '南京银行' AND sd.stock_data.`date` == date('2020-11-21') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2020-11-21\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0020728111267089844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-11-21\" ) AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018720626831054688]]}, {"query": "2023年11月28日的*ST凯乐的收盘价和涨跌幅和开盘价的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '*ST凯乐' AND sd.stock_data.`date` == date('2023-11-28') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price, sd.stock_data.range, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05255699157714844], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05091238021850586], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006411075592041016], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.00047516822814941406]]}, {"query": "2023年11月28日的*ST凯乐的收盘价和涨跌幅和开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '*ST凯乐' AND sd.stock_data.`date` == date('2023-11-28') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price, sd.stock_data.range, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05289006233215332], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.05092453956604004], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006322860717773438], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-28\" ) AND sd.stock_data.`date` == date( \"2000-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005154609680175781]]}, {"query": "2021年7月21日医疗保健行业的收盘价和最高价和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2021-07-21') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2021-7-21\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019614696502685547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-7-21\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.maximum_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018832683563232422]]}, {"query": "2021年7月21日的医疗保健行业的收盘价和最高价和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2021-07-21') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2021-7-21\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019011497497558594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-7-21\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.maximum_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017676353454589844]]}, {"query": "2023年10月20日的信息技术的最高价和更新时间和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-10-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-20\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.`date`,td.trade_data.closing_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.002264261245727539], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2023-10-20\" ) \nRETURN td.trade_data.`date`,td.trade_data.closing_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.0019102096557617188]]}, {"query": "2023年10月20日的信息技术的最高价和更新时间和收盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-10-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-20\" ) AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.001901388168334961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2023-10-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015950202941894531]]}, {"query": "信息技术的最高价和更新时间和收盘价在2023年10月20日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2023-10-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-20\" ) AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0022268295288085938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2023-10-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018689632415771484]]}, {"query": "2021年12月22日的消费品行业的更新时间和涨跌幅和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '消费品' AND td.trade_data.`date` == date('2021-12-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.range, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-22\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005629062652587891], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.016021013259887695], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-22\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013971805572509766], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-22\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-22\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005507469177246094]]}, {"query": "2022年10月4日的化学行业的更新时间和开盘价和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2022-10-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2022-10-4\" ) \nRETURN td.trade_data.opening_price,td.trade_data.minimum_price\nLIMIT 50", 1, 0.019405126571655273], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-4\" ) AND indus.industry.name == \"化学\" \nRETURN td.trade_data.opening_price,td.trade_data.minimum_price\nLIMIT 50", 1, 0.020460128784179688]]}, {"query": "2022年10月4日的化学行业的更新时间和开盘价和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2022-10-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2022-10-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018630266189575195], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-4\" ) AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.018491029739379883]]}, {"query": "化学行业的更新时间和开盘价和最低价在2022年10月4日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2022-10-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2022-10-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01905345916748047], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-4\" ) AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.017930984497070312]]}, {"query": "2021年7月29日的上海石化股票的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海石化' AND sd.stock_data.`date` == date('2021-07-29') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-7-29\" ) AND s.stock.name == \"上海石化\" \nRETURN sd.stock_data.volume\nLIMIT 50", 1, 0.01719951629638672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海石化\" AND sd.stock_data.`date` == date( \"2021-7-29\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 1, 0.017117977142333984]]}, {"query": "2021年7月29日的上海石化股票的成交量的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海石化' AND sd.stock_data.`date` == date('2021-07-29') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海石化\" AND sd.stock_data.`date` == date( \"2021-7-29\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01599884033203125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-7-29\" ) AND s.stock.name == \"上海石化\" \nRETURN s.stock\nLIMIT 50", 0, 0.016259431838989258]]}, {"query": "2021年7月29日上海石化股票的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海石化' AND sd.stock_data.`date` == date('2021-07-29') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-7-29\" ) AND s.stock.name == \"上海石化\" \nRETURN sd.stock_data.volume\nLIMIT 50", 1, 0.01667475700378418], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海石化\" AND sd.stock_data.`date` == date( \"2021-7-29\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 1, 0.016262531280517578]]}]