[{"query": "涨跌幅不小于7的工业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.range >= 7 RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range >= 7 \nRETURN s.stock.name\nLIMIT 50", 0, 4.219681262969971], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range >= 7 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 4.393207311630249], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range >= 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 4.491903781890869], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range >= 7 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 4.280433177947998], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.range >= 7 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 4.439258098602295], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.range >= 7 \nRETURN s.stock.name\nLIMIT 50", 0, 4.3693835735321045]]}, {"query": "成交量小于12的酒精饮料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '酒精饮料' AND sd.stock_data.volume < 12 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 12 AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.043557167053222656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 12 \nRETURN s.stock\nLIMIT 50", 0, 0.028417348861694336], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND t.trade.name == \"饮料\" AND sd.stock_data.volume < 12 \nRETURN s.stock\nLIMIT 50", 0, 0.050720930099487305], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume < 12 AND sd.stock_data.`date` == date('2023-11-10') AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.03029155731201172], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND sd.stock_data.volume < 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.030871868133544922], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE sd.stock_data.volume < 12 AND t.trade.name == \"饮料\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.03254294395446777]]}, {"query": "成交量不小于1的媒体和娱乐行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '媒体和娱乐' AND sd.stock_data.volume >= 1 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.volume >= 1 \nRETURN s.stock\nLIMIT 50", 0, 0.0247189998626709], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 1 \nRETURN s.stock\nLIMIT 50", 0, 0.021129131317138672], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume >= 1 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02598738670349121], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.volume >= 1 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022098302841186523], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume >= 1 AND sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02124476432800293], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume >= 1 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.019167184829711914]]}, {"query": "收盘价小于8的工业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.closing_price < 8 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.080923795700073], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price < 8 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.406872034072876], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 6.454428195953369], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 8 \nRETURN s.stock.name\nLIMIT 50", 0, 6.3004937171936035], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 8 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.363401174545288], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price < 8 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 6.412153482437134]]}, {"query": "成交量不大于25的医疗设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '医疗设备' AND sd.stock_data.volume <= 25 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.volume <= 25 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.020906448364257812], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 25 AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.018792152404785156], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 25 AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.021914243698120117], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 25 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.020917415618896484], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 25 \nRETURN s.stock.name\nLIMIT 50", 0, 0.017380952835083008], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" AND sd.stock_data.volume <= 25 \nRETURN s.stock.name\nLIMIT 50", 0, 0.01748204231262207]]}, {"query": "成交量小于48的医疗保健设施行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '医疗保健设施' AND sd.stock_data.volume < 48 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 48 \nRETURN s.stock.name\nLIMIT 50", 0, 0.020852088928222656], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 48 AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0220184326171875], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 48 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.023143768310546875], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" AND sd.stock_data.volume < 48 \nRETURN s.stock.name\nLIMIT 50", 0, 0.021543264389038086], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.volume < 48 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.016558170318603516], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 48 AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.020013093948364258]]}, {"query": "开盘价不小于18的能源行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.opening_price >= 18 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price >= 18 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002371072769165039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price >= 18 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002153635025024414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.opening_price >= 18 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018773078918457031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price >= 18 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018079280853271484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price >= 18 AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001657724380493164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.opening_price >= 18 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017075538635253906]]}, {"query": "收盘价大于11的工业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.closing_price > 11 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price > 11 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.042441606521606445], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.closing_price > 11 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.036089181900024414], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price > 11 \nRETURN s.stock.name\nLIMIT 50", 0, 0.03200531005859375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price > 11 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.03515338897705078], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price > 11 \nRETURN s.stock.name\nLIMIT 50", 0, 0.035735368728637695], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price > 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.036728858947753906]]}, {"query": "成交量小于16的工业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.volume < 16 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 16 \nRETURN s.stock.name\nLIMIT 50", 0, 0.025941133499145508], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.01875138282775879]]}, {"query": "最低价大于48的工业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.minimum_price > 48 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price > 48 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.004251956939697266], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 48 \nRETURN s.stock.name\nLIMIT 50", 0, 0.003380298614501953], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 48 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.003078460693359375], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 48 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0033745765686035156], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 48 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0031545162200927734], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.minimum_price > 48 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.003044605255126953]]}, {"query": "成交量不大于1的医疗设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '医疗设备' AND sd.stock_data.volume <= 1 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 1 AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.008080482482910156], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" AND sd.stock_data.volume <= 1 \nRETURN s.stock.name\nLIMIT 50", 0, 0.009796380996704102], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.volume <= 1 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.005641460418701172], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 1 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0064678192138671875], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 1 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.006118059158325195], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 1 AND s.stock.name == \"医疗\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.006196022033691406]]}, {"query": "开盘价小于14的家庭和个人用品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '家庭和个人用品' AND sd.stock_data.opening_price < 14 RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price < 14 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.140460729598999], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 14 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.338962554931641], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 14 \nRETURN s.stock.name\nLIMIT 50", 0, 7.698833465576172], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 14 \nRETURN s.stock.name\nLIMIT 50", 0, 7.112498998641968], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 14 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.085695505142212], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.opening_price < 14 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.268068552017212]]}, {"query": "最低价大于44的能源行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.minimum_price > 44 RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.minimum_price > 44 \nRETURN s.stock\nLIMIT 50", 0, 0.0035200119018554688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.minimum_price > 44 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0032050609588623047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 44 \nRETURN s.stock\nLIMIT 50", 0, 0.0029778480529785156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > 44 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0026254653930664062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > 44 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.023257017135620117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 44 AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.005971431732177734]]}, {"query": "成交量不大于27的媒体和娱乐行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '媒体和娱乐' AND sd.stock_data.volume <= 27 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 27 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.031319379806518555], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.volume <= 27 \nRETURN s.stock\nLIMIT 50", 0, 0.035119056701660156], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.volume <= 27 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.03134799003601074], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 27 \nRETURN s.stock\nLIMIT 50", 0, 0.031629323959350586], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume <= 27 AND sd.stock_data.`date` == date('2023-11-10') AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.030707836151123047], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 27 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.025873184204101562]]}, {"query": "成交量小于4的娱乐设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '娱乐设备' AND sd.stock_data.volume < 4 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 4 AND s.stock.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.013060569763183594], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 4 AND s.stock.name == \"娱乐\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.011412858963012695], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"娱乐\" AND sd.stock_data.volume < 4 \nRETURN s.stock\nLIMIT 50", 0, 0.016114234924316406], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"娱乐\" AND sd.stock_data.volume < 4 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.010783672332763672], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 4 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.009763717651367188], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE s.stock.name == \"娱乐\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 4 \nRETURN s.stock\nLIMIT 50", 0, 0.009765386581420898]]}, {"query": "最高价不大于33的消费品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '消费品' AND sd.stock_data.maximum_price <= 33 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 33 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.289038181304932], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 33 \nRETURN s.stock.name\nLIMIT 50", 0, 7.4595513343811035], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 33 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.431630611419678], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 33 \nRETURN s.stock.name\nLIMIT 50", 0, 7.316316604614258], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price <= 33 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.264886379241943], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 33 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.456829071044922]]}, {"query": "最高价小于13的工业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '工业' AND sd.stock_data.maximum_price < 13 RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 13 AND sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.441061735153198], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.maximum_price < 13 AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.3560791015625], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 13 \nRETURN s.stock.name\nLIMIT 50", 0, 7.0021748542785645], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 13 \nRETURN s.stock.name\nLIMIT 50", 0, 7.2828285694122314], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 13 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.454319000244141], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 13 AND td.trade_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 7.615634202957153]]}, {"query": "成交量小于24的原材料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '原材料' AND sd.stock_data.volume < 24 RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.volume < 24 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.029819488525390625], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 24 \nRETURN s.stock\nLIMIT 50", 0, 0.02740311622619629]]}]