[{"query": "涨跌幅不大于38的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 38 \nRETURN s.stock.name\nLIMIT 50", 1, 0.02036261558532715], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.021027803421020508]]}, {"query": "哪些股票的涨跌幅不大于38", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 38 \nRETURN s.stock.name\nLIMIT 50", 1, 0.020817279815673828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.021942853927612305]]}, {"query": "最高价不大于19的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 19 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 19 \nRETURN t.trade.name\nLIMIT 50", 1, 0.008483409881591797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 19 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00805354118347168]]}, {"query": "哪些行业的最高价不大于19", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 19 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 19 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0071239471435546875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 19 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0077097415924072266]]}, {"query": "最低价小于4的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 4 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 4 \nRETURN t.trade.name\nLIMIT 50", 1, 0.00514674186706543], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 4 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007104158401489258]]}, {"query": "哪些行业的最低价小于4", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 4 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 4 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006895542144775391], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 4 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005887746810913086]]}, {"query": "开盘价不大于34的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 34 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 34 \nRETURN s.stock.name\nLIMIT 50", 1, 0.020000934600830078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 34 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018609285354614258]]}, {"query": "最高价小于45的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 45 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 45 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.019220590591430664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 45 \nRETURN s.stock.name\nLIMIT 50", 1, 0.019285917282104492]]}, {"query": "哪些股票的最高价小于45", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 45 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 45 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.0180819034576416], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 45 \nRETURN s.stock.name\nLIMIT 50", 1, 0.020405054092407227]]}, {"query": "最低价不大于26的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 26 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 26 \nRETURN s.stock.name\nLIMIT 50", 1, 0.018250226974487305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.019994497299194336]]}, {"query": "哪些上市公司的最低价不大于26", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 26 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 26 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02658367156982422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 26 \nRETURN s.stock\nLIMIT 50", 0, 0.028359174728393555]]}, {"query": "涨跌幅不小于3的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range >= 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range >= 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.008051872253417969], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range >= 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006190061569213867]]}, {"query": "哪些行业的涨跌幅不小于3", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range >= 3 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range >= 3 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006356239318847656], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range >= 3 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005711078643798828]]}, {"query": "开盘价小于8的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 8 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.015593528747558594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 8 \nRETURN s.stock.name\nLIMIT 50", 1, 0.016639232635498047]]}, {"query": "哪些上市公司的开盘价小于8", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 8 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 8 \nRETURN s.stock\nLIMIT 50", 0, 0.019860029220581055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.019037485122680664]]}, {"query": "收盘价小于16的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 16 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01708984375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.016936779022216797]]}, {"query": "哪些上市公司的收盘价小于16", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 16 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 16 \nRETURN s.stock\nLIMIT 50", 0, 0.022605180740356445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 16 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0230560302734375]]}, {"query": "涨跌幅小于43的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 43 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 43 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018352746963500977], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 43 \nRETURN s.stock.name\nLIMIT 50", 1, 0.020900964736938477]]}, {"query": "哪些股票的涨跌幅小于43", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 43 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 43 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018826007843017578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 43 \nRETURN s.stock.name\nLIMIT 50", 1, 0.019414663314819336]]}, {"query": "成交量不大于47的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 47 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 47 \nRETURN s.stock\nLIMIT 50", 0, 0.02452373504638672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 47 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.028112411499023438]]}, {"query": "哪些上市公司的成交量不大于47", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume <= 47 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume <= 47 \nRETURN s.stock\nLIMIT 50", 0, 0.02448248863220215], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume <= 47 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0364537239074707]]}, {"query": "开盘价大于1的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > 1 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > 1 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006825685501098633], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price > 1 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0074634552001953125]]}, {"query": "哪些行业的开盘价大于1", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > 1 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > 1 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007394075393676758], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price > 1 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007238626480102539]]}, {"query": "涨跌幅不大于17的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 17 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 17 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0070497989654541016], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 17 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00657200813293457]]}, {"query": "哪些行业的涨跌幅不大于17", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 17 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 17 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007473468780517578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 17 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006768941879272461]]}, {"query": "成交量等于9的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == 9 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume == 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.006293773651123047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume == 9 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0069446563720703125]]}, {"query": "哪些股票的成交量等于9", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == 9 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume == 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.006199359893798828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume == 9 \nRETURN s.stock.name\nLIMIT 50", 1, 0.006020784378051758]]}, {"query": "开盘价小于27的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 27 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 27 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006830453872680664], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 27 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006787776947021484]]}, {"query": "哪些行业的开盘价小于27", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 27 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 27 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0071909427642822266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 27 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006899595260620117]]}, {"query": "最高价不大于21的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 21 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 21 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0066280364990234375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 21 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006356000900268555]]}, {"query": "哪些行业的最高价不大于21", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 21 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 21 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0063076019287109375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 21 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006415128707885742]]}, {"query": "最低价小于7的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005568504333496094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.008606195449829102]]}, {"query": "哪些行业的最低价小于7", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006048917770385742], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0054683685302734375]]}, {"query": "涨跌幅小于10的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < 10 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range < 10 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007306098937988281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range < 10 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007091045379638672]]}, {"query": "哪些行业的涨跌幅小于10", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range < 10 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range < 10 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006987571716308594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range < 10 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0069844722747802734]]}, {"query": "最高价不大于3的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.010115623474121094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 3 \nRETURN s.stock\nLIMIT 50", 0, 0.010350227355957031]]}, {"query": "哪些上市公司的最高价不大于3", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.010866880416870117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 3 \nRETURN s.stock\nLIMIT 50", 0, 0.012111902236938477]]}, {"query": "最低价不大于15的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 15 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 15 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0167999267578125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 15 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.016865968704223633]]}, {"query": "哪些上市公司的最低价不大于15", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price <= 15 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price <= 15 \nRETURN s.stock\nLIMIT 50", 0, 0.022644758224487305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price <= 15 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022037744522094727]]}, {"query": "涨跌幅大于3的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.018383026123046875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range > 3 \nRETURN s.stock\nLIMIT 50", 0, 0.018744707107543945]]}, {"query": "哪些股票的涨跌幅大于3", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range > 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.015292882919311523], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range > 3 \nRETURN s.stock.name\nLIMIT 50", 1, 0.014421939849853516]]}, {"query": "成交量小于9的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 9 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02018570899963379], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 9 \nRETURN s.stock\nLIMIT 50", 0, 0.02186131477355957]]}, {"query": "哪些上市公司的成交量小于9", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 9 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 9 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.01955723762512207], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 9 \nRETURN s.stock\nLIMIT 50", 0, 0.02054882049560547]]}, {"query": "开盘价小于34的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 34 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 34 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007126808166503906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 34 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0064389705657958984]]}, {"query": "哪些行业的开盘价小于34", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price < 34 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price < 34 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0072247982025146484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price < 34 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006713390350341797]]}, {"query": "最高价大于8的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > 8 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price > 8 \nRETURN t.trade.name\nLIMIT 50", 1, 0.004279613494873047], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price > 8 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.004207611083984375]]}, {"query": "哪些行业的最高价大于8", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price > 8 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price > 8 \nRETURN t.trade.name\nLIMIT 50", 1, 0.004996061325073242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price > 8 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00463104248046875]]}, {"query": "最低价不大于13的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 13 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 13 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007771015167236328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 13 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007843732833862305]]}, {"query": "哪些行业的最低价不大于13", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 13 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 13 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007972955703735352], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 13 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007124185562133789]]}]