[{"query": "哪个是在晋亿实业和丰华股份股票中最低价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['晋亿实业', '丰华股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"丰华股份\" AND ( s.stock.name == \"丰华股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01849079132080078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"丰华股份\" AND ( s.stock.name == \"丰华股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016579389572143555], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"丰华股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"丰华股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.016831636428833008], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"丰华股份\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"丰华股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015944719314575195], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"丰华股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"丰华股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015312671661376953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"丰华股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"丰华股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.014832735061645508]]}, {"query": "在旅游和酒店和能源和汽车零部件行业中最高价最高的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['旅游和酒店', '能源', '汽车零部件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) \nRETURN s.stock, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.18360185623168945], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.17561578750610352]]}, {"query": "哪个是在退市吉恩和时代新材上市公司中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['退市吉恩', '时代新材'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"时代新材\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.01976943016052246], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"时代新材\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.01791667938232422]]}, {"query": "在退市吉恩和时代新材上市公司中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['退市吉恩', '时代新材'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"时代新材\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.01728987693786621], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"时代新材\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.017157793045043945]]}, {"query": "在退市吉恩和时代新材上市公司中开盘价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['退市吉恩', '时代新材'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"时代新材\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.018352985382080078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"时代新材\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.017132997512817383]]}, {"query": "在电脑硬件和电力和银行行业中最高价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电脑硬件', '电力', '银行'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"电力\" OR indus.industry.name == \"银行\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.17685413360595703], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"电力\" OR indus.industry.name == \"银行\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.1734616756439209]]}, {"query": "哪个是在中国巨石和金鹰股份和龙头股份股票中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['中国巨石', '金鹰股份', '龙头股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"金鹰股份\" OR s.stock.name == \"龙头股份\" ) \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.02068638801574707], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"金鹰股份\" OR s.stock.name == \"龙头股份\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.018500328063964844]]}, {"query": "在物流服务和航空公司和家居用品中最高价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['物流服务', '航空公司', '家居用品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"家居\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0019540786743164062], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0017850399017333984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0018050670623779297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016825199127197266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0019025802612304688], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"家居\" \nRETURN t.trade, td.trade_data.maximum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016124248504638672]]}, {"query": "哪个是在酒精饮料和房地产行业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['酒精饮料', '房地产'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"饮料\" OR indus.industry.name == \"房地产\" ) \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.18585824966430664], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"饮料\" OR indus.industry.name == \"房地产\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.17560601234436035]]}, {"query": "在电视和广播和零售和汽车零部件中开盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电视和广播', '零售', '汽车零部件'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"汽车\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.18885040283203125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"汽车\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.17414450645446777]]}, {"query": "在东风股份和大东方上市公司中最低价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['东风股份', '大东方'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021560192108154297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019092559814453125]]}, {"query": "在东风股份和大东方上市公司中最低价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['东风股份', '大东方'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018298625946044922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017728805541992188]]}, {"query": "哪个是在电力工具和设备和医疗保健行业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电力工具和设备', '医疗保健'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0015997886657714844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.018281221389770508], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电力\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.020781755447387695], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.018596410751342773], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.002038240432739258], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.001821279525756836]]}, {"query": "在电力工具和设备和医疗保健行业中涨跌幅最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['电力工具和设备', '医疗保健'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018727779388427734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.018975496292114258], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电力\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.017458200454711914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.017116069793701172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019676685333251953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0018515586853027344]]}, {"query": "在家庭和个人用品和家居用品和银行行业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['家庭和个人用品', '家居用品', '银行'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018415451049804688], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017049312591552734], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"银行\" AND indus.industry.name == \"家居\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015676021575927734], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"家居\" AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019392967224121094], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"银行\" AND indus.industry.name == \"家居\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016391277313232422], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"家居\" AND indus.industry.name == \"银行\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016252994537353516]]}, {"query": "在博信股份和丹化科技中开盘价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['博信股份', '丹化科技'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.001894235610961914], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0016460418701171875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0015926361083984375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"科技\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0016925334930419922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0018014907836914062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.0015654563903808594]]}, {"query": "在汽车零部件和电力中开盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车零部件', '电力'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.018353700637817383], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018024921417236328], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.017086029052734375], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.018434762954711914], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"汽车\" AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.017630338668823242], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017785072326660156]]}, {"query": "在长江电力和会稽山中最低价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['长江电力', '会稽山'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0018072128295898438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0018157958984375]]}, {"query": "在长江电力和会稽山中最低价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['长江电力', '会稽山'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0018467903137207031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017178058624267578]]}, {"query": "哪个是在长江电力和会稽山中最低价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['长江电力', '会稽山'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.002375364303588867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电力\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0015616416931152344]]}, {"query": "在金融技术和航空航天中收盘价最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['金融技术', '航空航天'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005263566970825195], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005363941192626953]]}, {"query": "在金融技术和航空航天中收盘价最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['金融技术', '航空航天'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.closing_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005751371383666992], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005199909210205078]]}, {"query": "哪个是在友好集团和黄山旅游和航天动力中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['友好集团', '黄山旅游', '航天动力'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"友好集团\" OR s.stock.name == \"黄山旅游\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.02069091796875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"友好集团\" OR s.stock.name == \"黄山旅游\" ) \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.018778324127197266]]}, {"query": "在金融服务和医疗设备和医疗保健设施行业中最低价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['金融服务', '医疗设备', '医疗保健设施'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001810312271118164], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016810894012451172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.002384662628173828], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016934871673583984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0015823841094970703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0015344619750976562]]}, {"query": "哪个是在烽火通信和西部黄金股票中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['烽火通信', '西部黄金'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金股\" AND s.stock.name == \"烽火通信\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0018265247344970703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"烽火通信\" AND s.stock.name == \"金股\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016982555389404297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"烽火通信\" AND s.stock.name == \"金股\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.015843868255615234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金股\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"烽火通信\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0016486644744873047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金股\" AND s.stock.name == \"烽火通信\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0016434192657470703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"烽火通信\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金股\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.014908313751220703]]}, {"query": "哪个是在石油和天然气和航天和国防行业中最低价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['石油和天然气', '航天和国防'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001753091812133789], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0016078948974609375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.001516103744506836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"航天\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0014805793762207031], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND t.trade.name == \"航天\" \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0013878345489501953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航天\" AND ( t.trade.name == \"石油\" OR t.trade.name == \"天然\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.minimum_price AS TTDMP\nORDER BY TTDMP DESC LIMIT 1", 0, 0.0014219284057617188]]}]