[{"query": "金融服务行业的更新时间和最低价在2023年10月5日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-10-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-5\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005971193313598633], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-10-5\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00569915771484375]]}, {"query": "2023年10月5日的金融服务行业的更新时间和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2023-10-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-10-5\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.`date`,td.trade_data.minimum_price\nLIMIT 50", 0, 0.006394386291503906], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2023-10-5\" ) \nRETURN td.trade_data.`date`,td.trade_data.minimum_price\nLIMIT 50", 0, 0.006090402603149414]]}, {"query": "2022年5月22日纺织品和服装的更新时间和最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` == date('2022-05-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"纺织\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0028700828552246094], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-5-22\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.002502918243408203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-5-22\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0023839473724365234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.001974821090698242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"服装\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.002069711685180664], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0017409324645996094]]}, {"query": "纺织品和服装的更新时间和最高价和开盘价在2022年5月22日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` == date('2022-05-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-5-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0024671554565429688], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020983219146728516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020437240600585938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.002066373825073242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020110607147216797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-5-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002256631851196289]]}, {"query": "2022年5月22日的纺织品和服装的更新时间和最高价和开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '纺织品和服装' AND td.trade_data.`date` == date('2022-05-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-5-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.003084897994995117], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.002231597900390625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018520355224609375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020520687103271484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-22\" ) AND t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.002105236053466797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" AND td.trade_data.`date` == date( \"2022-5-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018451213836669922]]}, {"query": "安徽合力上市公司的收盘价和成交量和涨跌幅在2023年6月22日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '安徽合力' AND sd.stock_data.`date` == date('2023-06-22') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price, sd.stock_data.volume, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安徽合力\" AND sd.stock_data.`date` == date( \"2023-6-22\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02068042755126953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-6-22\" ) AND s.stock.name == \"安徽合力\" \nRETURN s.stock\nLIMIT 50", 0, 0.027238845825195312]]}, {"query": "大众公用的成交量和开盘价和涨跌幅在2021年7月29日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '大众公用' AND sd.stock_data.`date` == date('2021-07-29') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.opening_price, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"大众公用\" AND sd.stock_data.`date` == date( \"2021-7-29\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02189922332763672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-7-29\" ) AND s.stock.name == \"大众公用\" \nRETURN s.stock\nLIMIT 50", 0, 0.01759791374206543]]}, {"query": "兴业银行上市公司的更新时间和涨跌幅和最低价在2023年3月28日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '兴业银行' AND sd.stock_data.`date` == date('2023-03-28') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2023-3-28\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001934051513671875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-3-28\" ) AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017600059509277344]]}, {"query": "娱乐设备行业的收盘价和更新时间在2020年9月8日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2020-09-08') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date( \"2020-9-8\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0020499229431152344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-8\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.001714468002319336]]}, {"query": "2020年9月8日娱乐设备行业的收盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2020-09-08') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-8\" ) AND t.trade.name == \"娱乐\" \nRETURN td.trade_data.closing_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0025866031646728516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date( \"2020-9-8\" ) \nRETURN td.trade_data.closing_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0020024776458740234]]}, {"query": "2020年9月8日的娱乐设备行业的收盘价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2020-09-08') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date( \"2020-9-8\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0021338462829589844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-8\" ) AND t.trade.name == \"娱乐\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017850399017333984]]}, {"query": "2020年9月8日的娱乐设备行业的收盘价和更新时间", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '娱乐设备' AND td.trade_data.`date` == date('2020-09-08') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-8\" ) AND t.trade.name == \"娱乐\" \nRETURN td.trade_data.closing_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0020248889923095703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"娱乐\" AND td.trade_data.`date` == date( \"2020-9-8\" ) \nRETURN td.trade_data.closing_price,td.trade_data.`date`\nLIMIT 50", 0, 0.0018749237060546875]]}, {"query": "能源行业的最低价和更新时间和最高价在2022年2月4日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2022-02-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2022-2-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002105236053466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-4\" ) AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.002031564712524414]]}, {"query": "2022年2月4日能源行业的最低价和更新时间和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2022-02-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-4\" ) AND s.stock.name == \"能源\" \nRETURN sd.stock_data.`date`,sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001939535140991211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2022-2-4\" ) \nRETURN sd.stock_data.`date`,sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016603469848632812]]}, {"query": "2022年2月4日的能源行业的最低价和更新时间和最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2022-02-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2022-2-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018906593322753906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-4\" ) AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016634464263916016]]}, {"query": "2022年2月4日的能源行业的最低价和更新时间和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2022-02-04') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-2-4\" ) AND s.stock.name == \"能源\" \nRETURN sd.stock_data.`date`,sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0018589496612548828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2022-2-4\" ) \nRETURN sd.stock_data.`date`,sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017857551574707031]]}, {"query": "2020年1月26日的珠宝和宝石的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2020-01-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-26\" ) AND t.trade.name == \"宝石\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0022649765014648438], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2020-1-26\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0019202232360839844]]}, {"query": "2020年1月26日的珠宝和宝石的最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2020-01-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-26\" ) AND t.trade.name == \"宝石\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020608901977539062], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2020-1-26\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017538070678710938]]}, {"query": "2020年1月26日珠宝和宝石的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2020-01-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-26\" ) AND t.trade.name == \"宝石\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.002001523971557617], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2020-1-26\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.0016562938690185547]]}, {"query": "珠宝和宝石的最高价在2020年1月26日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2020-01-26') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-26\" ) AND t.trade.name == \"宝石\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018951892852783203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2020-1-26\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0016453266143798828]]}, {"query": "2023年7月18日的酒店和度假村的收盘价和更新时间和开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-07-18') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-7-18\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002147197723388672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-18\" ) AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019328594207763672]]}, {"query": "2023年7月18日的酒店和度假村的收盘价和更新时间和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-07-18') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-7-18\" ) \nRETURN td.trade_data.`date`,td.trade_data.opening_price\nLIMIT 50", 0, 0.0019769668579101562], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-18\" ) AND t.trade.name == \"酒店\" \nRETURN td.trade_data.`date`,td.trade_data.opening_price\nLIMIT 50", 0, 0.001665353775024414]]}, {"query": "酒店和度假村的收盘价和更新时间和开盘价在2023年7月18日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-07-18') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-7-18\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019412040710449219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-18\" ) AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017583370208740234]]}, {"query": "2023年7月18日酒店和度假村的收盘价和更新时间和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-07-18') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date( \"2023-7-18\" ) \nRETURN td.trade_data.`date`,td.trade_data.opening_price\nLIMIT 50", 0, 0.0018358230590820312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-18\" ) AND t.trade.name == \"酒店\" \nRETURN td.trade_data.`date`,td.trade_data.opening_price\nLIMIT 50", 0, 0.0017848014831542969]]}, {"query": "2021年3月14日的电信设备行业的更新时间和最低价和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2021-03-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-3-14\" ) AND t.trade.name == \"电信\" \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.020952701568603516], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date( \"2021-3-14\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.022487878799438477]]}, {"query": "2021年3月14日电信设备行业的更新时间和最低价和收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2021-03-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-3-14\" ) AND t.trade.name == \"电信\" \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.022043704986572266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date( \"2021-3-14\" ) \nRETURN td.trade_data.minimum_price,td.trade_data.closing_price\nLIMIT 50", 0, 0.019457578659057617]]}, {"query": "2022年11月11日的金融服务行业的最高价和开盘价和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2022-11-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-11-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00764012336730957], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-11-11\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.009014368057250977]]}, {"query": "金融服务行业的最高价和开盘价和最低价在2022年11月11日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` == date('2022-11-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-11-11\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0059473514556884766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-11-11\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006376028060913086]]}, {"query": "青岛啤酒股票的开盘价和涨跌幅和成交量在2020年1月28日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '青岛啤酒' AND sd.stock_data.`date` == date('2020-01-28') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price, sd.stock_data.range, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-1-28\" ) AND s.stock.name == \"青岛啤酒\" \nRETURN s.stock\nLIMIT 50", 0, 0.018593788146972656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"青岛啤酒\" AND sd.stock_data.`date` == date( \"2020-1-28\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017186403274536133]]}, {"query": "2021年12月27日的中国卫星上市公司的更新时间和最低价和开盘价的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国卫星' AND sd.stock_data.`date` == date('2021-12-27') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中国卫星\" AND sd.stock_data.`date` == date( \"2021-12-27\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0181887149810791], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-27\" ) AND s.stock.name == \"中国卫星\" \nRETURN s.stock\nLIMIT 50", 0, 0.01811695098876953]]}, {"query": "2021年12月27日中国卫星上市公司的更新时间和最低价和开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国卫星' AND sd.stock_data.`date` == date('2021-12-27') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.minimum_price, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-27\" ) AND s.stock.name == \"中国卫星\" \nRETURN sd.stock_data.minimum_price,sd.stock_data.opening_price\nLIMIT 50", 1, 0.01820540428161621], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"中国卫星\" AND sd.stock_data.`date` == date( \"2021-12-27\" ) \nRETURN sd.stock_data.minimum_price,sd.stock_data.opening_price\nLIMIT 50", 1, 0.01712942123413086]]}, {"query": "信息技术的开盘价在2019年12月22日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2019-12-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2019-12-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0021016597747802734], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-12-22\" ) AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018782615661621094]]}, {"query": "2019年12月22日信息技术的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2019-12-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2019-12-22\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0020225048065185547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-12-22\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0017817020416259766]]}, {"query": "2019年12月22日的信息技术的开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2019-12-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2019-12-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0020093917846679688], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-12-22\" ) AND t.trade.name == \"技术\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018150806427001953]]}, {"query": "2019年12月22日的信息技术的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '信息技术' AND td.trade_data.`date` == date('2019-12-22') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"技术\" AND td.trade_data.`date` == date( \"2019-12-22\" ) \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0018537044525146484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2019-12-22\" ) AND t.trade.name == \"技术\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0015804767608642578]]}, {"query": "珠宝和宝石的涨跌幅和更新时间在2022年4月20日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '珠宝和宝石' AND td.trade_data.`date` == date('2022-04-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"宝石\" AND td.trade_data.`date` == date( \"2022-4-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018901824951171875], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-4-20\" ) AND t.trade.name == \"宝石\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017142295837402344]]}, {"query": "2020年9月17日的金属和矿业行业的收盘价和最高价和更新时间的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` == date('2020-09-17') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date( \"2020-9-17\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.009186983108520508], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-17\" ) AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0072324275970458984]]}, {"query": "金属和矿业行业的收盘价和最高价和更新时间在2020年9月17日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` == date('2020-09-17') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.maximum_price, td.trade_data.`date`\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date( \"2020-9-17\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006557941436767578], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-9-17\" ) AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006106853485107422]]}]