[{"query": "有哪些上游是房地产产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '房地产' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0022542476654052734], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021927356719970703]]}, {"query": "魏司马基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏司马' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏司马\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015044212341308594], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏司马\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014612674713134766]]}, {"query": "有哪些托管给吕西门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '吕西门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"吕西门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014166831970214844], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"吕西门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00141143798828125]]}, {"query": "媒体和娱乐产业关联的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '媒体和娱乐' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014941692352294922], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"媒体\" OR indus.industry.name == \"娱乐\" ) AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016510486602783203]]}, {"query": "有哪些股东是发科电股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发科电' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"发科\" OR s.stock.name == \"电股\" ) AND s.stock.name == \"发科电\" \nRETURN n.name\nLIMIT 50", 0, 0.00030803680419921875], ["MATCH (s:stock)\nWHERE s.stock.name == \"发科电\" AND ( s.stock.name == \"发科\" OR s.stock.name == \"电股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00026106834411621094]]}, {"query": "有哪些属于物流服务行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '物流服务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"物流\" AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014865398406982422], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND s.stock.name == \"物流\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014951229095458984]]}, {"query": "杨长孙基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '杨长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001621246337890625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"杨长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015091896057128906]]}, {"query": "保能限据司股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '保能限据司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"保能限据司\" AND ( s.stock.name == \"限据\" OR s.stock.name == \"司股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014696121215820312], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"限据\" OR s.stock.name == \"司股\" ) AND s.stock.name == \"保能限据司\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013880729675292969]]}, {"query": "有哪些股东是保能限据司股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '保能限据司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"保能限据司\" AND ( s.stock.name == \"限据\" OR s.stock.name == \"司股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00027489662170410156], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"限据\" OR s.stock.name == \"司股\" ) AND s.stock.name == \"保能限据司\" \nRETURN n.name\nLIMIT 50", 0, 0.0002579689025878906]]}, {"query": "姜宇文基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '姜宇文' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"姜宇文\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014731884002685547], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"姜宇文\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001455545425415039]]}, {"query": "柳化股份股票相关的讯息", "golden": "MATCH (s1:stock)-[iv:involve]->(i2:information) WHERE s1.stock.name == '柳化股份' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"柳化股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"柳化股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001865386962890625], ["MATCH (s:stock)\nWHERE s.stock.name == \"柳化股份\" AND ( s.stock.name == \"柳化股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018486976623535156]]}, {"query": "份技产务限股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '份技产务限' AND iso.shareholding_ratio > 26 RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"份技产务限\" AND ( s.stock.name == \"份技\" OR s.stock.name == \"产务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014498233795166016], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"份技\" OR s.stock.name == \"产务\" ) AND s.stock.name == \"份技产务限\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018999576568603516]]}, {"query": "有哪些股东是份技产务限股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '份技产务限' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"份技\" OR s.stock.name == \"产务\" ) AND s.stock.name == \"份技产务限\" \nRETURN n.name\nLIMIT 50", 0, 0.00030684471130371094], ["MATCH (s:stock)\nWHERE s.stock.name == \"份技产务限\" AND ( s.stock.name == \"份技\" OR s.stock.name == \"产务\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002567768096923828]]}, {"query": "有哪些托管给蒋黎丘基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '蒋黎丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"蒋黎丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015149116516113281], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"蒋黎丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014204978942871094]]}, {"query": "有哪些关联龙溪股份股票的产业", "golden": "MATCH (s1:stock)-[a:associate]->(n2:industry) WHERE s1.stock.name == '龙溪股份' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE ( s.stock.name == \"龙溪股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"龙溪股份\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.002647876739501953], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"龙溪股份\" AND ( s.stock.name == \"龙溪股\" OR s.stock.name == \"份股\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0027735233306884766]]}, {"query": "务份据环投股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务份据环投' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"务份据环投\" AND ( s.stock.name == \"份据\" OR s.stock.name == \"环投\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013580322265625], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"份据\" OR s.stock.name == \"环投\" ) AND s.stock.name == \"务份据环投\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013802051544189453]]}, {"query": "有哪些股东是务份据环投股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '务份据环投' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"务份据环投\" AND ( s.stock.name == \"份据\" OR s.stock.name == \"环投\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003299713134765625], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"份据\" OR s.stock.name == \"环投\" ) AND s.stock.name == \"务份据环投\" \nRETURN n.name\nLIMIT 50", 0, 0.0002841949462890625]]}, {"query": "制造产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '制造' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019431114196777344], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021467208862304688]]}, {"query": "有哪些上游是制造产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '制造' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018846988677978516], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"制造\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0022873878479003906]]}, {"query": "造展能股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '造展能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"造展\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"造展能\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014033317565917969], ["MATCH (s:stock)\nWHERE s.stock.name == \"造展能\" AND ( s.stock.name == \"造展\" OR s.stock.name == \"能股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013730525970458984]]}, {"query": "有哪些股东是造展能股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '造展能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"造展能\" AND ( s.stock.name == \"造展\" OR s.stock.name == \"能股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003437995910644531], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"造展\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"造展能\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003247261047363281]]}, {"query": "金属和矿业产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '金属和矿业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014965534210205078], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016598701477050781]]}, {"query": "有哪些上游是金属和矿业产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '金属和矿业' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015246868133544922], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"金属\" OR indus.industry.name == \"矿业\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001523733139038086]]}, {"query": "有哪些托管给严北门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '严北门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"严北门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015101432800292969], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"严北门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015676021575927734]]}, {"query": "纸浆和造纸产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '纸浆和造纸' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003898143768310547], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.005080223083496094]]}, {"query": "有哪些上游是纸浆和造纸产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '纸浆和造纸' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003343820571899414], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032808780670166016]]}, {"query": "有哪些属于旅游和酒店行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '旅游和酒店' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"旅游\" AND ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0013840198516845703], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) AND s.stock.name == \"旅游\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014789104461669922]]}, {"query": "有哪些托管给孔梁丘基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔梁丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔梁丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015749931335449219], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔梁丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013284683227539062]]}, {"query": "秦司马基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦司马' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦司马\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001605987548828125], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦司马\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014908313751220703]]}, {"query": "有哪些股东是投能服司股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '投能服司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"投能服司\" AND ( s.stock.name == \"能服\" OR s.stock.name == \"司股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003066062927246094], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"能服\" OR s.stock.name == \"司股\" ) AND s.stock.name == \"投能服司\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00025653839111328125]]}, {"query": "地务医保股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '地务医保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"地务医保\" AND ( s.stock.name == \"务医\" OR s.stock.name == \"保股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013477802276611328], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"务医\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"地务医保\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013761520385742188]]}, {"query": "有哪些股东是地务医保股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '地务医保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"务医\" OR s.stock.name == \"保股\" ) AND s.stock.name == \"地务医保\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00029397010803222656], ["MATCH (s:stock)\nWHERE s.stock.name == \"地务医保\" AND ( s.stock.name == \"务医\" OR s.stock.name == \"保股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00026726722717285156]]}, {"query": "有哪些托管给赵南门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '赵南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016849040985107422], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"赵南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014410018920898438]]}, {"query": "纺织品和服装产业的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '纺织品和服装' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014188289642333984], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.001466512680053711]]}, {"query": "有哪些关联纺织品和服装产业的股票", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '纺织品和服装' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014617443084716797], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015439987182617188]]}, {"query": "有哪些属于媒体和娱乐行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '媒体和娱乐' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND s.stock.name == \"媒体\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012569427490234375], ["MATCH (s:stock)\nWHERE s.stock.name == \"媒体\" AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0037071704864501953]]}, {"query": "申能股份股票的董事长", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '申能股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( s.stock.name == \"申能股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"申能股份\" \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.0022156238555908203], ["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE s.stock.name == \"申能股份\" AND ( s.stock.name == \"申能股\" OR s.stock.name == \"份股\" ) \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.002182483673095703]]}, {"query": "有哪些名下有申能股份股票的老板", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '申能股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"申能股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"申能股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018961429595947266], ["MATCH (s:stock)\nWHERE s.stock.name == \"申能股份\" AND ( s.stock.name == \"申能股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016734600067138672]]}, {"query": "电力产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电力' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018858909606933594], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002125978469848633]]}, {"query": "有哪些上游是电力产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电力' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018341541290283203], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020990371704101562]]}, {"query": "有哪些属于金属和矿业行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '金属和矿业' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND s.stock.name == \"金属\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014848709106445312], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"金属\" AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016088485717773438]]}, {"query": "有哪些托管给王仲孙基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '王仲孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"王仲孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014719963073730469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"王仲孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001508474349975586]]}, {"query": "长安鑫瑞科技6个月定开混合C基金的经理", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '长安鑫瑞科技6个月定开混合C' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"科技\" AND pof.public_offering_fund.name == \"长安\" \nRETURN fm.fund_manager.name\nLIMIT 50", 0, 0.0014264583587646484], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"长安\" AND pof.public_offering_fund.name == \"科技\" \nRETURN fm.fund_manager.name\nLIMIT 50", 0, 0.001798868179321289]]}, {"query": "子展据股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '子展据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"子展\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"子展据\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013093948364257812], ["MATCH (s:stock)\nWHERE s.stock.name == \"子展据\" AND ( s.stock.name == \"子展\" OR s.stock.name == \"据股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014507770538330078]]}, {"query": "有哪些股东是子展据股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '子展据' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"子展据\" AND ( s.stock.name == \"子展\" OR s.stock.name == \"据股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003368854522705078], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"子展\" OR s.stock.name == \"据股\" ) AND s.stock.name == \"子展据\" \nRETURN n.name\nLIMIT 50", 0, 0.0002410411834716797]]}, {"query": "纺织品和服装行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '纺织品和服装' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"纺织\" AND s.stock.name == \"服装\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013246536254882812], ["MATCH (s:stock)\nWHERE s.stock.name == \"服装\" AND s.stock.name == \"纺织\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001275777816772461]]}, {"query": "迪马股份股票的董事长", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '迪马股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( s.stock.name == \"迪马股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"迪马股份\" \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.0020813941955566406], ["MATCH (s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE s.stock.name == \"迪马股份\" AND ( s.stock.name == \"迪马股\" OR s.stock.name == \"份股\" ) \nRETURN cm.chairman.name\nLIMIT 50", 0, 0.002173900604248047]]}, {"query": "有哪些托管给张诸葛基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '张诸葛' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"张诸葛\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001556396484375], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"张诸葛\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0018935203552246094]]}, {"query": "发技金公股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发技金公' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"发技\" OR s.stock.name == \"金公\" ) AND s.stock.name == \"发技金公\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012941360473632812], ["MATCH (s:stock)\nWHERE s.stock.name == \"发技金公\" AND ( s.stock.name == \"发技\" OR s.stock.name == \"金公\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013093948364257812]]}, {"query": "有哪些股东是发技金公股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '发技金公' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"发技金公\" AND ( s.stock.name == \"发技\" OR s.stock.name == \"金公\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00032138824462890625], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"发技\" OR s.stock.name == \"金公\" ) AND s.stock.name == \"发技金公\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002200603485107422]]}, {"query": "韩欧阳基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '韩欧阳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"韩欧阳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014104843139648438], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"韩欧阳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014061927795410156]]}, {"query": "农产品产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '农产品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002684593200683594], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002663135528564453]]}, {"query": "有哪些上游是农产品产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '农产品' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002701282501220703], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"农产品\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0001976490020751953]]}, {"query": "陶百里基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '陶百里' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"陶百里\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001516580581665039], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶百里\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001432657241821289]]}, {"query": "展限能医股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展限能医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"限能\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"展限能医\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015027523040771484], ["MATCH (s:stock)\nWHERE s.stock.name == \"展限能医\" AND ( s.stock.name == \"限能\" OR s.stock.name == \"医股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012645721435546875]]}, {"query": "有哪些股东是展限能医股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展限能医' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"展限能医\" AND ( s.stock.name == \"限能\" OR s.stock.name == \"医股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00029158592224121094], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"限能\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"展限能医\" \nRETURN n.name\nLIMIT 50", 0, 0.00021529197692871094]]}, {"query": "何南门基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何南门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何南门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013823509216308594], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何南门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013477802276611328]]}]