[{"query": "航空航天产业关联的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '航空航天' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.004588603973388672], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.003985166549682617]]}, {"query": "有哪些关联航空航天产业的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '航空航天' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.003707408905029297], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0038073062896728516]]}, {"query": "秦长孙基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '秦长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"秦长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014739036560058594], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"秦长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013875961303710938]]}, {"query": "化学产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '化学' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"化学\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017871856689453125], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"化学\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020589828491210938]]}, {"query": "有哪些上游是化学产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '化学' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"化学\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00188446044921875], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"化学\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021114349365234375]]}, {"query": "有哪些属于金属和矿业行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '金属和矿业' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"金属\" AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018312931060791016], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND s.stock.name == \"金属\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015082359313964844]]}, {"query": "产能电资股股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '产能电资股' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) AND s.stock.name == \"产能\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017094612121582031], ["MATCH (s:stock)\nWHERE s.stock.name == \"产能\" AND ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018744468688964844]]}, {"query": "有哪些股东是产能电资股股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '产能电资股' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"产能\" AND ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00031304359436035156], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"能电\" OR s.stock.name == \"资股\" ) AND s.stock.name == \"产能\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00025725364685058594]]}, {"query": "有哪些托管给魏东方基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏东方' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏东方\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014464855194091797], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏东方\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017769336700439453]]}, {"query": "有哪些托管给冯东门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '冯东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"冯东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014340877532958984], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"冯东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001596212387084961]]}, {"query": "集产地有公股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '集产地有公' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"集产\" OR s.stock.name == \"地有\" ) AND s.stock.name == \"集产地有公\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018436908721923828], ["MATCH (s:stock)\nWHERE s.stock.name == \"集产地有公\" AND ( s.stock.name == \"集产\" OR s.stock.name == \"地有\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0017316341400146484]]}, {"query": "有哪些股东是集产地有公股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '集产地有公' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"集产地有公\" AND ( s.stock.name == \"集产\" OR s.stock.name == \"地有\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00039649009704589844], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"集产\" OR s.stock.name == \"地有\" ) AND s.stock.name == \"集产地有公\" \nRETURN n.name\nLIMIT 50", 0, 0.00042057037353515625]]}, {"query": "王呼延基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '王呼延' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"王呼延\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015034675598144531], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"王呼延\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001584768295288086]]}, {"query": "展发子投技股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展发子投技' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"展发子投技\" AND ( s.stock.name == \"展发\" OR s.stock.name == \"子投\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014858245849609375], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"展发\" OR s.stock.name == \"子投\" ) AND s.stock.name == \"展发子投技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013427734375]]}, {"query": "有哪些股东是展发子投技股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展发子投技' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"展发\" OR s.stock.name == \"子投\" ) AND s.stock.name == \"展发子投技\" \nRETURN n.name\nLIMIT 50", 0, 0.00031304359436035156], ["MATCH (s:stock)\nWHERE s.stock.name == \"展发子投技\" AND ( s.stock.name == \"展发\" OR s.stock.name == \"子投\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00030112266540527344]]}, {"query": "有哪些属于媒体和娱乐行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '媒体和娱乐' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND s.stock.name == \"媒体\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001505136489868164], ["MATCH (s:stock)\nWHERE s.stock.name == \"媒体\" AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013957023620605469]]}, {"query": "何北门基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何北门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何北门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001529693603515625], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何北门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014462471008300781]]}, {"query": "展制限有能股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '展制限有能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"制限\" OR s.stock.name == \"有能\" ) AND s.stock.name == \"展制限有能\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.00142669677734375], ["MATCH (s:stock)\nWHERE s.stock.name == \"展制限有能\" AND ( s.stock.name == \"制限\" OR s.stock.name == \"有能\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.001520395278930664]]}, {"query": "何呼延基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何呼延' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何呼延\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015597343444824219], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何呼延\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001453399658203125]]}, {"query": "有哪些托管给魏宰父基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏宰父' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏宰父\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016632080078125], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏宰父\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014231204986572266]]}, {"query": "有哪些持有湘电股份股票的公募基金", "golden": "MATCH (s1:stock)<-[h:hold]-(pof2:public_offering_fund) WHERE s1.stock.name == '湘电股份' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"湘电股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"湘电股份\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0028345584869384766], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"湘电股份\" AND ( s.stock.name == \"湘电股\" OR s.stock.name == \"份股\" ) \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0027675628662109375]]}, {"query": "有哪些托管给何东郭基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何东郭' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何东郭\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014071464538574219], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何东郭\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014829635620117188]]}, {"query": "尤夏侯基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '尤夏侯' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"尤夏侯\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014200210571289062], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"尤夏侯\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015399456024169922]]}, {"query": "国泰中证有色金属矿业主题ETF联接C基金托管给的基金经理", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '国泰中证有色金属矿业主题ETF联接C' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND ( pof.public_offering_fund.name == \"金属\" OR pof.public_offering_fund.name == \"矿业\" ) \nRETURN fm.fund_manager.name\nLIMIT 50", 0, 0.0015606880187988281], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE ( pof.public_offering_fund.name == \"金属\" OR pof.public_offering_fund.name == \"矿业\" ) AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN fm.fund_manager.name\nLIMIT 50", 0, 0.0016367435455322266]]}, {"query": "王南宫基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '王南宫' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"王南宫\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001455068588256836], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"王南宫\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014662742614746094]]}, {"query": "技子保份股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技子保份' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"技子\" OR s.stock.name == \"保份\" ) AND s.stock.name == \"技子保份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014438629150390625], ["MATCH (s:stock)\nWHERE s.stock.name == \"技子保份\" AND ( s.stock.name == \"技子\" OR s.stock.name == \"保份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014922618865966797]]}, {"query": "有哪些股东是技子保份股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技子保份' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"技子保份\" AND ( s.stock.name == \"技子\" OR s.stock.name == \"保份\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003509521484375], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"技子\" OR s.stock.name == \"保份\" ) AND s.stock.name == \"技子保份\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003714561462402344]]}, {"query": "融医筑资股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融医筑资' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"融医筑资\" AND ( s.stock.name == \"融医\" OR s.stock.name == \"筑资\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001314401626586914], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"融医\" OR s.stock.name == \"筑资\" ) AND s.stock.name == \"融医筑资\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015006065368652344]]}, {"query": "有哪些股东是融医筑资股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融医筑资' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"融医筑资\" AND ( s.stock.name == \"融医\" OR s.stock.name == \"筑资\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00028443336486816406], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"融医\" OR s.stock.name == \"筑资\" ) AND s.stock.name == \"融医筑资\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.000232696533203125]]}, {"query": "魏伯赏基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏伯赏' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏伯赏\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001447439193725586], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏伯赏\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001482248306274414]]}, {"query": "有哪些托管给魏伯赏基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏伯赏' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏伯赏\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014214515686035156], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏伯赏\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001453399658203125]]}, {"query": "源融发资展股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '源融发资展' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资展\" AND s.stock.name == \"源融\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013582706451416016], ["MATCH (s:stock)\nWHERE s.stock.name == \"源融\" AND s.stock.name == \"资展\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012145042419433594]]}, {"query": "有哪些股东是源融发资展股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '源融发资展' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资展\" AND s.stock.name == \"源融\" \nRETURN n.name\nLIMIT 50", 0, 0.0003097057342529297], ["MATCH (s:stock)\nWHERE s.stock.name == \"源融\" AND s.stock.name == \"资展\" \nRETURN n.name\nLIMIT 50", 0, 0.0002887248992919922]]}, {"query": "兴业聚源混合C基金托管给的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '兴业聚源混合C' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"兴业聚\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013775825500488281], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND pof.public_offering_fund.name == \"兴业聚\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013427734375]]}, {"query": "有哪些管理兴业聚源混合C公募基金的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '兴业聚源混合C' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"兴业聚\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0012509822845458984], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND pof.public_offering_fund.name == \"兴业聚\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0012280941009521484]]}, {"query": "有哪些托管给沈叔孙基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '沈叔孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈叔孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001659393310546875], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"沈叔孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016613006591796875]]}, {"query": "有哪些托管给韩西门基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '韩西门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"韩西门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017549991607666016], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"韩西门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015308856964111328]]}, {"query": "地通服有团股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '地通服有团' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"地通\" OR s.stock.name == \"服有\" ) AND s.stock.name == \"地通服有团\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014662742614746094], ["MATCH (s:stock)\nWHERE s.stock.name == \"地通服有团\" AND ( s.stock.name == \"地通\" OR s.stock.name == \"服有\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014929771423339844]]}, {"query": "有哪些股东是地通服有团股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '地通服有团' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"地通\" OR s.stock.name == \"服有\" ) AND s.stock.name == \"地通服有团\" \nRETURN n.name\nLIMIT 50", 0, 0.0002868175506591797], ["MATCH (s:stock)\nWHERE s.stock.name == \"地通服有团\" AND ( s.stock.name == \"地通\" OR s.stock.name == \"服有\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002181529998779297]]}, {"query": "有哪些名下有宝钛股份股票的老板", "golden": "MATCH (s1:stock)<-[icf:is_chairman_of]-(c2:chairman) WHERE s1.stock.name == '宝钛股份' RETURN c2.chairman.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝钛股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017762184143066406], ["MATCH (s:stock)\nWHERE s.stock.name == \"宝钛股份\" AND ( s.stock.name == \"宝钛股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0019135475158691406]]}, {"query": "航空航天行业包括的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '航空航天' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0024170875549316406], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0024230480194091797]]}, {"query": "钢铁产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '钢铁' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036742687225341797], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038890838623046875]]}, {"query": "有哪些上游是钢铁产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '钢铁' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003660917282104492], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033609867095947266]]}, {"query": "有哪些托管给窦宰父基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '窦宰父' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"窦宰父\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001519918441772461], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"窦宰父\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013854503631591797]]}, {"query": "资发子股司股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资发子股司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资发\" AND s.stock.name == \"股司\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013065338134765625], ["MATCH (s:stock)\nWHERE s.stock.name == \"股司\" AND s.stock.name == \"资发\" \nRETURN s.stock\nLIMIT 50", 0, 0.001313924789428711]]}, {"query": "有哪些股东是资发子股司股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '资发子股司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"资发\" AND s.stock.name == \"股司\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00030422210693359375], ["MATCH (s:stock)\nWHERE s.stock.name == \"股司\" AND s.stock.name == \"资发\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00024247169494628906]]}, {"query": "电地展能股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '电地展能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"地展\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"电地展能\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014407634735107422], ["MATCH (s:stock)\nWHERE s.stock.name == \"电地展能\" AND ( s.stock.name == \"地展\" OR s.stock.name == \"能股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015110969543457031]]}, {"query": "有哪些股东是电地展能股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '电地展能' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电地展能\" AND ( s.stock.name == \"地展\" OR s.stock.name == \"能股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00033092498779296875], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"地展\" OR s.stock.name == \"能股\" ) AND s.stock.name == \"电地展能\" \nRETURN n.name\nLIMIT 50", 0, 0.0002925395965576172]]}, {"query": "景顺长城国证新能源车电池ETF联接D基金托管给的基金管理人", "golden": "MATCH (pof1:public_offering_fund)<-[m:manage]-(fm2:fund_manager) WHERE pof1.public_offering_fund.name == '景顺长城国证新能源车电池ETF联接D' RETURN fm2.fund_manager.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"能源\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0012862682342529297], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"金管理\" AND pof.public_offering_fund.name == \"能源\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0012745857238769531]]}, {"query": "公份投子股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '公份投子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"公份投子\" AND ( s.stock.name == \"公份\" OR s.stock.name == \"投子\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013537406921386719], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"公份\" OR s.stock.name == \"投子\" ) AND s.stock.name == \"公份投子\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013992786407470703]]}, {"query": "有哪些股东是公份投子股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '公份投子' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"公份\" OR s.stock.name == \"投子\" ) AND s.stock.name == \"公份投子\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003120899200439453], ["MATCH (s:stock)\nWHERE s.stock.name == \"公份投子\" AND ( s.stock.name == \"公份\" OR s.stock.name == \"投子\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002391338348388672]]}, {"query": "融通沪港深智慧生活灵活配置混合基金的上市公司", "golden": "MATCH (pof1:public_offering_fund)-[h:hold]->(s2:stock) WHERE pof1.public_offering_fund.name == '融通沪港深智慧生活灵活配置混合' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"合基金\" AND s.stock.name == \"融通\" \nRETURN s.stock\nLIMIT 50", 0, 0.001497030258178711], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"融通\" AND pof.public_offering_fund.name == \"合基金\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015559196472167969]]}, {"query": "酒店和度假村产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '酒店和度假村' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"酒店\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014464855194091797], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"酒店\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014255046844482422]]}, {"query": "有哪些上游是酒店和度假村产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '酒店和度假村' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"酒店\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015254020690917969], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"酒店\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014717578887939453]]}, {"query": "褚上官基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0020110607147216797], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001617431640625]]}, {"query": "有哪些托管给褚上官基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚上官' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚上官\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016317367553710938], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚上官\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014846324920654297]]}]