[{"query": "有哪些参股了渤海化学上市公司并且持股比例小于47%的股东", "golden": "MATCH (s1:stock)<-[iso:is_stockholder_of]-(sh2:stockholder) WHERE s1.stock.name == '渤海化学' AND iso.shareholding_ratio < 47 RETURN sh2.stockholder.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE h.position_ratio < 47 AND s.stock.name == \"化学\" \nRETURN n.name\nLIMIT 50", 0, 0.0003139972686767578], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"化学\" AND h.position_ratio < 47 \nRETURN n.name\nLIMIT 50", 0, 0.0002219676971435547]]}, {"query": "技司务医股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技司务医' AND iso.shareholding_ratio < 37 RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"技司务医\" \nRETURN s.stock\nLIMIT 50", 0, 0.001340627670288086], ["MATCH (s:stock)\nWHERE s.stock.name == \"技司务医\" AND ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0012867450714111328]]}, {"query": "有哪些股东是技司务医股东并且持股比例小于37%的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '技司务医' AND iso.shareholding_ratio < 37 RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) AND h.position_ratio < 37 AND s.stock.name == \"技司务医\" \nRETURN n.name\nLIMIT 50", 0, 0.0002961158752441406], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE h.position_ratio < 37 AND ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"技司务医\" \nRETURN n.name\nLIMIT 50", 0, 0.0002562999725341797], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"技司务医\" AND ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) AND h.position_ratio < 37 \nRETURN n.name\nLIMIT 50", 0, 0.00023174285888671875], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE h.position_ratio < 37 AND s.stock.name == \"技司务医\" AND ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00022149085998535156], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE s.stock.name == \"技司务医\" AND h.position_ratio < 37 AND ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002543926239013672], ["MATCH (s:stock)<-[h:hold]-(pof:public_offering_fund)\nWHERE ( s.stock.name == \"司务\" OR s.stock.name == \"医股\" ) AND s.stock.name == \"技司务医\" AND h.position_ratio < 37 \nRETURN n.name\nLIMIT 50", 0, 0.00023031234741210938]]}, {"query": "关联营口港的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '营口港' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00027871131896972656], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00021457672119140625]]}, {"query": "有哪些产业下游的产业关联营口港", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '营口港' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00029397010803222656], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"营口港\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00019288063049316406]]}, {"query": "上游是航空公司的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '航空公司' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001421213150024414], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001398324966430664]]}, {"query": "有哪些产业上游的产业上游是航空公司", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '航空公司' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014963150024414062], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"航空\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014481544494628906]]}, {"query": "关联水井坊的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '水井坊' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004903554916381836], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036287307739257812]]}, {"query": "有哪些产业下游的产业关联水井坊", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '水井坊' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003984928131103516], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004164934158325195]]}, {"query": "有哪些行业包括的上市公司股东是科能建", "golden": "MATCH (t2:trade)<-[bt2:belong_to]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '科能建' RETURN s.stock.name, t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"科能建\" AND s.stock.name == \"司股\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.0003459453582763672], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"科能建\" \nRETURN n.name,t.trade.name\nLIMIT 50", 0, 0.00023818016052246094]]}, {"query": "关联*ST金山的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '*ST金山' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST金\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002849102020263672], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST金\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00023627281188964844]]}, {"query": "有哪些产业上游的产业关联*ST金山", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '*ST金山' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST金\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002968311309814453], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST金\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00022363662719726562]]}, {"query": "上游是零售的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '零售' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017595291137695312], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002001523971557617]]}, {"query": "有哪些产业上游的产业上游是零售", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '零售' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018625259399414062], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002191305160522461]]}, {"query": "上游是污水处理的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '污水处理' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"水处理\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014684200286865234], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"水处理\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014781951904296875]]}, {"query": "有哪些产业上游的产业上游是污水处理", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '污水处理' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"水处理\" \nRETURN t.trade.name,indus1.industry.name\nLIMIT 50", 0, 0.001561880111694336], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"水处理\" \nRETURN t.trade.name,indus1.industry.name\nLIMIT 50", 0, 0.0015065670013427734]]}, {"query": "有哪些产业的上市公司股东是药融", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)<-[iso1:is_stockholder_of]-(sh1:stockholder) WHERE sh1.stockholder.name == '药融' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"药融\" AND s.stock.name == \"司股\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.00031757354736328125], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"司股\" AND s.stock.name == \"药融\" \nRETURN n.name,indus.industry.name\nLIMIT 50", 0, 0.0003006458282470703]]}, {"query": "关联华升股份的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华升股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002620220184326172], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0001914501190185547]]}, {"query": "有哪些产业下游的产业关联华升股份", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '华升股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002529621124267578], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.0002384185791015625]]}, {"query": "关联退市鹏起的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '退市鹏起' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036466121673583984], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003431081771850586]]}, {"query": "有哪些产业上游的产业关联退市鹏起", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '退市鹏起' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032515525817871094], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003751039505004883]]}, {"query": "关联春兰股份的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '春兰股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"春兰股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00028204917907714844], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"春兰股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00028634071350097656]]}, {"query": "有哪些产业上游的产业关联春兰股份", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '春兰股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"春兰股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00027370452880859375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"春兰股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00021195411682128906]]}, {"query": "关联环旭电子的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '环旭电子' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014574527740478516], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014109611511230469]]}, {"query": "有哪些产业上游的产业关联环旭电子", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '环旭电子' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014472007751464844], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电子\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014753341674804688]]}, {"query": "关联江苏银行的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '江苏银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013649463653564453], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014460086822509766]]}, {"query": "有哪些产业下游的产业关联江苏银行", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '江苏银行' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014090538024902344], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"银行\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014050006866455078]]}, {"query": "属于航空航天的股票关联的产业有哪些", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '航空航天' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0039424896240234375], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0038194656372070312]]}, {"query": "有哪些产业关联的上市公司属于航空航天", "golden": "MATCH (n2:industry)<-[a2:associate]-(s:stock)-[bt1:belong_to]->(t1:trade) WHERE t1.trade.name == '航空航天' RETURN s.stock.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) \nRETURN indus.industry.name\nLIMIT 50", 0, 0.004010438919067383], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( indus.industry.name == \"航空\" OR indus.industry.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN indus.industry.name\nLIMIT 50", 0, 0.0036988258361816406]]}, {"query": "关联太极实业的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '太极实业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"太极实业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003032684326171875], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"太极实业\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00022554397583007812]]}, {"query": "有哪些产业下游的产业关联太极实业", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '太极实业' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"太极实业\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002961158752441406], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"太极实业\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0001971721649169922]]}, {"query": "关联白云机场的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '白云机场' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"白云机场\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003020763397216797], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"白云机场\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002655982971191406]]}, {"query": "有哪些产业上游的产业关联白云机场", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '白云机场' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"白云机场\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00028705596923828125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"白云机场\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00021195411682128906]]}, {"query": "关联上海能源的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"上海能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002713203430175781], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"上海能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002644062042236328]]}, {"query": "有哪些产业上游的产业关联上海能源", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海能源' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"上海能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00026702880859375], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"上海能源\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00027298927307128906]]}, {"query": "关联银座股份的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '银座股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002856254577636719], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002639293670654297]]}, {"query": "有哪些产业下游的产业关联银座股份", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '银座股份' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00030612945556640625], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"股份\" \nRETURN n.name,indus1.industry.name\nLIMIT 50", 0, 0.00025391578674316406]]}, {"query": "上游是饭店和度假村的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '饭店和度假村' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0039560794830322266], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0035507678985595703]]}, {"query": "有哪些产业上游的产业上游是饭店和度假村", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '饭店和度假村' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003432750701904297], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033898353576660156]]}, {"query": "关联上海电气的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海电气' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003429889678955078], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003261089324951172]]}, {"query": "有哪些产业下游的产业关联上海电气", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '上海电气' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033376216888427734], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003550291061401367]]}, {"query": "关联中原证券的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中原证券' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003789186477661133], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036039352416992188]]}, {"query": "有哪些产业下游的产业关联中原证券", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中原证券' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0033414363861083984], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0034341812133789062]]}, {"query": "关联ST龙净的产业上游的产业有哪些", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST龙净' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST龙\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0003135204315185547], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST龙\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0002505779266357422]]}, {"query": "有哪些产业下游的产业关联ST龙净", "golden": "MATCH (n2:industry)-[af2:affect]->(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == 'ST龙净' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"ST龙\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.0002703666687011719], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"ST龙\" \nRETURN s.stock.name,indus1.industry.name\nLIMIT 50", 0, 0.00021505355834960938]]}, {"query": "关联西藏旅游的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '西藏旅游' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"旅游\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014562606811523438], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"旅游\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001474142074584961]]}, {"query": "有哪些产业上游的产业关联西藏旅游", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '西藏旅游' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"旅游\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001596212387084961], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"旅游\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0013594627380371094]]}, {"query": "关联中国西电的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中国西电' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0036919116973876953], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00334930419921875]]}, {"query": "有哪些产业上游的产业关联中国西电", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '中国西电' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.004144191741943359], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00389862060546875]]}, {"query": "关联退市罗顿的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '退市罗顿' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003251314163208008], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0030188560485839844]]}, {"query": "有哪些产业上游的产业关联退市罗顿", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '退市罗顿' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003094196319580078], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032854080200195312]]}, {"query": "上游是电脑硬件的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电脑硬件' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0032541751861572266], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003172636032104492]]}, {"query": "有哪些产业上游的产业上游是电脑硬件", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '电脑硬件' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0038988590240478516], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00388336181640625]]}, {"query": "上游是高科技的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '高科技' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014185905456542969], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014040470123291016]]}, {"query": "有哪些产业上游的产业上游是高科技", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '高科技' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014023780822753906], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"科技\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0014197826385498047]]}, {"query": "上游是房地产的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '房地产' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0017638206481933594], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002205371856689453]]}, {"query": "有哪些产业上游的产业上游是房地产", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[af1:affect]-(n1:industry) WHERE n1.industry.name == '房地产' RETURN n.industry.name, n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018162727355957031], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002073526382446289]]}, {"query": "关联南京医药的产业下游的产业有哪些", "golden": "MATCH (n2:industry)<-[af2:affect]-(n:industry)<-[a1:associate]-(s1:stock) WHERE s1.stock.name == '南京医药' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)<-[a:affect]-(indus1:industry)\nWHERE s.stock.name == \"南京医药\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.000274658203125], ["MATCH (s:stock)-[a:associate]->(indus:industry)-[a:affect]->(indus1:industry)\nWHERE s.stock.name == \"南京医药\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00025272369384765625]]}]