[{"query": "2016年10到12月股票春兰股份的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '春兰股份' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"春兰股份\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002630949020385742], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"春兰股份\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025482177734375]]}, {"query": "2017年1到3月股票浙数文化的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '浙数文化' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"文化\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014297962188720703], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"文化\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014560222625732422]]}, {"query": "股票贵州茅台2017年第三季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '贵州茅台' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"贵州茅台\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025947093963623047], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"贵州茅台\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024945735931396484], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"贵州茅台\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0026311874389648438], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"贵州茅台\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002482175827026367], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"贵州茅台\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025720596313476562], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"贵州茅台\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002495288848876953]]}, {"query": "2017年7到9月股票贵州茅台的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '贵州茅台' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"贵州茅台\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002524852752685547], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"贵州茅台\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0022766590118408203]]}, {"query": "股票航天晨光2017年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '航天晨光' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"航天晨光\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002444744110107422], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"航天晨光\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026197433471679688], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"航天晨光\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002463817596435547], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"航天晨光\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0027244091033935547], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"航天晨光\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002718687057495117], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"航天晨光\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002610445022583008]]}, {"query": "2017年7到9月股票航天晨光的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '航天晨光' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"航天晨光\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023245811462402344], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"航天晨光\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024518966674804688]]}, {"query": "股票电科芯片2013年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '电科芯片' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"电科\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015501976013183594], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"电科\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014901161193847656], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"电科\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015673637390136719], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"电科\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015683174133300781], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"电科\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015938282012939453], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"电科\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014820098876953125]]}, {"query": "2013年7到9月股票电科芯片的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '电科芯片' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"电科\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015671253204345703], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"电科\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015285015106201172]]}, {"query": "股票泰豪科技2013年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '泰豪科技' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"泰豪科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.00241851806640625], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"泰豪科技\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002574443817138672], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"泰豪科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002630472183227539], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"泰豪科技\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002529144287109375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"泰豪科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002451181411743164], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"泰豪科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024957656860351562]]}, {"query": "2013年7到9月股票泰豪科技的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '泰豪科技' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"泰豪科技\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002492189407348633], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"泰豪科技\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024399757385253906]]}, {"query": "股票深高速2016年第一季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '深高速' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"深高速\" AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025894641876220703], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"深高速\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025374889373779297], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"深高速\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0028357505798339844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"深高速\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0031714439392089844], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == \"深高速\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0032329559326171875], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"深高速\" AND sfi.stock_financial_information.quarter == 1 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.003042936325073242]]}, {"query": "2016年1到3月股票深高速的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2016 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '深高速' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"深高速\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025022029876708984], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"深高速\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023653507232666016]]}, {"query": "股票光明乳业2017年第二季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '光明乳业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025463104248046875], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025408267974853516], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"光明乳业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002444744110107422], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"光明乳业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002492189407348633], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002537250518798828], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002511262893676758]]}, {"query": "2017年4到6月股票光明乳业的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '光明乳业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"光明乳业\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025720596313476562], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"光明乳业\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024590492248535156]]}, {"query": "股票上港集团2013年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '上港集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"上港集\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002018451690673828], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"上港集\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001978635787963867], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"上港集\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001585245132446289], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"上港集\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015022754669189453], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"上港集\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0019617080688476562], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"上港集\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015430450439453125]]}, {"query": "2013年7到9月股票上港集团的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '上港集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"上港集\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014748573303222656], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"上港集\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014662742614746094]]}, {"query": "股票东风汽车2017年第三季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '东风汽车' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"东风汽车\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0027556419372558594], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"东风汽车\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002656221389770508], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"东风汽车\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0026254653930664062], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"东风汽车\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002508878707885742], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"东风汽车\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024902820587158203], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"东风汽车\" AND sfi.stock_financial_information.`date` == date('2023-11-10') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002405405044555664]]}, {"query": "2017年7到9月股票东风汽车的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '东风汽车' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"东风汽车\" AND sfi.stock_financial_information.`date` == date('2023-11-10') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0026574134826660156], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-10') AND s.stock.name == \"东风汽车\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025463104248046875]]}, {"query": "化学行业的最低价在2021年5月10日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2021-05-10') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2021-5-10\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.023636817932128906], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-5-10\" ) AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.020185232162475586]]}, {"query": "2021年5月10日化学行业的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2021-05-10') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2021-5-10\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 1, 0.020919322967529297], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-5-10\" ) AND indus.industry.name == \"化学\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 1, 0.019031763076782227]]}, {"query": "2021年5月10日的化学行业的最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2021-05-10') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2021-5-10\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021712779998779297], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-5-10\" ) AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.019156455993652344]]}]