[{"query": "金健米业和茂业商业的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '金健米业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '茂业商业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金健米业\" AND s.stock.name == \"商业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017368793487548828], ["MATCH (s:stock)\nWHERE s.stock.name == \"商业\" AND s.stock.name == \"金健米业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013895034790039062]]}, {"query": "金健米业和茂业商业的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '金健米业' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '茂业商业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"金健米业\" AND s.stock.name == \"商业\" \nRETURN temp\nLIMIT 50", 0, 0.0002849102020263672], ["MATCH (s:stock)\nWHERE s.stock.name == \"商业\" AND s.stock.name == \"金健米业\" \nRETURN temp\nLIMIT 50", 0, 0.00023436546325683594]]}, {"query": "金融技术和能源的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '金融技术' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '能源' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"技术\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"能源\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN temp\nLIMIT 50", 0, 0.0025000572204589844], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"技术\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"能源\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0020170211791992188], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"技术\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) AND indus.industry.name == \"能源\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.002230405807495117], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"技术\" WITH indus.industry.scale as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"能源\" WITH indus.industry.scale as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN temp\nLIMIT 50", 0, 0.0023632049560546875]]}, {"query": "ST九有和厦门钨业上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST九有' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '厦门钨业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"厦门钨业\" AND s.stock.name == \"ST九\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016429424285888672], ["MATCH (s:stock)\nWHERE s.stock.name == \"ST九\" AND s.stock.name == \"厦门钨业\" \nRETURN s.stock\nLIMIT 50", 0, 0.001329660415649414]]}, {"query": "ST九有和厦门钨业上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST九有' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '厦门钨业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"厦门钨业\" AND s.stock.name == \"ST九\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016417503356933594], ["MATCH (s:stock)\nWHERE s.stock.name == \"ST九\" AND s.stock.name == \"厦门钨业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013539791107177734]]}, {"query": "ST九有和厦门钨业上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == 'ST九有' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '厦门钨业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"厦门钨业\" AND s.stock.name == \"ST九\" \nRETURN temp\nLIMIT 50", 0, 0.00033545494079589844], ["MATCH (s:stock)\nWHERE s.stock.name == \"ST九\" AND s.stock.name == \"厦门钨业\" \nRETURN temp\nLIMIT 50", 0, 0.0002422332763671875]]}, {"query": "家庭和个人用品和金属和矿业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '家庭和个人用品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '金属和矿业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"金属\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"矿业\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002548694610595703], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"金属\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"矿业\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002601146697998047], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"金属\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"矿业\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002193450927734375], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"金属\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND t.trade.name == \"矿业\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00022864341735839844]]}, {"query": "电信服务提供商和高科技的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"科技\" \nRETURN temp\nLIMIT 50", 0, 0.00028777122497558594], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003006458282470703]]}, {"query": "电信服务提供商和高科技的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '高科技' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"科技\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001436471939086914], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013685226440429688]]}, {"query": "中欧时代先锋股票C和易方达中证银行指数(LOF)C公募基金的管理费差额是多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '中欧时代先锋股票C' WITH pof.public_offering_fund.management_fee AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '易方达中证银行指数(LOF)C' WITH ABS(pof.public_offering_fund.management_fee - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"先锋股\" AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014531612396240234], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE indus.industry.name == \"银行\" AND s.stock.name == \"先锋股\" \nRETURN s.stock\nLIMIT 50", 0, 0.00142669677734375]]}, {"query": "中欧时代先锋股票C和易方达中证银行指数(LOF)C公募基金的管理费差距", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '中欧时代先锋股票C' WITH pof.public_offering_fund.management_fee AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '易方达中证银行指数(LOF)C' WITH ABS(pof.public_offering_fund.management_fee - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE s.stock.name == \"先锋股\" AND indus.industry.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014142990112304688], ["MATCH (s:stock)-[a:associate]->(indus:industry)\nWHERE indus.industry.name == \"银行\" AND s.stock.name == \"先锋股\" \nRETURN s.stock\nLIMIT 50", 0, 0.001407623291015625]]}, {"query": "融通量化多策略灵活配置混合A和华夏彭博中国政策性银行债券1-5年指数A基金的最新规模差多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通量化多策略灵活配置混合A' WITH pof.public_offering_fund.latest_scale AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '华夏彭博中国政策性银行债券1-5年指数A' WITH ABS(pof.public_offering_fund.latest_scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"银行\" \nRETURN temp\nLIMIT 50", 0, 0.0003228187561035156], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"银行\" AND pof.public_offering_fund.name == \"融通\" \nRETURN temp\nLIMIT 50", 0, 0.0002593994140625]]}, {"query": "融通量化多策略灵活配置混合A和华夏彭博中国政策性银行债券1-5年指数A基金的最新规模差距", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通量化多策略灵活配置混合A' WITH pof.public_offering_fund.latest_scale AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '华夏彭博中国政策性银行债券1-5年指数A' WITH ABS(pof.public_offering_fund.latest_scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"银行\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.001238107681274414], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"银行\" AND pof.public_offering_fund.name == \"融通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013148784637451172]]}, {"query": "陶东门和王南门的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '陶东门' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '王南门' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"陶东门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"王南门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶东门\" OR fm.fund_manager.name == \"王南门\" ) \nRETURN temp\nLIMIT 50", 0, 0.00024700164794921875], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶东门\" OR fm.fund_manager.name == \"王南门\" ) AND fm.fund_manager.name == \"陶东门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶东门\" OR fm.fund_manager.name == \"王南门\" ) AND fm.fund_manager.name == \"王南门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00036835670471191406], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶东门\" OR fm.fund_manager.name == \"王南门\" ) AND fm.fund_manager.name == \"陶东门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"王南门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00026535987854003906], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶东门\" OR fm.fund_manager.name == \"王南门\" ) AND fm.fund_manager.name == \"陶东门\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶东门\" OR fm.fund_manager.name == \"王南门\" ) AND fm.fund_manager.name == \"王南门\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"陶东门\" OR fm.fund_manager.name == \"王南门\" ) \nRETURN temp\nLIMIT 50", 0, 0.00018930435180664062]]}, {"query": "许诸葛和吴洛阳的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '许诸葛' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '吴洛阳' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"许诸葛\" OR fm.fund_manager.name == \"吴洛阳\" ) AND fm.fund_manager.name == \"许诸葛\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"吴洛阳\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004647254943847656], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"许诸葛\" OR fm.fund_manager.name == \"吴洛阳\" ) AND fm.fund_manager.name == \"许诸葛\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"许诸葛\" OR fm.fund_manager.name == \"吴洛阳\" ) AND fm.fund_manager.name == \"吴洛阳\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004464864730834961], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"许诸葛\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"吴洛阳\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"许诸葛\" OR fm.fund_manager.name == \"吴洛阳\" ) \nRETURN temp\nLIMIT 50", 0, 0.004520416259765625], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"许诸葛\" OR fm.fund_manager.name == \"吴洛阳\" ) AND fm.fund_manager.name == \"许诸葛\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"许诸葛\" OR fm.fund_manager.name == \"吴洛阳\" ) AND fm.fund_manager.name == \"吴洛阳\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"许诸葛\" OR fm.fund_manager.name == \"吴洛阳\" ) \nRETURN temp\nLIMIT 50", 0, 0.004518032073974609]]}, {"query": "酒精饮料和物流服务的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '物流服务' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002677440643310547], ["MATCH (t:trade)\nWHERE t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002503395080566406], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00028133392333984375], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"饮料\" OR t.trade.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002009868621826172]]}, {"query": "长沙银行和浙能电力的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '长沙银行' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '浙能电力' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND s.stock.name == \"银行\" \nRETURN temp\nLIMIT 50", 0, 0.00026535987854003906], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"能电\" \nRETURN temp\nLIMIT 50", 0, 0.0002522468566894531]]}, {"query": "长沙银行和浙能电力的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '长沙银行' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '浙能电力' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012676715850830078], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"能电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012497901916503906]]}, {"query": "长沙银行和浙能电力的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '长沙银行' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '浙能电力' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能电\" AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013031959533691406], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"能电\" \nRETURN s.stock\nLIMIT 50", 0, 0.001188516616821289]]}, {"query": "新钢股份和盛和资源上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '新钢股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '盛和资源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) AND s.stock.name == \"资源\" \nRETURN s.stock\nLIMIT 50", 0, 0.00125885009765625], ["MATCH (s:stock)\nWHERE s.stock.name == \"资源\" AND ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001321554183959961]]}, {"query": "新钢股份和盛和资源上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '新钢股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '盛和资源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) AND s.stock.name == \"资源\" \nRETURN temp\nLIMIT 50", 0, 0.00027251243591308594], ["MATCH (s:stock)\nWHERE s.stock.name == \"资源\" AND ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) \nRETURN temp\nLIMIT 50", 0, 0.00020813941955566406]]}, {"query": "新钢股份和盛和资源上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '新钢股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '盛和资源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) AND s.stock.name == \"资源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012378692626953125], ["MATCH (s:stock)\nWHERE s.stock.name == \"资源\" AND ( s.stock.name == \"新钢\" OR s.stock.name == \"股份\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001262664794921875]]}, {"query": "孙宇文和喻左丘的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '孙宇文' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '喻左丘' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"孙宇文\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"喻左丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"孙宇文\" OR fm.fund_manager.name == \"喻左丘\" ) \nRETURN temp\nLIMIT 50", 0, 0.004439115524291992], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"孙宇文\" OR fm.fund_manager.name == \"喻左丘\" ) AND fm.fund_manager.name == \"孙宇文\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"孙宇文\" OR fm.fund_manager.name == \"喻左丘\" ) AND fm.fund_manager.name == \"喻左丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0038726329803466797], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"孙宇文\" OR fm.fund_manager.name == \"喻左丘\" ) AND fm.fund_manager.name == \"孙宇文\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"孙宇文\" OR fm.fund_manager.name == \"喻左丘\" ) AND fm.fund_manager.name == \"喻左丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"孙宇文\" OR fm.fund_manager.name == \"喻左丘\" ) \nRETURN temp\nLIMIT 50", 0, 0.004480600357055664], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"孙宇文\" OR fm.fund_manager.name == \"喻左丘\" ) AND fm.fund_manager.name == \"孙宇文\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"喻左丘\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.004106283187866211]]}, {"query": "汽车零部件和航天和国防产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014636516571044922], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.002218008041381836]]}, {"query": "汽车零部件和航天和国防产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014181137084960938], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.002114534378051758]]}, {"query": "医疗保健和船舶和海运的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.001337289810180664], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.001562356948852539]]}, {"query": "医疗保健和船舶和海运的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"船舶\" \nRETURN temp\nLIMIT 50", 0, 0.00029015541076660156], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0003514289855957031]]}, {"query": "医疗保健和船舶和海运的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '船舶和海运' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"医疗\" AND t.trade.name == \"船舶\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012984275817871094], ["MATCH (t:trade)\nWHERE t.trade.name == \"船舶\" AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012984275817871094]]}, {"query": "昂立教育和信达地产上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '昂立教育' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '信达地产' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"地产\" AND s.stock.name == \"教育\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012354850769042969], ["MATCH (s:stock)\nWHERE s.stock.name == \"教育\" AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013265609741210938]]}, {"query": "昂立教育和信达地产上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '昂立教育' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '信达地产' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"地产\" AND s.stock.name == \"教育\" \nRETURN s.stock\nLIMIT 50", 0, 0.001313924789428711], ["MATCH (s:stock)\nWHERE s.stock.name == \"教育\" AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012898445129394531]]}, {"query": "昂立教育和信达地产上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '昂立教育' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '信达地产' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"教育\" AND s.stock.name == \"地产\" \nRETURN temp\nLIMIT 50", 0, 0.0003757476806640625], ["MATCH (s:stock)\nWHERE s.stock.name == \"地产\" AND s.stock.name == \"教育\" \nRETURN temp\nLIMIT 50", 0, 0.0003154277801513672]]}, {"query": "中国联通和林洋能源上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '中国联通' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '林洋能源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"中国联通\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014612674713134766], ["MATCH (s:stock)\nWHERE s.stock.name == \"中国联通\" AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016884803771972656]]}, {"query": "中国联通和林洋能源上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '中国联通' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '林洋能源' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"中国联通\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013692378997802734], ["MATCH (s:stock)\nWHERE s.stock.name == \"中国联通\" AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017113685607910156]]}, {"query": "国投电力和八一钢铁股票的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '国投电力' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '八一钢铁' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"电力\" OR s.stock.name == \"八一钢铁\" ) AND s.stock.name == \"投电\" \nRETURN temp\nLIMIT 50", 0, 0.0003600120544433594], ["MATCH (s:stock)\nWHERE s.stock.name == \"投电\" AND ( s.stock.name == \"电力\" OR s.stock.name == \"八一钢铁\" ) \nRETURN temp\nLIMIT 50", 0, 0.00028204917907714844]]}, {"query": "国投电力和八一钢铁股票的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '国投电力' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '八一钢铁' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"电力\" OR s.stock.name == \"八一钢铁\" ) AND s.stock.name == \"投电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013272762298583984], ["MATCH (s:stock)\nWHERE s.stock.name == \"投电\" AND ( s.stock.name == \"电力\" OR s.stock.name == \"八一钢铁\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014641284942626953]]}, {"query": "赵百里和杨司空的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '赵百里' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '杨司空' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"赵百里\" OR fm.fund_manager.name == \"杨司空\" ) AND fm.fund_manager.name == \"赵百里\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"赵百里\" OR fm.fund_manager.name == \"杨司空\" ) AND fm.fund_manager.name == \"杨司空\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"赵百里\" OR fm.fund_manager.name == \"杨司空\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002913475036621094], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"赵百里\" OR fm.fund_manager.name == \"杨司空\" ) AND fm.fund_manager.name == \"赵百里\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"赵百里\" OR fm.fund_manager.name == \"杨司空\" ) AND fm.fund_manager.name == \"杨司空\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002129077911376953], ["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"赵百里\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨司空\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"赵百里\" OR fm.fund_manager.name == \"杨司空\" ) \nRETURN temp\nLIMIT 50", 0, 0.00019693374633789062], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"赵百里\" OR fm.fund_manager.name == \"杨司空\" ) AND fm.fund_manager.name == \"赵百里\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨司空\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002028942108154297]]}]