[{"query": "2003年7月22日到2021年3月10日的上海三毛的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海三毛' AND sd.stock_data.`date` >= date('2003-07-22') AND sd.stock_data.`date` <= date('2021-03-10') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2003-7-22\" ) AND sd.stock_data.`date` == date( \"2021-3-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.015944957733154297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-10\" ) AND sd.stock_data.`date` == date( \"2003-7-22\" ) AND s.stock.name == \"上海三毛\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016836166381835938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-7-22\" ) AND sd.stock_data.`date` == date( \"2021-3-10\" ) AND s.stock.name == \"上海三毛\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016480445861816406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2021-3-10\" ) AND sd.stock_data.`date` == date( \"2003-7-22\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01684880256652832], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-10\" ) AND s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2003-7-22\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016611337661743164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-7-22\" ) AND s.stock.name == \"上海三毛\" AND sd.stock_data.`date` == date( \"2021-3-10\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.015224933624267578]]}, {"query": "华发股份上市公司2022年9月13日后83日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华发股份' AND sd.stock_data.`date` >= date('2022-09-13') AND sd.stock_data.`date` < date('2022-09-13')+83 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-9-13\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020570755004882812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-9-13\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018277168273925781]]}, {"query": "华发股份上市公司2022年9月13日后83天的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华发股份' AND sd.stock_data.`date` >= date('2022-09-13') AND sd.stock_data.`date` < date('2022-09-13')+83 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-9-13\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0018172264099121094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-9-13\" ) \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0016188621520996094]]}, {"query": "近40日上海九百股票的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海九百' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-40 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海九百\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016312599182128906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海九百\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01642894744873047]]}, {"query": "上海九百股票近40日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海九百' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-40 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"上海九百\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01641392707824707], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"上海九百\" \nRETURN s.stock\nLIMIT 50", 0, 0.018170833587646484]]}, {"query": "中直股份股票近93日的成交量是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中直股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-93 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.002012014389038086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018832683563232422]]}, {"query": "近93日中直股份股票的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中直股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-93 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0017824172973632812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0016245841979980469]]}, {"query": "羚锐制药1990年12月2日到2021年12月31日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '羚锐制药' AND sd.stock_data.`date` >= date('1990-12-02') AND sd.stock_data.`date` <= date('2021-12-31') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1990-12-2\" ) AND sd.stock_data.`date` == date( \"2021-12-31\" ) AND s.stock.name == \"制药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019402503967285156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-31\" ) AND s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"1990-12-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001813650131225586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1990-12-2\" ) AND s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"2021-12-31\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.00301361083984375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-31\" ) AND sd.stock_data.`date` == date( \"1990-12-2\" ) AND s.stock.name == \"制药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0033979415893554688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"1990-12-2\" ) AND sd.stock_data.`date` == date( \"2021-12-31\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017328262329101562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"2021-12-31\" ) AND sd.stock_data.`date` == date( \"1990-12-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001745462417602539]]}, {"query": "1990年12月2日到2021年12月31日的羚锐制药的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '羚锐制药' AND sd.stock_data.`date` >= date('1990-12-02') AND sd.stock_data.`date` <= date('2021-12-31') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1990-12-2\" ) AND sd.stock_data.`date` == date( \"2021-12-31\" ) AND s.stock.name == \"制药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018601417541503906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"2021-12-31\" ) AND sd.stock_data.`date` == date( \"1990-12-2\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015995502471923828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1990-12-2\" ) AND s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"2021-12-31\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001600027084350586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-31\" ) AND s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"1990-12-2\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015981197357177734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date( \"1990-12-2\" ) AND sd.stock_data.`date` == date( \"2021-12-31\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.00156402587890625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-31\" ) AND sd.stock_data.`date` == date( \"1990-12-2\" ) AND s.stock.name == \"制药\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001445770263671875]]}, {"query": "惠泉啤酒股票近79日的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '惠泉啤酒' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-79 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.05241703987121582], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0010542869567871094], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 5.376083135604858], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.00147247314453125]]}, {"query": "惠泉啤酒股票近79日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '惠泉啤酒' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-79 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0012738704681396484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"惠泉啤酒\" \nRETURN s.stock\nLIMIT 50", 0, 0.1152486801147461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"惠泉啤酒\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006926059722900391], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"惠泉啤酒\" \nRETURN s.stock\nLIMIT 50", 0, 0.44335508346557617]]}, {"query": "凤凰光学上市公司2021年9月4日前29天的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '凤凰光学' AND sd.stock_data.`date` <= date('2021-09-04') AND sd.stock_data.`date` > date('2021-09-04')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 29 AND s.stock.name == \"凤凰光学\" AND sd.stock_data.`date` == date( \"2021-9-4\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.018004417419433594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凤凰光学\" AND date('2023-11-11') - sd.stock_data.`date` <= 29 AND sd.stock_data.`date` == date( \"2021-9-4\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.017247915267944336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-4\" ) AND s.stock.name == \"凤凰光学\" AND date('2023-11-11') - sd.stock_data.`date` <= 29 \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016088485717773438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凤凰光学\" AND sd.stock_data.`date` == date( \"2021-9-4\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 29 \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016675472259521484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-4\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 29 AND s.stock.name == \"凤凰光学\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016582250595092773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 29 AND sd.stock_data.`date` == date( \"2021-9-4\" ) AND s.stock.name == \"凤凰光学\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016333818435668945]]}, {"query": "2021年9月4日前29日的凤凰光学上市公司的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '凤凰光学' AND sd.stock_data.`date` <= date('2021-09-04') AND sd.stock_data.`date` > date('2021-09-04')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 29 AND s.stock.name == \"凤凰光学\" AND sd.stock_data.`date` == date( \"2021-9-4\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01647019386291504], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凤凰光学\" AND date('2023-11-11') - sd.stock_data.`date` <= 29 AND sd.stock_data.`date` == date( \"2021-9-4\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01653909683227539], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-4\" ) AND s.stock.name == \"凤凰光学\" AND date('2023-11-11') - sd.stock_data.`date` <= 29 \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01805877685546875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凤凰光学\" AND sd.stock_data.`date` == date( \"2021-9-4\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 29 \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016086578369140625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-4\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 29 AND s.stock.name == \"凤凰光学\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.015616893768310547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 29 AND sd.stock_data.`date` == date( \"2021-9-4\" ) AND s.stock.name == \"凤凰光学\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0170440673828125]]}, {"query": "凤凰光学上市公司2021年9月4日前29日的成交量是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '凤凰光学' AND sd.stock_data.`date` <= date('2021-09-04') AND sd.stock_data.`date` > date('2021-09-04')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-4\" ) AND s.stock.name == \"凤凰光学\" AND date('2023-11-11') - sd.stock_data.`date` <= 29 \nRETURN s.stock\nLIMIT 50", 0, 0.016321659088134766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-4\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 29 AND s.stock.name == \"凤凰光学\" \nRETURN s.stock\nLIMIT 50", 0, 0.015048503875732422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 29 AND sd.stock_data.`date` == date( \"2021-9-4\" ) AND s.stock.name == \"凤凰光学\" \nRETURN s.stock\nLIMIT 50", 0, 0.016095399856567383], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凤凰光学\" AND date('2023-11-11') - sd.stock_data.`date` <= 29 AND sd.stock_data.`date` == date( \"2021-9-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015393972396850586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 29 AND s.stock.name == \"凤凰光学\" AND sd.stock_data.`date` == date( \"2021-9-4\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015561103820800781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"凤凰光学\" AND sd.stock_data.`date` == date( \"2021-9-4\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 29 \nRETURN s.stock\nLIMIT 50", 0, 0.016187191009521484]]}, {"query": "2023年8月10日后20日的金健米业的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金健米业' AND sd.stock_data.`date` >= date('2023-08-10') AND sd.stock_data.`date` < date('2023-08-10')+20 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-10\" ) AND s.stock.name == \"金健米业\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016352176666259766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金健米业\" AND sd.stock_data.`date` == date( \"2023-8-10\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01563119888305664]]}, {"query": "金健米业2023年8月10日后20日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金健米业' AND sd.stock_data.`date` >= date('2023-08-10') AND sd.stock_data.`date` < date('2023-08-10')+20 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-10\" ) AND s.stock.name == \"金健米业\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.015078306198120117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金健米业\" AND sd.stock_data.`date` == date( \"2023-8-10\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.019911766052246094]]}, {"query": "金健米业2023年8月10日后20天的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金健米业' AND sd.stock_data.`date` >= date('2023-08-10') AND sd.stock_data.`date` < date('2023-08-10')+20 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-10\" ) AND s.stock.name == \"金健米业\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01625204086303711], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金健米业\" AND sd.stock_data.`date` == date( \"2023-8-10\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01627373695373535]]}, {"query": "近81日桂冠电力上市公司的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '桂冠电力' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-81 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"桂冠电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016170501708984375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"桂冠电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.015264034271240234]]}, {"query": "桂冠电力上市公司近81日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '桂冠电力' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-81 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"桂冠电力\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01643514633178711], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"桂冠电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0148468017578125]]}, {"query": "*ST商城2002年7月21日到2023年12月6日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '*ST商城' AND sd.stock_data.`date` >= date('2002-07-21') AND sd.stock_data.`date` <= date('2023-12-06') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-7-21\" ) AND sd.stock_data.`date` == date( \"2023-12-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018115043640136719], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-6\" ) AND sd.stock_data.`date` == date( \"2002-7-21\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02154374122619629]]}, {"query": "2002年7月21日到2023年12月6日的*ST商城的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '*ST商城' AND sd.stock_data.`date` >= date('2002-07-21') AND sd.stock_data.`date` <= date('2023-12-06') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-7-21\" ) AND sd.stock_data.`date` == date( \"2023-12-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018911361694335938], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-12-6\" ) AND sd.stock_data.`date` == date( \"2002-7-21\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02125382423400879]]}, {"query": "华远地产近48日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华远地产' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-48 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001955747604370117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015985965728759766]]}, {"query": "华远地产近48日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华远地产' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-48 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019683837890625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001584768295288086]]}, {"query": "近48日华远地产的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华远地产' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-48 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"地产\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001682281494140625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"地产\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0014896392822265625]]}, {"query": "光明乳业上市公司2020年4月6日后30日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` >= date('2020-04-06') AND sd.stock_data.`date` < date('2020-04-06')+30 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-6\" ) AND s.stock.name == \"光明乳业\" \nRETURN s.stock\nLIMIT 50", 0, 0.01595139503479004], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date( \"2020-4-6\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01676201820373535]]}, {"query": "2020年4月6日后30日的光明乳业上市公司的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '光明乳业' AND sd.stock_data.`date` >= date('2020-04-06') AND sd.stock_data.`date` < date('2020-04-06')+30 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-4-6\" ) AND s.stock.name == \"光明乳业\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.017408370971679688], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"光明乳业\" AND sd.stock_data.`date` == date( \"2020-4-6\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01746082305908203]]}, {"query": "南京医药上市公司近98日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '南京医药' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"南京医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.01545858383178711], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01621723175048828]]}, {"query": "南京医药上市公司近98日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '南京医药' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.015909433364868164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"南京医药\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016094446182250977]]}, {"query": "2019年1月22日到2022年4月30日的沧州大化的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` >= date('2019-01-22') AND sd.stock_data.`date` <= date('2022-04-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-4-30\" ) AND s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2019-1-22\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01652240753173828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-4-30\" ) AND sd.stock_data.`date` == date( \"2019-1-22\" ) AND s.stock.name == \"沧州大化\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.015355825424194336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2019-1-22\" ) AND sd.stock_data.`date` == date( \"2022-4-30\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01672840118408203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-1-22\" ) AND sd.stock_data.`date` == date( \"2022-4-30\" ) AND s.stock.name == \"沧州大化\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016945838928222656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-1-22\" ) AND s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2022-4-30\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.015433073043823242], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"沧州大化\" AND sd.stock_data.`date` == date( \"2022-4-30\" ) AND sd.stock_data.`date` == date( \"2019-1-22\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016024351119995117]]}]