[{"query": "医疗保健设施行业近84日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-84 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0020999908447265625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019905567169189453]]}, {"query": "近43日医疗保健设施行业的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-43 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0018620491027832031], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.002022266387939453]]}, {"query": "医疗保健设施行业近43日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-43 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.002189159393310547], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0021097660064697266]]}, {"query": "医疗保健设施行业近43日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-43 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0021936893463134766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price\nLIMIT 50", 0, 0.0019271373748779297]]}, {"query": "医疗保健行业近94日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-94 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0021283626556396484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade\nLIMIT 50", 0, 0.0020210742950439453]]}, {"query": "医疗保健行业近94日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-94 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0019485950469970703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001725912094116211]]}, {"query": "金融服务行业1999年4月22日到2022年9月15日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` >= date('1999-04-22') AND td.trade_data.`date` <= date('2022-09-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0023469924926757812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-15\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007548332214355469], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-15\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0061838626861572266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1999-4-22\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002048492431640625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00876927375793457], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1999-4-22\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0018763542175292969]]}, {"query": "1999年4月22日到2022年9月15日的金融服务行业的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金融服务' AND td.trade_data.`date` >= date('1999-04-22') AND td.trade_data.`date` <= date('2022-09-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0020618438720703125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-15\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.00687408447265625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-9-15\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.006193637847900391], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) AND td.trade_data.`date` == date( \"1999-4-22\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.006448268890380859], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1999-4-22\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018954277038574219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1999-4-22\" ) AND ( t.trade.name == \"金融\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date( \"2022-9-15\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001810312271118164]]}, {"query": "金属和矿业行业近46日的开盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-46 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008206367492675781], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.006909847259521484]]}, {"query": "金属和矿业行业近46日的开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-46 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0005586147308349609], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.00037980079650878906]]}, {"query": "近11日食品和饮料的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-11 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price,m.name\nLIMIT 50", 0, 0.0005490779876708984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.minimum_price,m.name\nLIMIT 50", 0, 0.0004487037658691406]]}, {"query": "食品和饮料近11日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-11 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.minimum_price,m.name\nLIMIT 50", 0, 0.0005691051483154297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.minimum_price,m.name\nLIMIT 50", 0, 0.00034880638122558594]]}, {"query": "食品和饮料近11日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-11 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007615566253662109], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.008617877960205078]]}, {"query": "物流服务行业近62日的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-62 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.006791830062866211], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.maximum_price\nLIMIT 50", 0, 0.007176637649536133]]}, {"query": "物流服务行业近62日的最高价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '物流服务' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-62 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00698542594909668], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"物流\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005820751190185547]]}, {"query": "1993年7月28日到2023年7月15日的航空公司的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` >= date('1993-07-28') AND td.trade_data.`date` <= date('2023-07-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-7-15\" ) AND td.trade_data.`date` == date( \"1993-7-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002584695816040039], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1993-7-28\" ) AND td.trade_data.`date` == date( \"2023-7-15\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.002312183380126953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-15\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1993-7-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021936893463134766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-28\" ) AND td.trade_data.`date` == date( \"2023-7-15\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0016815662384033203], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-28\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-7-15\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017311573028564453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-15\" ) AND td.trade_data.`date` == date( \"1993-7-28\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0015752315521240234]]}, {"query": "航空公司1993年7月28日到2023年7月15日的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` >= date('1993-07-28') AND td.trade_data.`date` <= date('2023-07-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-7-15\" ) AND td.trade_data.`date` == date( \"1993-7-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018320083618164062], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1993-7-28\" ) AND td.trade_data.`date` == date( \"2023-7-15\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0016069412231445312], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-15\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1993-7-28\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001684427261352539], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-28\" ) AND td.trade_data.`date` == date( \"2023-7-15\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017611980438232422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-28\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-7-15\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0015902519226074219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-15\" ) AND td.trade_data.`date` == date( \"1993-7-28\" ) AND t.trade.name == \"航空\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.001514434814453125]]}, {"query": "航空公司1993年7月28日到2023年7月15日的最低价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '航空公司' AND td.trade_data.`date` >= date('1993-07-28') AND td.trade_data.`date` <= date('2023-07-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-28\" ) AND td.trade_data.`date` == date( \"2023-7-15\" ) AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.0018639564514160156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-7-15\" ) AND td.trade_data.`date` == date( \"1993-7-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017385482788085938], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-15\" ) AND td.trade_data.`date` == date( \"1993-7-28\" ) AND t.trade.name == \"航空\" \nRETURN t.trade\nLIMIT 50", 0, 0.0017962455749511719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"1993-7-28\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"2023-7-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015990734100341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-7-15\" ) AND t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1993-7-28\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0015094280242919922], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"航空\" AND td.trade_data.`date` == date( \"1993-7-28\" ) AND td.trade_data.`date` == date( \"2023-7-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0014467239379882812]]}, {"query": "电信设备行业近72日的收盘价是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-72 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.016721010208129883], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN t.trade\nLIMIT 50", 0, 0.016910791397094727]]}, {"query": "近72日电信设备行业的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-72 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.016640663146972656], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.019080638885498047]]}, {"query": "电信设备行业近72日的收盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-72 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.017515182495117188], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN td.trade_data.closing_price\nLIMIT 50", 0, 0.016837596893310547]]}, {"query": "近48日食品和饮料的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-48 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.0007879734039306641], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.0005075931549072266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.0004851818084716797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.0004038810729980469]]}, {"query": "食品和饮料近48日的涨跌幅是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-48 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013300657272338867], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.023676633834838867], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0007543563842773438], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0006222724914550781]]}, {"query": "食品和饮料近48日的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-48 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.0006964206695556641], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.0004074573516845703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.0003325939178466797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2023-9-20\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range,m.name\nLIMIT 50", 0, 0.00030350685119628906]]}, {"query": "近58日零售行业的涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` <= date('2023-11-11') AND td.trade_data.`date` > date('2023-11-11')-58 RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2023-9-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.0007007122039794922], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2023-9-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.00048041343688964844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2023-9-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 0.05720067024230957], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-9-10\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" \nRETURN td.trade_data.range\nLIMIT 50", 0, 20.42467761039734]]}]