[{"query": "有哪些包括远东股份股票的行业", "golden": "MATCH (s1:stock)-[bt:belong_to]->(t2:trade) WHERE s1.stock.name == '远东股份' RETURN t2.trade.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"远东股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"远东股份\" \nRETURN t.trade.name\nLIMIT 50", 0, 0.0023899078369140625], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"远东股份\" AND ( s.stock.name == \"远东股\" OR s.stock.name == \"份股\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.0030045509338378906]]}, {"query": "金融技术产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '金融技术' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0021181106567382812], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0028998851776123047]]}, {"query": "有哪些上游是金融技术产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '金融技术' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019555091857910156], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"金融\" OR indus.industry.name == \"技术\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002269268035888672]]}, {"query": "饭店和度假村产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '饭店和度假村' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.005134105682373047], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.005734682083129883]]}, {"query": "有哪些上游是饭店和度假村产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '饭店和度假村' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.003498554229736328], ["MATCH (indus1:industry)\nRETURN indus1.industry.name\nLIMIT 50", 0, 0.016576290130615234]]}, {"query": "融医司制药股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融医司制药' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"融医司制药\" AND ( s.stock.name == \"医司\" OR s.stock.name == \"制药\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001512289047241211], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"医司\" OR s.stock.name == \"制药\" ) AND s.stock.name == \"融医司制药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014698505401611328]]}, {"query": "有哪些股东是融医司制药股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '融医司制药' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"医司\" OR s.stock.name == \"制药\" ) AND s.stock.name == \"融医司制药\" \nRETURN n.name\nLIMIT 50", 0, 0.00035190582275390625], ["MATCH (s:stock)\nWHERE s.stock.name == \"融医司制药\" AND ( s.stock.name == \"医司\" OR s.stock.name == \"制药\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0003185272216796875]]}, {"query": "有哪些托管给姜宇文基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '姜宇文' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"姜宇文\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014226436614990234], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"姜宇文\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014407634735107422]]}, {"query": "物流服务产业关联的上市公司", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '物流服务' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服务\" AND ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016055107116699219], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"物流\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"服务\" \nRETURN s.stock\nLIMIT 50", 0, 0.002362966537475586]]}, {"query": "有哪些托管给韩叔孙基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '韩叔孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"韩叔孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016226768493652344], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"韩叔孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001628875732421875]]}, {"query": "娱乐设备产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '娱乐设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015654563903808594], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016815662384033203]]}, {"query": "有哪些上游是娱乐设备产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '娱乐设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016720294952392578], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"娱乐\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001600503921508789]]}, {"query": "谢谷梁基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '谢谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"谢谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00164031982421875], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"谢谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015630722045898438]]}, {"query": "电力工具和设备产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电力工具和设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019538402557373047], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002275228500366211]]}, {"query": "有哪些上游是电力工具和设备产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电力工具和设备' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018253326416015625], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"电力\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002154111862182617]]}, {"query": "有哪些托管给朱呼延基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱呼延' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱呼延\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015323162078857422], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱呼延\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016705989837646484]]}, {"query": "电信服务提供商产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电信服务提供商' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002111673355102539], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0024187564849853516]]}, {"query": "有哪些上游是电信服务提供商产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '电信服务提供商' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0020525455474853516], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0024156570434570312]]}, {"query": "讯有资技股东持股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '讯有资技' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"讯有\" OR s.stock.name == \"资技\" ) AND s.stock.name == \"讯有资技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014209747314453125], ["MATCH (s:stock)\nWHERE s.stock.name == \"讯有资技\" AND ( s.stock.name == \"讯有\" OR s.stock.name == \"资技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016245841979980469]]}, {"query": "有哪些股东是讯有资技股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '讯有资技' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"讯有\" OR s.stock.name == \"资技\" ) AND s.stock.name == \"讯有资技\" \nRETURN n.name\nLIMIT 50", 0, 0.00031566619873046875], ["MATCH (s:stock)\nWHERE s.stock.name == \"讯有资技\" AND ( s.stock.name == \"讯有\" OR s.stock.name == \"资技\" ) \nRETURN n.name\nLIMIT 50", 0, 0.0002543926239013672]]}, {"query": "孔梁丘基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔梁丘' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔梁丘\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017778873443603516], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔梁丘\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015568733215332031]]}, {"query": "房医能服展股东持股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '房医能服展' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"医能\" OR s.stock.name == \"服展\" ) AND s.stock.name == \"房医能服展\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014657974243164062], ["MATCH (s:stock)\nWHERE s.stock.name == \"房医能服展\" AND ( s.stock.name == \"医能\" OR s.stock.name == \"服展\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018079280853271484]]}, {"query": "有哪些股东是房医能服展股东的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '房医能服展' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"医能\" OR s.stock.name == \"服展\" ) AND s.stock.name == \"房医能服展\" \nRETURN n.name\nLIMIT 50", 0, 0.00038504600524902344], ["MATCH (s:stock)\nWHERE s.stock.name == \"房医能服展\" AND ( s.stock.name == \"医能\" OR s.stock.name == \"服展\" ) \nRETURN n.name\nLIMIT 50", 0, 0.00029468536376953125]]}, {"query": "份融环子司股东参股的上市公司", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '份融环子司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"融环\" OR s.stock.name == \"子司\" ) AND s.stock.name == \"份融环子司\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015120506286621094], ["MATCH (s:stock)\nWHERE s.stock.name == \"份融环子司\" AND ( s.stock.name == \"融环\" OR s.stock.name == \"子司\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001397848129272461]]}, {"query": "有哪些股东是份融环子司股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '份融环子司' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"份融环子司\" AND ( s.stock.name == \"融环\" OR s.stock.name == \"子司\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.00032329559326171875], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"融环\" OR s.stock.name == \"子司\" ) AND s.stock.name == \"份融环子司\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0002512931823730469]]}, {"query": "有哪些属于运输和物流行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '运输和物流' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"运输\" AND ( s.stock.name == \"运输\" OR s.stock.name == \"物流\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014505386352539062], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"运输\" OR s.stock.name == \"物流\" ) AND s.stock.name == \"运输\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013666152954101562]]}, {"query": "何岳基金管理人拥有的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '何岳' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"何岳\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0013785362243652344], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"何岳\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015583038330078125]]}, {"query": "航天和国防产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '航天和国防' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"航天\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019788742065429688], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"航天\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0018415451049804688]]}, {"query": "有哪些上游是航天和国防产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '航天和国防' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"航天\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015399456024169922], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"航天\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0016009807586669922]]}, {"query": "有哪些托管给魏司空基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '魏司空' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"魏司空\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015411376953125], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"魏司空\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015969276428222656]]}, {"query": "郑赫连基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '郑赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"郑赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001500844955444336], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"郑赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015158653259277344]]}, {"query": "运输和物流产业关联的股票", "golden": "MATCH (n1:industry)<-[a:associate]-(s2:stock) WHERE n1.industry.name == '运输和物流' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) AND indus.industry.name == \"物流\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015287399291992188], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"物流\" AND ( indus.industry.name == \"运输\" OR indus.industry.name == \"物流\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0032486915588378906]]}, {"query": "有哪些托管给沈东门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '沈东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001580953598022461], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"沈东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015666484832763672]]}, {"query": "孔微生基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孔微生' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孔微生\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017082691192626953], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孔微生\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015020370483398438]]}, {"query": "有哪些属于金融技术行业的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '金融技术' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND s.stock.name == \"金融\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016398429870605469], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.name == \"金融\" AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.001565694808959961]]}, {"query": "有哪些托管给窦谷梁基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '窦谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"窦谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001481771469116211], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"窦谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.00145721435546875]]}, {"query": "珠宝和宝石产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '珠宝和宝石' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0015263557434082031], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.00176239013671875]]}, {"query": "有哪些上游是珠宝和宝石产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '珠宝和宝石' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.001398324966430664], ["MATCH (indus1:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.name == \"宝石\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.006534576416015625]]}, {"query": "有哪些托管给孙谷梁基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '孙谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"孙谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017342567443847656], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"孙谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001531362533569336]]}, {"query": "零售产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '零售' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019199848175048828], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002354145050048828]]}, {"query": "有哪些上游是零售产业的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '零售' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019428730010986328], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"零售\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002207040786743164]]}, {"query": "新安股份股票涉及的新闻", "golden": "MATCH (s1:stock)-[iv:involve]->(i2:information) WHERE s1.stock.name == '新安股份' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"新安股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"新安股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019378662109375], ["MATCH (s:stock)\nWHERE s.stock.name == \"新安股份\" AND ( s.stock.name == \"新安股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018794536590576172]]}, {"query": "有哪些提到新安股份股票的新闻", "golden": "MATCH (s1:stock)-[iv:involve]->(i2:information) WHERE s1.stock.name == '新安股份' RETURN i2.information.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"新安股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"新安股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017859935760498047], ["MATCH (s:stock)\nWHERE s.stock.name == \"新安股份\" AND ( s.stock.name == \"新安股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017986297607421875]]}, {"query": "纺织品和服装行业包括的股票", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '纺织品和服装' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"纺织\" AND s.stock.name == \"服装\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001402139663696289], ["MATCH (s:stock)\nWHERE s.stock.name == \"服装\" AND s.stock.name == \"纺织\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016655921936035156]]}, {"query": "有哪些属于纺织品和服装行业的上市公司", "golden": "MATCH (t1:trade)<-[bt:belong_to]-(s2:stock) WHERE t1.trade.name == '纺织品和服装' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"纺织\" AND s.stock.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017066001892089844], ["MATCH (s:stock)\nWHERE s.stock.name == \"服装\" AND s.stock.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013713836669921875]]}, {"query": "朱赫连基金管理人管理的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '朱赫连' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"朱赫连\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014920234680175781], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"朱赫连\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017819404602050781]]}, {"query": "通股源保股东参股的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '通股源保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"通股源保\" AND ( s.stock.name == \"通股\" OR s.stock.name == \"源保\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.001468658447265625], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"通股\" OR s.stock.name == \"源保\" ) AND s.stock.name == \"通股源保\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013957023620605469]]}, {"query": "有哪些股东是通股源保股东的股票", "golden": "MATCH (sh1:stockholder)-[iso:is_stockholder_of]->(s2:stock) WHERE sh1.stockholder.name == '通股源保' RETURN s2.stock.name\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"通股源保\" AND ( s.stock.name == \"通股\" OR s.stock.name == \"源保\" ) \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0005865097045898438], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"通股\" OR s.stock.name == \"源保\" ) AND s.stock.name == \"通股源保\" \nRETURN s.stock.name,n.name\nLIMIT 50", 0, 0.0003299713134765625]]}, {"query": "华长孙基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '华长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"华长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016109943389892578], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"华长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014963150024414062]]}, {"query": "有哪些托管给华长孙基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '华长孙' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"华长孙\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015215873718261719], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"华长孙\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015888214111328125]]}, {"query": "有哪些托管给喻百里基金管理人的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '喻百里' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"喻百里\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016624927520751953], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"喻百里\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016336441040039062]]}, {"query": "有哪些托管给褚司空基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '褚司空' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"褚司空\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0014719963073730469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"褚司空\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.001508474349975586]]}, {"query": "曹东门基金管理人拥有的公募基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '曹东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"曹东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015482902526855469], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"曹东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015630722045898438]]}, {"query": "有哪些托管给曹东门基金管理人的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '曹东门' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"曹东门\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015721321105957031], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"曹东门\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0017440319061279297]]}, {"query": "窦谷梁基金管理人管理的基金", "golden": "MATCH (fm1:fund_manager)-[m:manage]->(pof2:public_offering_fund) WHERE fm1.fund_manager.name == '窦谷梁' RETURN pof2.public_offering_fund.name\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE pof.public_offering_fund.name == \"金管理\" AND fm.fund_manager.name == \"窦谷梁\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0016396045684814453], ["MATCH (pof:public_offering_fund)<-[m:manage]-(fm:fund_manager)\nWHERE fm.fund_manager.name == \"窦谷梁\" AND pof.public_offering_fund.name == \"金管理\" \nRETURN pof.public_offering_fund.name\nLIMIT 50", 0, 0.0015156269073486328]]}, {"query": "房地产产业下游的产业", "golden": "MATCH (n1:industry)-[af:affect]->(n2:industry) WHERE n1.industry.name == '房地产' RETURN n2.industry.name\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:affect]-(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.0019116401672363281], ["MATCH (indus:industry)-[a:affect]->(indus1:industry)\nWHERE indus.industry.name == \"房地产\" \nRETURN indus1.industry.name\nLIMIT 50", 0, 0.002669095993041992]]}]