[{"query": "2021年9月23日国泰君安的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国泰君安' AND sd.stock_data.`date` == date('2021-9-23') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date( \"2021-9-23\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 1, 0.020642995834350586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-9-23\" ) AND s.stock.name == \"国泰君安\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 1, 0.019220829010009766]]}, {"query": "宝信软件", "golden": "MATCH (s:stock) WHERE s.stock.name == '宝信软件' RETURN s.stock\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"宝信\" OR s.stock.name == \"软件\" ) AND s.stock.name == \"宝信软件\" \nRETURN s.stock,n.name\nLIMIT 50", 0, 0.0003886222839355469], ["MATCH (s:stock)\nWHERE s.stock.name == \"宝信软件\" AND ( s.stock.name == \"宝信\" OR s.stock.name == \"软件\" ) \nRETURN s.stock,n.name\nLIMIT 50", 0, 0.00039005279541015625]]}, {"query": "宝信软件的基本情况", "golden": "MATCH (s:stock) WHERE s.stock.name == '宝信软件' RETURN s.stock\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝信软件\" AND ( s.stock.name == \"宝信\" OR s.stock.name == \"软件\" ) \nRETURN n\nLIMIT 50", 0, 0.00039505958557128906], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"宝信\" OR s.stock.name == \"软件\" ) AND s.stock.name == \"宝信软件\" \nRETURN n\nLIMIT 50", 0, 0.0002868175506591797]]}, {"query": "宝信软件的基本信息", "golden": "MATCH (s:stock) WHERE s.stock.name == '宝信软件' RETURN s.stock\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"宝信\" OR s.stock.name == \"软件\" ) AND s.stock.name == \"宝信软件\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018711090087890625], ["MATCH (s:stock)\nWHERE s.stock.name == \"宝信软件\" AND ( s.stock.name == \"宝信\" OR s.stock.name == \"软件\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.00170135498046875]]}, {"query": "国泰价值先锋股票C", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰价值先锋股票C' RETURN pof.public_offering_fund\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"先锋股\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN n.name\nLIMIT 50", 0, 0.0003132820129394531], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"先锋股\" \nRETURN n.name\nLIMIT 50", 0, 0.0003368854522705078]]}, {"query": "国泰价值先锋股票C的基本情况", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰价值先锋股票C' RETURN pof.public_offering_fund\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"先锋股\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0014064311981201172], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"先锋股\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013039112091064453]]}, {"query": "国泰价值先锋股票C的基本信息", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '国泰价值先锋股票C' RETURN pof.public_offering_fund\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"国泰君安\" AND pof.public_offering_fund.name == \"先锋股\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013370513916015625], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"先锋股\" AND pof.public_offering_fund.name == \"国泰君安\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013358592987060547]]}, {"query": "华泰紫金中证医药50指数发起C", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '华泰紫金中证医药50指数发起C' RETURN pof.public_offering_fund\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"医药\" AND pof.public_offering_fund.name == \"数发\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012524127960205078], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"数发\" AND pof.public_offering_fund.name == \"医药\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0012907981872558594]]}, {"query": "华泰紫金中证医药50指数发起C的基本情况", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '华泰紫金中证医药50指数发起C' RETURN pof.public_offering_fund\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"医药\" AND pof.public_offering_fund.name == \"数发\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.001386880874633789], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"数发\" AND pof.public_offering_fund.name == \"医药\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013957023620605469]]}, {"query": "华泰紫金中证医药50指数发起C的基本信息", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '华泰紫金中证医药50指数发起C' RETURN pof.public_offering_fund\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"医药\" AND pof.public_offering_fund.name == \"数发\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0014262199401855469], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"数发\" AND pof.public_offering_fund.name == \"医药\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0013315677642822266]]}, {"query": "纺织品和服装", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' RETURN n.industry\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN n.name\nLIMIT 50", 0, 0.0003044605255126953], ["MATCH (t:trade)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN n.name\nLIMIT 50", 0, 0.00023436546325683594]]}, {"query": "纺织品和服装的基本情况", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' RETURN n.industry\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN n\nLIMIT 50", 0, 0.0003235340118408203], ["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN n\nLIMIT 50", 0, 0.00032711029052734375]]}, {"query": "纺织品和服装的基本信息", "golden": "MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' RETURN n.industry\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"服装\" AND t.trade.name == \"纺织\" \nRETURN t.trade\nLIMIT 50", 0, 0.0013568401336669922], ["MATCH (t:trade)\nWHERE t.trade.name == \"纺织\" AND t.trade.name == \"服装\" \nRETURN t.trade\nLIMIT 50", 0, 0.0012824535369873047]]}, {"query": "航空航天", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' RETURN n.industry\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade,n.name\nLIMIT 50", 0, 0.0002918243408203125], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade,n.name\nLIMIT 50", 0, 0.00023174285888671875]]}, {"query": "航空航天的基本情况", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' RETURN n.industry\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN n\nLIMIT 50", 0, 0.0003516674041748047], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN n\nLIMIT 50", 0, 0.00024771690368652344]]}, {"query": "航空航天的基本信息", "golden": "MATCH (n:industry) WHERE n.industry.name == '航空航天' RETURN n.industry\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN t.trade\nLIMIT 50", 0, 0.0016391277313232422], ["MATCH (t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( t.trade.name == \"航空\" OR t.trade.name == \"航天\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0017704963684082031]]}, {"query": "2020年3月4日哪些行业的涨跌幅是前50的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-3-4') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 50", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004956722259521484], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.014002561569213867], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004355907440185547], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.014575719833374023]]}, {"query": "2020年3月4日涨跌幅前50的行业是哪些", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-3-4') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 50", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.012539148330688477], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.011697769165039062], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.000469207763671875], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.0003714561462402344]]}, {"query": "2020年3月4日涨跌幅前50的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-3-4') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 50", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.0004315376281738281], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.011704206466674805], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.00040841102600097656], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-3-4\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 50", 0, 0.015308141708374023]]}, {"query": "2020年1月12日涨跌幅后18的行业是哪些", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-1-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 18", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013268709182739258], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005099773406982422], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013070344924926758], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00046944618225097656]]}, {"query": "2020年1月12日哪些行业的涨跌幅是后18的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-1-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 18", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.01465153694152832], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0003635883331298828], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.00041103363037109375], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.015877246856689453]]}, {"query": "2020年1月12日涨跌幅后18的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2020-1-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 18", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.012301445007324219], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0003883838653564453], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name\nLIMIT 50", 0, 0.0004088878631591797], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2003-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-1-12\" ) \nRETURN t.trade.name\nLIMIT 50", 0, 0.011192798614501953]]}, {"query": "2020年3月4日哪个上市公司的涨跌幅最高", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2020-3-4') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0005638599395751953], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.05040860176086426], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.04729509353637695], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-4\" ) AND sd.stock_data.`date` == date( \"2003-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 0, 0.0006811618804931641]]}, {"query": "2021年6月11日涨跌幅最高的行业是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.`date` == date('2021-6-11') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.0004246234893798828], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.01158285140991211], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.00046062469482421875], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2002-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-6-11\" ) \nRETURN t.trade.name, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.011377334594726562]]}, {"query": "2021年6月11日哪些上市公司的涨跌幅是前28的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2021-6-11') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 28", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04534339904785156], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006356239318847656], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.04352307319641113], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006630420684814453]]}, {"query": "2021年6月11日涨跌幅前28的上市公司是哪些", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.`date` == date('2021-6-11') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 28", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.04176950454711914], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.0006270408630371094], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.0004742145538330078], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2002-11-12\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-11\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 28", 0, 0.04254937171936035]]}]