[{"query": "哪个是在皖通高速和西部黄金和国芳集团中成交量最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['皖通高速', '西部黄金', '国芳集团'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.volume AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"皖通高速\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.01720118522644043], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"皖通高速\" \nRETURN s.stock, sd.stock_data.volume AS SSDV\nORDER BY SSDV DESC LIMIT 1", 0, 0.016600847244262695]]}, {"query": "在杭萧钢构和哈空调和哈药股份中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['杭萧钢构', '哈空调', '哈药股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"哈空调\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001901865005493164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"哈空调\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.017359495162963867], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"哈空调\" \nRETURN s.stock\nLIMIT 50", 0, 0.001794576644897461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"哈空调\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016634702682495117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"哈空调\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016260147094726562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"哈空调\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.015786409378051758]]}, {"query": "在杭萧钢构和哈空调和哈药股份中涨跌幅最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['杭萧钢构', '哈空调', '哈药股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"哈空调\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018706321716308594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"哈空调\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.016205549240112305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"哈空调\" \nRETURN s.stock\nLIMIT 50", 0, 0.001653432846069336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"哈空调\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015772104263305664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"哈空调\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016908645629882812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"哈空调\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.016352415084838867]]}, {"query": "在信息技术和电信服务提供商和医疗设备行业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['信息技术', '电信服务提供商', '医疗设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"电信\" ) AND t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0016694068908691406], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"技术\" OR t.trade.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0015821456909179688], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"电信\" ) AND t.trade.name == \"医疗\" \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0015463829040527344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0014979839324951172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"技术\" OR t.trade.name == \"电信\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0014929771423339844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"医疗\" AND ( t.trade.name == \"技术\" OR t.trade.name == \"电信\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0014426708221435547]]}, {"query": "在信达证券和节能风电和宝光股份股票中最高价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['信达证券', '节能风电', '宝光股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝光股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01633167266845703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝光股份\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0161740779876709], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝光股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.015565156936645508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝光股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.01654648780822754], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝光股份\" AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019074678421020508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝光股份\" AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019075393676757812]]}, {"query": "在信达证券和节能风电和宝光股份股票中最高价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['信达证券', '节能风电', '宝光股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝光股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01684713363647461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝光股份\" AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.016756057739257812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND s.stock.name == \"宝光股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.01590418815612793], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝光股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.015213489532470703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"宝光股份\" AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015258073806762695], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"宝光股份\" AND ( s.stock.name == \"宝光股\" OR s.stock.name == \"份股\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018726110458374023]]}, {"query": "哪个是在汽车和家居用品行业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['汽车', '家居用品'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"家居\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.17481017112731934], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"汽车\" OR indus.industry.name == \"家居\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.17640304565429688]]}, {"query": "哪个是在申能股份和柏诚股份中最低价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['申能股份', '柏诚股份'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"申能股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01833057403564453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"申能股份\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.002166748046875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"申能股份\" AND s.stock.name == \"股份\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.01638650894165039], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"申能股份\" AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.016755104064941406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"申能股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0018703937530517578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" AND s.stock.name == \"申能股份\" \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.001756906509399414]]}, {"query": "在航空航天和物流服务行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航空航天', '物流服务'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空航天\" OR t.trade.name == \"物流\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.008317232131958008], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空航天\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.005842447280883789]]}, {"query": "哪个是在航空航天和物流服务行业中涨跌幅最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['航空航天', '物流服务'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"航空航天\" OR t.trade.name == \"物流\" ) \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.006661176681518555], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"航空航天\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.range AS TTDR\nORDER BY TTDR DESC LIMIT 1", 0, 0.006094455718994141]]}, {"query": "哪个是在同方股份和华电国际中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['同方股份', '华电国际'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016582012176513672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001722097396850586]]}, {"query": "在同方股份和华电国际中涨跌幅最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['同方股份', '华电国际'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018379688262939453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016467571258544922]]}, {"query": "在同方股份和华电国际中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['同方股份', '华电国际'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.001796722412109375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016112327575683594]]}, {"query": "在食品和饮料和农业行业中涨跌幅最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['食品和饮料', '农业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.18400073051452637], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.17908406257629395]]}, {"query": "在宁波富达和东方创业上市公司中涨跌幅最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['宁波富达', '东方创业'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"宁波富达\" OR s.stock.name == \"东方创业\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.02163386344909668], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"宁波富达\" OR s.stock.name == \"东方创业\" ) \nRETURN s.stock, sd.stock_data.range AS SSDR\nORDER BY SSDR DESC LIMIT 1", 1, 0.019533872604370117]]}, {"query": "在华鑫股份和曲江文旅股票中涨跌幅最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['华鑫股份', '曲江文旅'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018987655639648438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016782283782958984]]}, {"query": "在华鑫股份和曲江文旅股票中涨跌幅最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['华鑫股份', '曲江文旅'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.00229644775390625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0018684864044189453]]}, {"query": "哪个是在信雅达和中国国贸和郴电国际中最低价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['信雅达', '中国国贸', '郴电国际'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.minimum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"信雅达\" OR s.stock.name == \"中国国贸\" ) \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.019431114196777344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"信雅达\" OR s.stock.name == \"中国国贸\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.minimum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.018702983856201172]]}, {"query": "在化妆品和消费品和公用事业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['化妆品', '消费品', '公用事业'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"化妆品\" \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.021547317504882812], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化妆品\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.01884150505065918]]}, {"query": "在万东医疗和中航产融中开盘价最低的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['万东医疗', '中航产融'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"万东医疗\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"产融\" \nRETURN s.stock\nLIMIT 50", 0, 0.019095420837402344], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"万东医疗\" AND s.stock.name == \"产融\" \nRETURN s.stock\nLIMIT 50", 0, 0.020138263702392578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"产融\" AND s.stock.name == \"万东医疗\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0021266937255859375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"产融\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"万东医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017237663269042969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"万东医疗\" AND s.stock.name == \"产融\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01676177978515625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"产融\" AND s.stock.name == \"万东医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.001970052719116211]]}, {"query": "哪个是在万东医疗和中航产融中开盘价最低的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['万东医疗', '中航产融'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"万东医疗\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"产融\" \nRETURN s.stock\nLIMIT 50", 0, 0.01676797866821289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"万东医疗\" AND s.stock.name == \"产融\" \nRETURN s.stock\nLIMIT 50", 0, 0.019249916076660156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"产融\" AND s.stock.name == \"万东医疗\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020203590393066406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"产融\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"万东医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.001739501953125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"万东医疗\" AND s.stock.name == \"产融\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018117189407348633], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"产融\" AND s.stock.name == \"万东医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.001874685287475586]]}, {"query": "在媒体和娱乐和医疗设备行业中涨跌幅最低的是哪个", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['媒体和娱乐', '医疗设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005517721176147461], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005934953689575195]]}, {"query": "在媒体和娱乐和医疗设备行业中涨跌幅最低的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['媒体和娱乐', '医疗设备'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.range AS SSDR ORDER BY SSDR ASC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.005839347839355469], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.005661487579345703]]}, {"query": "在三一重工和宁波远洋股票中开盘价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['三一重工', '宁波远洋'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三一重工\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.017363548278808594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三一重工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.015792131423950195]]}, {"query": "哪个是在三一重工和宁波远洋股票中开盘价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['三一重工', '宁波远洋'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"三一重工\" \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.01709127426147461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"三一重工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.opening_price AS SSDOP\nORDER BY SSDOP DESC LIMIT 1", 0, 0.016609668731689453]]}, {"query": "在太平洋和兴业银行上市公司中最高价最高的是哪个", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['太平洋', '兴业银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.002353191375732422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0018918514251708984]]}, {"query": "哪个是在太平洋和兴业银行上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['太平洋', '兴业银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0019047260284423828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017671585083007812]]}, {"query": "在太平洋和兴业银行上市公司中最高价最高的", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name IN ['太平洋', '兴业银行'] AND sd.stock_data.`date` == date('2023-11-11') RETURN s.stock, sd.stock_data.maximum_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0017659664154052734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock, sd.stock_data.maximum_price AS SSDMP\nORDER BY SSDMP DESC LIMIT 1", 0, 0.0016791820526123047]]}, {"query": "在钢铁和电信服务提供商和汽车制造行业中开盘价最高的", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name IN ['钢铁', '电信服务提供商', '汽车制造'] AND td.trade_data.`date` == date('2023-11-11') RETURN t.trade, td.trade_data.opening_price AS SSDR ORDER BY SSDR DESC LIMIT 1", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.006246805191040039], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.00729060173034668], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.008266210556030273], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.008335113525390625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.008040904998779297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade, td.trade_data.opening_price AS TTDOP\nORDER BY TTDOP DESC LIMIT 1", 0, 0.0069484710693359375]]}]