[{"query": "电信服务提供商和食品和饮料的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002897500991821289], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"电信\" OR t.trade.name == \"服务\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.002835988998413086]]}, {"query": "医疗设备和电力工具和设备产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.002348661422729492], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015468597412109375]]}, {"query": "医疗设备和电力工具和设备产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022614002227783203], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.001428365707397461]]}, {"query": "医疗设备和电力工具和设备产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力工具和设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.00031828880310058594], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.00026917457580566406]]}, {"query": "杨费莫和沈皇甫的任职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '杨费莫' WITH c.chairman.appointment_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '沈皇甫' WITH ABS(c.chairman.appointment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"杨费莫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"杨费莫\" OR fm.fund_manager.name == \"沈皇甫\" ) \nRETURN temp\nLIMIT 50", 0, 0.00026226043701171875], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"杨费莫\" OR fm.fund_manager.name == \"沈皇甫\" ) AND fm.fund_manager.name == \"杨费莫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"杨费莫\" OR fm.fund_manager.name == \"沈皇甫\" ) AND fm.fund_manager.name == \"沈皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"杨费莫\" OR fm.fund_manager.name == \"沈皇甫\" ) \nRETURN temp\nLIMIT 50", 0, 0.00030612945556640625], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"杨费莫\" OR fm.fund_manager.name == \"沈皇甫\" ) AND fm.fund_manager.name == \"杨费莫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE fm.fund_manager.name == \"沈皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0002396106719970703], ["MATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"杨费莫\" OR fm.fund_manager.name == \"沈皇甫\" ) AND fm.fund_manager.name == \"杨费莫\" WITH as temp1\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"杨费莫\" OR fm.fund_manager.name == \"沈皇甫\" ) AND fm.fund_manager.name == \"沈皇甫\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00024890899658203125]]}, {"query": "湘财股份和通策医疗的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '湘财股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '通策医疗' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013222694396972656], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014302730560302734]]}, {"query": "湘财股份和通策医疗的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '湘财股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '通策医疗' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012862682342529297], ["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012574195861816406]]}, {"query": "湘财股份和通策医疗的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '湘财股份' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '通策医疗' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"股份\" AND s.stock.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.0003001689910888672], ["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.name == \"股份\" \nRETURN temp\nLIMIT 50", 0, 0.00022482872009277344]]}, {"query": "喻万俟和孙夏侯的离职日期差多少", "golden": "MATCH (c:chairman) WHERE c.chairman.name == '喻万俟' WITH c.chairman.departure_date AS temp1 MATCH (c:chairman) WHERE c.chairman.name == '孙夏侯' WITH ABS(c.chairman.departure_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"喻万俟\" OR fm.fund_manager.name == \"孙夏侯\" ) AND fm.fund_manager.name == \"喻万俟\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"喻万俟\" OR fm.fund_manager.name == \"孙夏侯\" ) AND fm.fund_manager.name == \"孙夏侯\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"喻万俟\" OR fm.fund_manager.name == \"孙夏侯\" ) \nRETURN temp\nLIMIT 50", 0, 0.0042171478271484375], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"喻万俟\" OR fm.fund_manager.name == \"孙夏侯\" ) AND fm.fund_manager.name == \"喻万俟\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"喻万俟\" OR fm.fund_manager.name == \"孙夏侯\" ) AND fm.fund_manager.name == \"孙夏侯\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.003540515899658203], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"喻万俟\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"孙夏侯\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp\nMATCH (fm:fund_manager)\nWHERE ( fm.fund_manager.name == \"喻万俟\" OR fm.fund_manager.name == \"孙夏侯\" ) \nRETURN temp\nLIMIT 50", 0, 0.0038254261016845703], ["MATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE ( fm.fund_manager.name == \"喻万俟\" OR fm.fund_manager.name == \"孙夏侯\" ) AND fm.fund_manager.name == \"喻万俟\" WITH cm.chairman.departure_date as temp1\nMATCH (fm:fund_manager)-[m:manage]->(pof:public_offering_fund)-[h:hold]->(s:stock)<-[ico:is_chairman_of]-(cm:chairman)\nWHERE fm.fund_manager.name == \"孙夏侯\" WITH cm.chairman.departure_date as temp2 , temp1 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0038552284240722656]]}, {"query": "娱乐设备和电信服务提供商产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017352104187011719], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016362667083740234]]}, {"query": "娱乐设备和电信服务提供商产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"娱乐\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003082752227783203], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"娱乐\" \nRETURN temp\nLIMIT 50", 0, 0.00031757354736328125]]}, {"query": "娱乐设备和电信服务提供商产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '娱乐设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电信服务提供商' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"娱乐\" AND ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015153884887695312], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"电信\" OR indus.industry.name == \"服务\" ) AND indus.industry.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016074180603027344]]}, {"query": "房地产和酒精饮料的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '房地产' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"房地产\" AND t.trade.name == \"饮料\" \nRETURN temp\nLIMIT 50", 0, 0.0002865791320800781], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND indus.industry.name == \"房地产\" \nRETURN temp\nLIMIT 50", 0, 0.0002617835998535156]]}, {"query": "房地产和酒精饮料的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '房地产' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '酒精饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND indus.industry.name == \"房地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.002933502197265625], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)\nWHERE indus.industry.name == \"房地产\" AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.002723217010498047]]}, {"query": "融通超短债债券C和财通资管鑫达混合C的认购开始时间差多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通超短债债券C' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '财通资管鑫达混合C' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"通资\" \nRETURN temp\nLIMIT 50", 0, 0.00034332275390625], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"通资\" AND pof.public_offering_fund.name == \"融通\" \nRETURN temp\nLIMIT 50", 0, 0.00031065940856933594]]}, {"query": "融通超短债债券C和财通资管鑫达混合C的认购开始时间差额是多少", "golden": "MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '融通超短债债券C' WITH pof.public_offering_fund.subscription_start_time AS temp1 MATCH (pof:public_offering_fund) WHERE pof.public_offering_fund.name == '财通资管鑫达混合C' WITH ABS(pof.public_offering_fund.subscription_start_time - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"融通\" AND pof.public_offering_fund.name == \"通资\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0014605522155761719], ["MATCH (pof:public_offering_fund)\nWHERE pof.public_offering_fund.name == \"通资\" AND pof.public_offering_fund.name == \"融通\" \nRETURN pof.public_offering_fund\nLIMIT 50", 0, 0.0015413761138916016]]}, {"query": "汽车零部件和电力的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.002312898635864258], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.002415180206298828]]}, {"query": "汽车零部件和电力的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '汽车零部件' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电力' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.00032138824462890625], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"汽车\" AND indus.industry.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.00026035308837890625]]}, {"query": "浙大网新和工商银行的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '浙大网新' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '工商银行' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"浙大网新\" AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017724037170410156], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"浙大网新\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014243125915527344]]}, {"query": "浙大网新和工商银行的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '浙大网新' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '工商银行' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"浙大网新\" AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016815662384033203], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"浙大网新\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014271736145019531]]}, {"query": "医疗设备和食品和饮料产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014374256134033203], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015552043914794922]]}, {"query": "医疗设备和食品和饮料产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018284320831298828], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016884803771972656]]}, {"query": "医疗设备和食品和饮料产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗设备' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '食品和饮料' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) \nRETURN temp\nLIMIT 50", 0, 0.00035262107849121094], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"食品\" OR indus.industry.name == \"饮料\" ) AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.00028395652770996094]]}, {"query": "农产品和珠宝和宝石产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '农产品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '珠宝和宝石' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝石\" AND s.stock.name == \"农产品\" \nRETURN temp\nLIMIT 50", 0, 0.00030803680419921875], ["MATCH (s:stock)\nWHERE s.stock.name == \"农产品\" AND s.stock.name == \"宝石\" \nRETURN temp\nLIMIT 50", 0, 0.0002484321594238281]]}, {"query": "农产品和珠宝和宝石产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '农产品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '珠宝和宝石' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝石\" AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 0.00147247314453125], ["MATCH (s:stock)\nWHERE s.stock.name == \"农产品\" AND s.stock.name == \"宝石\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014491081237792969]]}, {"query": "农产品和珠宝和宝石产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '农产品' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '珠宝和宝石' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝石\" AND s.stock.name == \"农产品\" \nRETURN s.stock\nLIMIT 50", 0, 0.001451730728149414], ["MATCH (s:stock)\nWHERE s.stock.name == \"农产品\" AND s.stock.name == \"宝石\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013246536254882812]]}, {"query": "电科数字和上海九百上市公司的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '电科数字' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '上海九百' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"上海九百\" AND s.stock.name == \"电科\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016818046569824219], ["MATCH (s:stock)\nWHERE s.stock.name == \"电科\" AND s.stock.name == \"上海九百\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013623237609863281]]}, {"query": "电科数字和上海九百上市公司的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '电科数字' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '上海九百' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电科\" AND s.stock.name == \"上海九百\" \nRETURN temp\nLIMIT 50", 0, 0.0003085136413574219], ["MATCH (s:stock)\nWHERE s.stock.name == \"上海九百\" AND s.stock.name == \"电科\" \nRETURN temp\nLIMIT 50", 0, 0.00031280517578125]]}, {"query": "电科数字和上海九百上市公司的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '电科数字' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '上海九百' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"上海九百\" AND s.stock.name == \"电科\" \nRETURN s.stock\nLIMIT 50", 0, 0.001796722412109375], ["MATCH (s:stock)\nWHERE s.stock.name == \"电科\" AND s.stock.name == \"上海九百\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013616085052490234]]}, {"query": "医疗保健和农业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"农业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015347003936767578], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"农业\" AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0025882720947265625]]}, {"query": "医疗保健和农业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"农业\" AND indus.industry.name == \"医疗\" \nRETURN temp\nLIMIT 50", 0, 0.00029206275939941406], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"农业\" \nRETURN temp\nLIMIT 50", 0, 0.00024628639221191406]]}, {"query": "医疗保健和农业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '医疗保健' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '农业' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"医疗\" AND indus.industry.name == \"农业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014584064483642578], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"农业\" AND indus.industry.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0024213790893554688]]}, {"query": "长沙银行和淮北矿业的成立日期差多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '长沙银行' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '淮北矿业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"矿业\" AND s.stock.name == \"银行\" \nRETURN temp\nLIMIT 50", 0, 0.0003120899200439453], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"矿业\" \nRETURN temp\nLIMIT 50", 0, 0.00024628639221191406]]}, {"query": "长沙银行和淮北矿业的成立日期差距", "golden": "MATCH (s:stock) WHERE s.stock.name == '长沙银行' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '淮北矿业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"矿业\" AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012753009796142578], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"矿业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012824535369873047]]}, {"query": "长沙银行和淮北矿业的成立日期差额是多少", "golden": "MATCH (s:stock) WHERE s.stock.name == '长沙银行' WITH s.stock.establishment_date AS temp1 MATCH (s:stock) WHERE s.stock.name == '淮北矿业' WITH ABS(s.stock.establishment_date - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"矿业\" AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0012133121490478516], ["MATCH (s:stock)\nWHERE s.stock.name == \"银行\" AND s.stock.name == \"矿业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013260841369628906]]}, {"query": "航天和国防和纺织品和服装产业的规模差额是多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.001575469970703125], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015215873718261719], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"航天\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.001615285873413086], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015044212341308594], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"航天\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016322135925292969], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016312599182128906]]}, {"query": "航天和国防和纺织品和服装产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015666484832763672], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014777183532714844], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"航天\" AND indus.industry.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.001383066177368164], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015037059783935547], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"航天\" AND indus.industry.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014646053314208984], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" AND indus.industry.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.001506805419921875]]}, {"query": "航天和国防和纺织品和服装产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '航天和国防' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '纺织品和服装' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" AND indus.industry.name == \"航天\" \nRETURN temp\nLIMIT 50", 0, 0.00031566619873046875], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"服装\" AND indus.industry.name == \"纺织\" \nRETURN temp\nLIMIT 50", 0, 0.0003001689910888672], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"航天\" AND indus.industry.name == \"服装\" \nRETURN temp\nLIMIT 50", 0, 0.0002682209014892578], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"服装\" AND indus.industry.name == \"航天\" AND indus.industry.name == \"纺织\" \nRETURN temp\nLIMIT 50", 0, 0.00023698806762695312], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"航天\" AND indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" \nRETURN temp\nLIMIT 50", 0, 0.0003402233123779297], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"纺织\" AND indus.industry.name == \"服装\" AND indus.industry.name == \"航天\" \nRETURN temp\nLIMIT 50", 0, 0.0003108978271484375]]}, {"query": "酒店和度假村和电子设备产业的规模差距", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电子设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电子\" AND indus.industry.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015790462493896484], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017580986022949219]]}, {"query": "酒店和度假村和电子设备产业的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '酒店和度假村' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '电子设备' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE indus.industry.name == \"电子\" AND indus.industry.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0003116130828857422], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.00031495094299316406]]}, {"query": "珠宝和宝石和物流服务的规模差多少", "golden": "MATCH (n:industry) WHERE n.industry.name == '珠宝和宝石' WITH n.industry.scale AS temp1 MATCH (n:industry) WHERE n.industry.name == '物流服务' WITH ABS(n.industry.scale - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.00029277801513671875], ["MATCH (t:trade)\nWHERE t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"物流\" ) \nRETURN temp\nLIMIT 50", 0, 0.0002410411834716797], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00020194053649902344], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"物流\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"宝石\" OR t.trade.name == \"物流\" ) AND t.trade.name == \"服务\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00018644332885742188]]}]