[{"query": "股票宝丰能源2013年第四季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '宝丰能源' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"能源\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.00157928466796875], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0015311241149902344], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"能源\" AND sfi.stock_financial_information.quarter == 4 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014691352844238281], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"能源\" AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014333724975585938], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 4 AND s.stock.name == \"能源\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014383792877197266], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"能源\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 4 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0013957023620605469]]}, {"query": "2013年10到12月股票宝丰能源的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '宝丰能源' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"能源\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0014100074768066406], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.001367330551147461]]}, {"query": "2013年1到3月股票豫光金铅的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '豫光金铅' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"豫光金铅\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0024437904357910156], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"豫光金铅\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0023343563079833984]]}, {"query": "2017年10到12月股票中视传媒的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 4 AND s.stock.name == '中视传媒' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"中视传媒\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024504661560058594], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"中视传媒\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002820730209350586]]}, {"query": "2017年7到9月股票金自天正的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '金自天正' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"金自天正\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002732515335083008], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"金自天正\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0027151107788085938]]}, {"query": "2013年1到3月股票中孚实业的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 1 AND s.stock.name == '中孚实业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"中孚实业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023889541625976562], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"中孚实业\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023467540740966797]]}, {"query": "股票上海医药2013年第三季度的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '上海医药' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"上海医药\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025107860565185547], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"上海医药\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002493143081665039], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"上海医药\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025064945220947266], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"上海医药\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.0025336742401123047], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"上海医药\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002497434616088867], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"上海医药\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002432107925415039]]}, {"query": "2013年7到9月股票上海医药的净利润", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '上海医药' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.net_profit\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"上海医药\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002396821975708008], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"上海医药\" \nRETURN sfi.stock_financial_information.net_profit\nLIMIT 50", 0, 0.002505064010620117]]}, {"query": "股票亚盛集团2017年第二季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '亚盛集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"亚盛集团\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025246143341064453], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"亚盛集团\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023403167724609375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"亚盛集团\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0026149749755859375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"亚盛集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025436878204345703], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"亚盛集团\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002615213394165039], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"亚盛集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024564266204833984]]}, {"query": "2017年4到6月股票亚盛集团的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '亚盛集团' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"亚盛集团\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023698806762695312], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"亚盛集团\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002516031265258789]]}, {"query": "股票紫江企业2013年第二季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '紫江企业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"紫江企业\" AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025904178619384766], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"紫江企业\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024569034576416016], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"紫江企业\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002377748489379883], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"紫江企业\" AND sfi.stock_financial_information.quarter == 2 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002402782440185547], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"紫江企业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 2 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002679586410522461], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 2 AND s.stock.name == \"紫江企业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025529861450195312]]}, {"query": "2013年4到6月股票紫江企业的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2013 AND sfi.stock_financial_information.quarter == 2 AND s.stock.name == '紫江企业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"紫江企业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002552032470703125], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"紫江企业\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024480819702148438]]}, {"query": "股票中孚实业2017年第三季度的存货周转率", "golden": "MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information) WHERE sfi.stock_financial_information.year == 2017 AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == '中孚实业' RETURN s.stock.name, sfi.stock_financial_information.`date`, sfi.stock_financial_information.inventory_turnover\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"中孚实业\" AND sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002519369125366211], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"中孚实业\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.002494335174560547], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"中孚实业\" \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0025005340576171875], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE s.stock.name == \"中孚实业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024261474609375], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.quarter == 3 AND s.stock.name == \"中孚实业\" AND sfi.stock_financial_information.`date` == date('2023-11-11') \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0024743080139160156], ["MATCH (s:stock)-[hsfi:has_stock_financial_information]->(sfi:stock_financial_information)\nWHERE sfi.stock_financial_information.`date` == date('2023-11-11') AND s.stock.name == \"中孚实业\" AND sfi.stock_financial_information.quarter == 3 \nRETURN sfi.stock_financial_information.inventory_turnover\nLIMIT 50", 0, 0.0023496150970458984]]}]