[{"query": "注册资本不小于49的污水处理行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '污水处理' AND s.stock.registered_capital >= 49 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"水处理\" AND s.stock.registered_capital >= 49 \nRETURN s.stock\nLIMIT 50", 0, 0.015194892883300781], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 49 AND t.trade.name == \"水处理\" \nRETURN s.stock\nLIMIT 50", 0, 0.014854669570922852]]}, {"query": "注册资本大于38的汽车行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '汽车' AND s.stock.registered_capital > 38 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.registered_capital > 38 \nRETURN s.stock\nLIMIT 50", 0, 0.0014362335205078125], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 38 AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013840198516845703]]}, {"query": "注册资本大于18的物流服务行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '物流服务' AND s.stock.registered_capital > 18 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND s.stock.registered_capital > 18 \nRETURN s.stock.name\nLIMIT 50", 0, 0.008337020874023438], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 18 AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.006207704544067383]]}, {"query": "注册资本大于16的金属和矿业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '金属和矿业' AND s.stock.registered_capital > 16 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND s.stock.registered_capital > 16 \nRETURN s.stock.name\nLIMIT 50", 0, 0.015413522720336914], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 16 AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.01602625846862793]]}, {"query": "注册资本不小于7的汽车零部件行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '汽车零部件' AND s.stock.registered_capital >= 7 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 7 AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014941692352294922], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.registered_capital >= 7 \nRETURN s.stock\nLIMIT 50", 0, 0.0014770030975341797]]}, {"query": "注册资本不小于45的航空公司行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '航空公司' AND s.stock.registered_capital >= 45 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"航空\" AND s.stock.registered_capital >= 45 \nRETURN s.stock.name\nLIMIT 50", 0, 0.001294851303100586], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 45 AND s.stock.name == \"航空\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001272439956665039]]}, {"query": "注册资本不小于1的电力工具和设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '电力工具和设备' AND s.stock.registered_capital >= 1 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电力\" AND s.stock.registered_capital >= 1 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014934539794921875], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 1 AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013942718505859375]]}, {"query": "注册资本不小于49的航空公司行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '航空公司' AND s.stock.registered_capital >= 49 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"航空\" AND s.stock.registered_capital >= 49 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014243125915527344], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 49 AND s.stock.name == \"航空\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.001697540283203125]]}, {"query": "注册资本大于9的酒店和度假村行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '酒店和度假村' AND s.stock.registered_capital > 9 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"酒店\" AND s.stock.registered_capital > 9 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013382434844970703], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 9 AND s.stock.name == \"酒店\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0012865066528320312]]}, {"query": "注册资本不小于8的医疗保健设施行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗保健设施' AND s.stock.registered_capital >= 8 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 8 AND s.stock.name == \"医疗\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015032291412353516], ["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital >= 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014417171478271484]]}, {"query": "注册资本不小于25的酒精饮料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '酒精饮料' AND s.stock.registered_capital >= 25 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 25 AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.016912460327148438], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND s.stock.registered_capital >= 25 \nRETURN s.stock\nLIMIT 50", 0, 0.014737367630004883]]}, {"query": "注册资本不小于17的能源行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '能源' AND s.stock.registered_capital >= 17 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 17 AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015697479248046875], ["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.registered_capital >= 17 \nRETURN s.stock\nLIMIT 50", 0, 0.0014619827270507812]]}, {"query": "注册资本不小于48的航空公司行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '航空公司' AND s.stock.registered_capital >= 48 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"航空\" AND s.stock.registered_capital >= 48 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015110969543457031], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 48 AND s.stock.name == \"航空\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015532970428466797]]}, {"query": "注册资本大于46的娱乐设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '娱乐设备' AND s.stock.registered_capital > 46 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"娱乐\" AND s.stock.registered_capital > 46 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014541149139404297], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 46 AND s.stock.name == \"娱乐\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014891624450683594]]}, {"query": "注册资本大于31的旅游和酒店行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '旅游和酒店' AND s.stock.registered_capital > 31 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) AND s.stock.registered_capital > 31 \nRETURN s.stock.name\nLIMIT 50", 0, 0.009334802627563477], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 31 AND ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.0074062347412109375]]}, {"query": "注册资本大于8的物流服务行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '物流服务' AND s.stock.registered_capital > 8 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 8 AND ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.005986928939819336], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"物流\" OR s.stock.name == \"服务\" ) AND s.stock.registered_capital > 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.006344795227050781]]}, {"query": "注册资本不小于24的媒体和娱乐行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '媒体和娱乐' AND s.stock.registered_capital >= 24 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 24 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.006927967071533203], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND s.stock.registered_capital >= 24 \nRETURN s.stock.name\nLIMIT 50", 0, 0.006459951400756836]]}, {"query": "注册资本不小于38的医疗保健设施行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗保健设施' AND s.stock.registered_capital >= 38 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital >= 38 \nRETURN s.stock\nLIMIT 50", 0, 0.0012607574462890625], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 38 AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014085769653320312]]}, {"query": "注册资本大于13的娱乐设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '娱乐设备' AND s.stock.registered_capital > 13 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 13 AND s.stock.name == \"娱乐\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013682842254638672], ["MATCH (s:stock)\nWHERE s.stock.name == \"娱乐\" AND s.stock.registered_capital > 13 \nRETURN s.stock\nLIMIT 50", 0, 0.0013892650604248047]]}, {"query": "注册资本大于30的医疗保健设施行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗保健设施' AND s.stock.registered_capital > 30 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 30 AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014519691467285156], ["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital > 30 \nRETURN s.stock\nLIMIT 50", 0, 0.0012688636779785156]]}, {"query": "注册资本大于18的农业行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '农业' AND s.stock.registered_capital > 18 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"农业\" AND s.stock.registered_capital > 18 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0022368431091308594], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital > 18 AND indus.industry.name == \"农业\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023686885833740234]]}, {"query": "注册资本大于3的化妆品行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '化妆品' AND s.stock.registered_capital > 3 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital > 3 AND indus.industry.name == \"化妆品\" \nRETURN s.stock\nLIMIT 50", 0, 0.002473592758178711], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"化妆品\" AND s.stock.registered_capital > 3 \nRETURN s.stock\nLIMIT 50", 0, 0.0023505687713623047]]}, {"query": "注册资本大于29的电信行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '电信' AND s.stock.registered_capital > 29 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"电信\" AND s.stock.registered_capital > 29 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002118349075317383], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital > 29 AND indus.industry.name == \"电信\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.00206756591796875]]}, {"query": "注册资本不小于23的农业行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '农业' AND s.stock.registered_capital >= 23 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital >= 23 AND indus.industry.name == \"农业\" \nRETURN s.stock\nLIMIT 50", 0, 0.0022683143615722656], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"农业\" AND s.stock.registered_capital >= 23 \nRETURN s.stock\nLIMIT 50", 0, 0.0023348331451416016]]}, {"query": "注册资本大于47的污水处理行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '污水处理' AND s.stock.registered_capital > 47 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 47 AND t.trade.name == \"水处理\" \nRETURN s.stock\nLIMIT 50", 0, 0.018761873245239258], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"水处理\" AND s.stock.registered_capital > 47 \nRETURN s.stock\nLIMIT 50", 0, 0.01954960823059082]]}, {"query": "注册资本不小于2的金融技术行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '金融技术' AND s.stock.registered_capital >= 2 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) AND s.stock.registered_capital >= 2 \nRETURN s.stock.name\nLIMIT 50", 0, 0.012799263000488281], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 2 AND ( t.trade.name == \"金融\" OR t.trade.name == \"技术\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.012814760208129883]]}, {"query": "注册资本不小于26的航空航天行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '航空航天' AND s.stock.registered_capital >= 26 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 26 AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.014631986618041992], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND s.stock.registered_capital >= 26 AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.014879226684570312], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 26 AND t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015566349029541016], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND s.stock.registered_capital >= 26 AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015450716018676758], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND s.stock.registered_capital >= 26 \nRETURN s.stock\nLIMIT 50", 0, 0.014961719512939453], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND s.stock.registered_capital >= 26 \nRETURN s.stock\nLIMIT 50", 0, 0.01625347137451172]]}, {"query": "注册资本不小于43的医疗保健设施行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗保健设施' AND s.stock.registered_capital >= 43 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 43 AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.001428365707397461], ["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital >= 43 \nRETURN s.stock\nLIMIT 50", 0, 0.0014603137969970703]]}, {"query": "注册资本大于37的家居用品行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '家居用品' AND s.stock.registered_capital > 37 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 37 AND s.stock.name == \"家居\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014042854309082031], ["MATCH (s:stock)\nWHERE s.stock.name == \"家居\" AND s.stock.registered_capital > 37 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0014095306396484375]]}, {"query": "注册资本大于39的纺织品和服装行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '纺织品和服装' AND s.stock.registered_capital > 39 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 39 AND s.stock.name == \"纺织\" AND s.stock.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.001478433609008789], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 39 AND s.stock.name == \"服装\" AND s.stock.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.001828908920288086], ["MATCH (s:stock)\nWHERE s.stock.name == \"服装\" AND s.stock.name == \"纺织\" AND s.stock.registered_capital > 39 \nRETURN s.stock\nLIMIT 50", 0, 0.0016100406646728516], ["MATCH (s:stock)\nWHERE s.stock.name == \"服装\" AND s.stock.registered_capital > 39 AND s.stock.name == \"纺织\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016472339630126953], ["MATCH (s:stock)\nWHERE s.stock.name == \"纺织\" AND s.stock.name == \"服装\" AND s.stock.registered_capital > 39 \nRETURN s.stock\nLIMIT 50", 0, 0.0018837451934814453], ["MATCH (s:stock)\nWHERE s.stock.name == \"纺织\" AND s.stock.registered_capital > 39 AND s.stock.name == \"服装\" \nRETURN s.stock\nLIMIT 50", 0, 0.0015990734100341797]]}, {"query": "注册资本大于21的零售行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '零售' AND s.stock.registered_capital > 21 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"零售\" AND s.stock.registered_capital > 21 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002654552459716797], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital > 21 AND indus.industry.name == \"零售\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0023937225341796875]]}, {"query": "注册资本大于20的珠宝和宝石行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '珠宝和宝石' AND s.stock.registered_capital > 20 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝石\" AND s.stock.registered_capital > 20 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016336441040039062], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 20 AND s.stock.name == \"宝石\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013577938079833984]]}, {"query": "注册资本大于37的旅游和酒店行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '旅游和酒店' AND s.stock.registered_capital > 37 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 37 AND ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.009309530258178711], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"旅游\" OR s.stock.name == \"酒店\" ) AND s.stock.registered_capital > 37 \nRETURN s.stock.name\nLIMIT 50", 0, 0.008766412734985352]]}, {"query": "注册资本不小于19的汽车零部件行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '汽车零部件' AND s.stock.registered_capital >= 19 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.registered_capital >= 19 \nRETURN s.stock\nLIMIT 50", 0, 0.0014429092407226562], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 19 AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.001371622085571289]]}, {"query": "注册资本不小于40的化学行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '化学' AND s.stock.registered_capital >= 40 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital >= 40 AND indus.industry.name == \"化学\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.002325296401977539], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"化学\" AND s.stock.registered_capital >= 40 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002480030059814453]]}, {"query": "注册资本不小于37的珠宝和宝石行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '珠宝和宝石' AND s.stock.registered_capital >= 37 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"宝石\" AND s.stock.registered_capital >= 37 \nRETURN s.stock\nLIMIT 50", 0, 0.0014045238494873047], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 37 AND s.stock.name == \"宝石\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014007091522216797]]}, {"query": "注册资本不小于36的医疗保健设施行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '医疗保健设施' AND s.stock.registered_capital >= 36 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"医疗\" AND s.stock.registered_capital >= 36 \nRETURN s.stock\nLIMIT 50", 0, 0.001691579818725586], ["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 36 AND s.stock.name == \"医疗\" \nRETURN s.stock\nLIMIT 50", 0, 0.0013566017150878906]]}, {"query": "注册资本不小于8的珠宝和宝石行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '珠宝和宝石' AND s.stock.registered_capital >= 8 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital >= 8 AND s.stock.name == \"宝石\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015578269958496094], ["MATCH (s:stock)\nWHERE s.stock.name == \"宝石\" AND s.stock.registered_capital >= 8 \nRETURN s.stock.name\nLIMIT 50", 0, 0.001470804214477539]]}, {"query": "注册资本不小于40的酒精饮料行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '酒精饮料' AND s.stock.registered_capital >= 40 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"饮料\" AND s.stock.registered_capital >= 40 \nRETURN s.stock\nLIMIT 50", 0, 0.020676136016845703], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 40 AND t.trade.name == \"饮料\" \nRETURN s.stock\nLIMIT 50", 0, 0.01474142074584961]]}, {"query": "注册资本大于15的航空航天行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '航空航天' AND s.stock.registered_capital > 15 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND s.stock.registered_capital > 15 AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.01798105239868164], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND s.stock.registered_capital > 15 \nRETURN s.stock\nLIMIT 50", 0, 0.01799631118774414], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 15 AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.015433311462402344], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"航空航天\" AND s.stock.registered_capital > 15 AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.015886783599853516], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) AND t.trade.name == \"航空航天\" AND s.stock.registered_capital > 15 \nRETURN s.stock\nLIMIT 50", 0, 0.017104148864746094], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 15 AND t.trade.name == \"航空航天\" AND ( s.stock.name == \"航空\" OR s.stock.name == \"航天\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01798558235168457]]}, {"query": "注册资本大于34的汽车制造行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '汽车制造' AND s.stock.registered_capital > 34 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 34 AND ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.011537551879882812], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"汽车\" OR s.stock.name == \"制造\" ) AND s.stock.registered_capital > 34 \nRETURN s.stock\nLIMIT 50", 0, 0.011018037796020508]]}, {"query": "注册资本不小于11的船舶和海运行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '船舶和海运' AND s.stock.registered_capital >= 11 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital >= 11 AND t.trade.name == \"船舶\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.01688075065612793], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE t.trade.name == \"船舶\" AND s.stock.registered_capital >= 11 \nRETURN s.stock.name\nLIMIT 50", 0, 0.014913797378540039]]}, {"query": "注册资本大于17的化学行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '化学' AND s.stock.registered_capital > 17 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE indus.industry.name == \"化学\" AND s.stock.registered_capital > 17 \nRETURN s.stock\nLIMIT 50", 0, 0.002539396286010742], ["MATCH (indus:industry)<-[a:associate]-(s:stock)\nWHERE s.stock.registered_capital > 17 AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.002432107925415039]]}, {"query": "注册资本大于3的媒体和娱乐行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '媒体和娱乐' AND s.stock.registered_capital > 3 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 3 AND ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.010647058486938477], ["MATCH (s:stock)\nWHERE ( s.stock.name == \"媒体\" OR s.stock.name == \"娱乐\" ) AND s.stock.registered_capital > 3 \nRETURN s.stock.name\nLIMIT 50", 0, 0.007819652557373047]]}, {"query": "注册资本大于48的电力工具和设备行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '电力工具和设备' AND s.stock.registered_capital > 48 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电力\" AND s.stock.registered_capital > 48 \nRETURN s.stock\nLIMIT 50", 0, 0.0015485286712646484], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 48 AND s.stock.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014119148254394531]]}, {"query": "注册资本大于45的航天和国防行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '航天和国防' AND s.stock.registered_capital > 45 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"航天\" AND s.stock.registered_capital > 45 \nRETURN s.stock\nLIMIT 50", 0, 0.0014536380767822266], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 45 AND s.stock.name == \"航天\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014812946319580078]]}, {"query": "注册资本大于22的汽车零部件行业上市公司", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '汽车零部件' AND s.stock.registered_capital > 22 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.registered_capital > 22 AND s.stock.name == \"汽车\" \nRETURN s.stock\nLIMIT 50", 0, 0.001434326171875], ["MATCH (s:stock)\nWHERE s.stock.name == \"汽车\" AND s.stock.registered_capital > 22 \nRETURN s.stock\nLIMIT 50", 0, 0.0013048648834228516]]}, {"query": "注册资本大于16的食品和饮料行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '食品和饮料' AND s.stock.registered_capital > 16 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE s.stock.registered_capital > 16 AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN s.stock.name\nLIMIT 50", 0, 0.01690530776977539], ["MATCH (s:stock)-[bt:belong_to]->(t:trade)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND s.stock.registered_capital > 16 \nRETURN s.stock.name\nLIMIT 50", 0, 0.012937784194946289]]}, {"query": "注册资本大于32的电力工具和设备行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock) WHERE t.trade.name == '电力工具和设备' AND s.stock.registered_capital > 32 RETURN s.stock.name, s.stock.registered_capital\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"电力\" AND s.stock.registered_capital > 32 \nRETURN s.stock.name\nLIMIT 50", 0, 0.0015325546264648438], ["MATCH (s:stock)\nWHERE s.stock.registered_capital > 32 AND s.stock.name == \"电力\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0013453960418701172]]}, {"query": "收盘价不大于44的能源行业股票", "golden": "MATCH (t:trade)<-[bt:belong_to]-(s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE t.trade.name == '能源' AND sd.stock_data.closing_price <= 44 RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 44 \nRETURN s.stock.name\nLIMIT 50", 0, 0.002511739730834961], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 44 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0021331310272216797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.closing_price <= 44 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018579959869384766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 44 AND sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0018177032470703125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND s.stock.name == \"能源\" AND sd.stock_data.closing_price <= 44 \nRETURN s.stock.name\nLIMIT 50", 0, 0.005151987075805664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 44 AND s.stock.name == \"能源\" \nRETURN s.stock.name\nLIMIT 50", 0, 0.0016887187957763672]]}]