[{"query": "近十天国泰君安的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国泰君安' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-10 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"国泰君安\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017455101013183594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01741766929626465]]}, {"query": "天富能源股票近89日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-89 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.002059459686279297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0017621517181396484]]}, {"query": "天富能源股票近89日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-89 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017976760864257812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016465187072753906]]}, {"query": "近89日天富能源股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-89 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0019698143005371094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0018732547760009766]]}, {"query": "长城电工近7日的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长城电工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-7 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.3476128578186035], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0006935596466064453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.002845287322998047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0004870891571044922]]}, {"query": "长城电工近7日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长城电工' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-7 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"长城电\" \nRETURN s.stock\nLIMIT 50", 0, 0.0026717185974121094], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"长城电\" \nRETURN s.stock\nLIMIT 50", 0, 0.3388392925262451], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0007696151733398438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-10-31\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"长城电\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0005731582641601562]]}, {"query": "林洋能源近98日的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '林洋能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0028228759765625], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.340914249420166], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.000980377197265625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0005004405975341797]]}, {"query": "林洋能源近98日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '林洋能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.002656698226928711], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.34207963943481445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006937980651855469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0007262229919433594]]}, {"query": "近98日林洋能源的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '林洋能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-98 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0030891895294189453], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.37145137786865234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0014693737030029297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2023-8-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0005242824554443359]]}, {"query": "安琪酵母股票近68日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '安琪酵母' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-68 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"安琪酵母\" \nRETURN s.stock\nLIMIT 50", 0, 0.016918182373046875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安琪酵母\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016988754272460938]]}, {"query": "安琪酵母股票近68日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '安琪酵母' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-68 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"安琪酵母\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01752161979675293], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"安琪酵母\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.018288373947143555]]}, {"query": "神奇制药股票近60日的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '神奇制药' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-60 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0019195079803466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"制药\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0017135143280029297]]}, {"query": "神奇制药股票近60日的成交量是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '神奇制药' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-60 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"制药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017592906951904297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"制药\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017576217651367188]]}, {"query": "鑫科材料近50日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鑫科材料' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-50 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鑫科材料\" \nRETURN s.stock\nLIMIT 50", 0, 0.016599416732788086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鑫科材料\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015117883682250977]]}, {"query": "近50日鑫科材料的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鑫科材料' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-50 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鑫科材料\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017103910446166992], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鑫科材料\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.01709771156311035]]}, {"query": "祁连山上市公司近79日的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '祁连山' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-79 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 5.838616609573364], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.05400490760803223], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0007240772247314453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0006024837493896484]]}, {"query": "近79日祁连山上市公司的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '祁连山' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-79 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 5.766039848327637], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.12903904914855957], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.000762939453125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0004966259002685547]]}, {"query": "祁连山上市公司近79日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '祁连山' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-79 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006594657897949219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"祁连山\" \nRETURN s.stock\nLIMIT 50", 0, 0.0389256477355957], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"祁连山\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0010843276977539062], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-8-20\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"祁连山\" \nRETURN s.stock\nLIMIT 50", 0, 0.44292736053466797]]}, {"query": "近21日浙江龙盛股票的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙江龙盛' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-21 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浙江龙盛\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.017168760299682617], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浙江龙盛\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016147613525390625]]}, {"query": "浙江龙盛股票近21日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '浙江龙盛' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-21 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"浙江龙盛\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.015789508819580078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"浙江龙盛\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.016523122787475586]]}, {"query": "中葡股份2019年8月1日到2022年10月23日的成交量是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中葡股份' AND sd.stock_data.`date` >= date('2019-08-01') AND sd.stock_data.`date` <= date('2022-10-23') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-8-1\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-10-23\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001814126968383789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-10-23\" ) AND sd.stock_data.`date` == date( \"2019-8-1\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0016326904296875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-8-1\" ) AND sd.stock_data.`date` == date( \"2022-10-23\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016295909881591797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-8-1\" ) AND sd.stock_data.`date` == date( \"2022-10-23\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014965534210205078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-23\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-8-1\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0014126300811767578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-23\" ) AND sd.stock_data.`date` == date( \"2019-8-1\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014510154724121094]]}, {"query": "2019年8月1日到2022年10月23日的中葡股份的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中葡股份' AND sd.stock_data.`date` >= date('2019-08-01') AND sd.stock_data.`date` <= date('2022-10-23') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-8-1\" ) AND sd.stock_data.`date` == date( \"2022-10-23\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.001775979995727539], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-8-1\" ) AND sd.stock_data.`date` == date( \"2022-10-23\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0015230178833007812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-8-1\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-10-23\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.001542806625366211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-23\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-8-1\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0016036033630371094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-10-23\" ) AND sd.stock_data.`date` == date( \"2019-8-1\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0014972686767578125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2022-10-23\" ) AND sd.stock_data.`date` == date( \"2019-8-1\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0014910697937011719]]}, {"query": "北矿科技上市公司2021年12月11日前2天的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '北矿科技' AND sd.stock_data.`date` <= date('2021-12-11') AND sd.stock_data.`date` > date('2021-12-11')-2 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND date('2023-11-11') - sd.stock_data.`date` <= 2 AND sd.stock_data.`date` == date( \"2021-12-11\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017819404602050781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-11\" ) AND s.stock.name == \"科技\" AND date('2023-11-11') - sd.stock_data.`date` <= 2 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0024480819702148438], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 2 AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date( \"2021-12-11\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016970634460449219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date( \"2021-12-11\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 2 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0025413036346435547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 2 AND sd.stock_data.`date` == date( \"2021-12-11\" ) AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001692056655883789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-11\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 2 AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017132759094238281]]}]