[{"query": "涨跌幅不大于23的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 23 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 23 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017270565032958984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 23 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017416715621948242]]}, {"query": "哪些股票的涨跌幅不大于23", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 23 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 23 \nRETURN s.stock.name\nLIMIT 50", 1, 0.020310401916503906], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 23 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.018381834030151367]]}, {"query": "开盘价不大于32的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 32 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 32 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0065534114837646484], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 32 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006356954574584961]]}, {"query": "哪些行业的开盘价不大于32", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 32 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 32 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0065097808837890625], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 32 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007037162780761719]]}, {"query": "涨跌幅不大于15的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 15 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 15 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0059320926666259766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 15 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006618022918701172]]}, {"query": "哪些行业的涨跌幅不大于15", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 15 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 15 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0063207149505615234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 15 \nRETURN t.trade.name\nLIMIT 50", 1, 0.00923299789428711]]}, {"query": "开盘价小于17的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 17 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 17 \nRETURN s.stock\nLIMIT 50", 0, 0.025243043899536133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02515101432800293]]}, {"query": "哪些上市公司的开盘价小于17", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price < 17 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price < 17 \nRETURN s.stock\nLIMIT 50", 0, 0.02192068099975586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price < 17 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022841691970825195]]}, {"query": "最低价不小于11的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= 11 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price >= 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.003868579864501953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price >= 11 \nRETURN s.stock.name\nLIMIT 50", 1, 0.003896951675415039]]}, {"query": "哪些股票的最低价不小于11", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price >= 11 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price >= 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.005547761917114258], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price >= 11 \nRETURN s.stock.name\nLIMIT 50", 1, 0.0047838687896728516]]}, {"query": "开盘价不大于11的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 11 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 11 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00687718391418457], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 11 \nRETURN t.trade.name\nLIMIT 50", 1, 0.009367704391479492]]}, {"query": "哪些行业的开盘价不大于11", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price <= 11 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price <= 11 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005808591842651367], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price <= 11 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0060465335845947266]]}, {"query": "最低价小于9的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 9 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 9 \nRETURN t.trade.name\nLIMIT 50", 1, 0.00795888900756836], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 9 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0059435367584228516]]}, {"query": "哪些行业的最低价小于9", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price < 9 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price < 9 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006155729293823242], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price < 9 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0059130191802978516]]}, {"query": "收盘价不大于12的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price <= 12 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 12 \nRETURN s.stock\nLIMIT 50", 0, 0.021625041961669922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02274298667907715]]}, {"query": "哪些上市公司的收盘价不大于12", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price <= 12 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price <= 12 \nRETURN s.stock\nLIMIT 50", 0, 0.02253270149230957], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price <= 12 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023314952850341797]]}, {"query": "最高价不大于49的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 49 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 49 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02525472640991211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 49 \nRETURN s.stock\nLIMIT 50", 0, 0.023830890655517578]]}, {"query": "哪些股票的最高价不大于49", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 49 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 49 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01751542091369629], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 49 \nRETURN s.stock.name\nLIMIT 50", 1, 0.017634868621826172]]}, {"query": "最低价不大于47的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 47 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 47 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.007116556167602539], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 47 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006573677062988281]]}, {"query": "哪些行业的最低价不大于47", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.minimum_price <= 47 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.minimum_price <= 47 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006630420684814453], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.minimum_price <= 47 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006392955780029297]]}, {"query": "最高价小于38的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 38 \nRETURN s.stock\nLIMIT 50", 0, 0.022924184799194336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022481203079223633]]}, {"query": "哪些上市公司的最高价小于38", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price < 38 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price < 38 \nRETURN s.stock\nLIMIT 50", 0, 0.02226114273071289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price < 38 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.021715641021728516]]}, {"query": "涨跌幅小于29的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 29 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 29 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02418351173400879], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 29 \nRETURN s.stock\nLIMIT 50", 0, 0.02298259735107422]]}, {"query": "哪些股票的涨跌幅小于29", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range < 29 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range < 29 \nRETURN s.stock.name\nLIMIT 50", 1, 0.020772457122802734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range < 29 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01763749122619629]]}, {"query": "开盘价不大于35的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 35 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 35 \nRETURN s.stock.name\nLIMIT 50", 1, 0.018101930618286133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 35 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.016759634017944336]]}, {"query": "哪些上市公司的开盘价不大于35", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 35 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 35 \nRETURN s.stock\nLIMIT 50", 0, 0.022884368896484375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 35 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02614283561706543]]}, {"query": "收盘价小于24的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 24 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 24 \nRETURN s.stock\nLIMIT 50", 0, 0.028339624404907227], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 24 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02584052085876465]]}, {"query": "哪些股票的收盘价小于24", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.closing_price < 24 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.closing_price < 24 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01965618133544922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.closing_price < 24 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01759195327758789]]}, {"query": "最低价大于20的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > 20 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > 20 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.0041387081146240234], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 20 \nRETURN s.stock\nLIMIT 50", 0, 0.003446817398071289]]}, {"query": "哪些股票的最低价大于20", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.minimum_price > 20 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.minimum_price > 20 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.003072023391723633], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.minimum_price > 20 \nRETURN s.stock.name\nLIMIT 50", 1, 0.002938508987426758]]}, {"query": "最高价不大于9的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 9 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 9 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.005996227264404297], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 9 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0057525634765625]]}, {"query": "哪些行业的最高价不大于9", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.maximum_price <= 9 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.maximum_price <= 9 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0066680908203125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.maximum_price <= 9 \nRETURN t.trade.name\nLIMIT 50", 1, 0.007937192916870117]]}, {"query": "涨跌幅不大于31的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 31 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 31 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006136894226074219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.00595855712890625]]}, {"query": "哪些行业的涨跌幅不大于31", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.range <= 31 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.range <= 31 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006961345672607422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.range <= 31 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.006783246994018555]]}, {"query": "开盘价不大于19的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 19 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 19 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.017304182052612305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 19 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01719045639038086]]}, {"query": "哪些上市公司的开盘价不大于19", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.opening_price <= 19 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.opening_price <= 19 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.02282118797302246], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.opening_price <= 19 \nRETURN s.stock\nLIMIT 50", 0, 0.023519515991210938]]}, {"query": "最高价不小于8的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price >= 8 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price >= 8 \nRETURN s.stock.name\nLIMIT 50", 1, 0.007839679718017578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price >= 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.008523702621459961]]}, {"query": "哪些股票的最高价不小于8", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price >= 8 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price >= 8 \nRETURN s.stock.name\nLIMIT 50", 1, 0.007638454437255859], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price >= 8 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.007465362548828125]]}, {"query": "涨跌幅不大于33的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 33 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 33 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01792430877685547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 33 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.01778721809387207]]}, {"query": "哪些上市公司的涨跌幅不大于33", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.range <= 33 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.range <= 33 \nRETURN s.stock\nLIMIT 50", 0, 0.022370100021362305], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.range <= 33 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.022739648818969727]]}, {"query": "哪些上市公司的成交量等于3", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume == 3 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume == 3 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.010459423065185547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume == 3 \nRETURN s.stock\nLIMIT 50", 0, 0.010967016220092773]]}, {"query": "开盘价大于7的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price > 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.0051724910736083984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0049440860748291016]]}, {"query": "哪些行业的开盘价大于7", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.opening_price > 7 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.opening_price > 7 \nRETURN t.trade.name\nLIMIT 50", 1, 0.005617380142211914], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.opening_price > 7 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.004269123077392578]]}, {"query": "收盘价不大于10的行业", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= 10 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price <= 10 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006891727447509766], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price <= 10 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.009743928909301758]]}, {"query": "哪些行业的收盘价不大于10", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE td.trade_data.closing_price <= 10 AND td.trade_data.`date` == date('2023-11-10') RETURN t.trade.name, td.trade_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-10') AND td.trade_data.closing_price <= 10 \nRETURN t.trade.name\nLIMIT 50", 1, 0.006051301956176758], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.closing_price <= 10 AND td.trade_data.`date` == date('2023-11-10') \nRETURN t.trade.name\nLIMIT 50", 1, 0.0064656734466552734]]}, {"query": "最高价不大于11的上市公司", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 11 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.024901628494262695], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 11 \nRETURN s.stock\nLIMIT 50", 0, 0.0237276554107666]]}, {"query": "哪些上市公司的最高价不大于11", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.maximum_price <= 11 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.maximum_price <= 11 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock\nLIMIT 50", 0, 0.023954153060913086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.maximum_price <= 11 \nRETURN s.stock\nLIMIT 50", 0, 0.027252912521362305]]}, {"query": "成交量小于27的股票", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 27 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 27 \nRETURN s.stock.name\nLIMIT 50", 1, 0.02152419090270996], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 27 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.0198211669921875]]}, {"query": "哪些股票的成交量小于27", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE sd.stock_data.volume < 27 AND sd.stock_data.`date` == date('2023-11-10') RETURN s.stock.name, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-10') AND sd.stock_data.volume < 27 \nRETURN s.stock.name\nLIMIT 50", 1, 0.01738572120666504], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.volume < 27 AND sd.stock_data.`date` == date('2023-11-10') \nRETURN s.stock.name\nLIMIT 50", 1, 0.016844749450683594]]}]