[{"query": "2022年5月15日的公用事业行业的涨跌幅和最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2022-05-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013443708419799805], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01262044906616211], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005545616149902344], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00046563148498535156]]}, {"query": "2022年5月15日公用事业行业的涨跌幅和最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2022-05-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01288914680480957], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.013050079345703125], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005764961242675781], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-5-15\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.00037384033203125]]}, {"query": "汉商集团股票的涨跌幅和开盘价和最低价在2022年9月18日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '汉商集团' AND sd.stock_data.`date` == date('2022-09-18') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range, sd.stock_data.opening_price, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-9-18\" ) AND s.stock.name == \"汉商集团\" \nRETURN s.stock\nLIMIT 50", 0, 0.0165560245513916], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"汉商集团\" AND sd.stock_data.`date` == date( \"2022-9-18\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01734328269958496]]}, {"query": "博瑞传播上市公司的涨跌幅在2023年2月14日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博瑞传播' AND sd.stock_data.`date` == date('2023-02-14') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"博瑞传播\" AND sd.stock_data.`date` == date( \"2023-2-14\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017754316329956055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-2-14\" ) AND s.stock.name == \"博瑞传播\" \nRETURN s.stock\nLIMIT 50", 0, 0.016932010650634766]]}, {"query": "2023年12月10日医疗保健的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-12-10') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-12-10\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0020706653594970703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2023-12-10\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0017952919006347656]]}, {"query": "2023年12月10日的医疗保健的最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '医疗保健' AND td.trade_data.`date` == date('2023-12-10') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-12-10\" ) AND t.trade.name == \"医疗\" \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0021636486053466797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"医疗\" AND td.trade_data.`date` == date( \"2023-12-10\" ) \nRETURN td.trade_data.minimum_price\nLIMIT 50", 0, 0.0018944740295410156]]}, {"query": "电力工具和设备的涨跌幅和收盘价和开盘价在2021年12月12日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力工具和设备' AND td.trade_data.`date` == date('2021-12-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range, td.trade_data.closing_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电力\" AND td.trade_data.`date` == date( \"2021-12-12\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.018400907516479492], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-12-12\" ) AND t.trade.name == \"电力\" \nRETURN t.trade\nLIMIT 50", 0, 0.016208171844482422]]}, {"query": "一拖股份的更新时间和收盘价和涨跌幅在2020年7月26日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '一拖股份' AND sd.stock_data.`date` == date('2020-07-26') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.`date`, sd.stock_data.closing_price, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-7-26\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0023665428161621094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2020-7-26\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002076387405395508]]}, {"query": "2021年10月14日的食品和饮料的收盘价和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2021-10-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-10-14\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.009038209915161133], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2021-10-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0065915584564208984]]}, {"query": "2021年10月14日食品和饮料的收盘价和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2021-10-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2021-10-14\" ) \nRETURN td.trade_data.closing_price,td.trade_data.minimum_price,m.name\nLIMIT 50", 0, 0.0006225109100341797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-10-14\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN td.trade_data.closing_price,td.trade_data.minimum_price,m.name\nLIMIT 50", 0, 0.000385284423828125]]}, {"query": "食品和饮料的收盘价和最低价在2021年10月14日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '食品和饮料' AND td.trade_data.`date` == date('2021-10-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.closing_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-10-14\" ) AND ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00793313980102539], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"食品\" OR t.trade.name == \"饮料\" ) AND td.trade_data.`date` == date( \"2021-10-14\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.007392406463623047]]}, {"query": "2021年8月15日的运输和物流行业的更新时间和开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2021-08-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-15\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.008269786834716797], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2021-8-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.009017229080200195]]}, {"query": "2021年8月15日运输和物流行业的更新时间和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2021-08-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-15\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN td.trade_data.`date`,td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0005137920379638672], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2021-8-15\" ) \nRETURN td.trade_data.`date`,td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.00039505958557128906]]}, {"query": "运输和物流行业的更新时间和开盘价在2021年8月15日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2021-08-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-15\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.009428977966308594], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2021-8-15\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006299495697021484]]}, {"query": "2021年8月15日的运输和物流行业的更新时间和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '运输和物流' AND td.trade_data.`date` == date('2021-08-15') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-8-15\" ) AND ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) \nRETURN td.trade_data.`date`,td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.0005316734313964844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"运输\" OR t.trade.name == \"物流\" ) AND td.trade_data.`date` == date( \"2021-8-15\" ) \nRETURN td.trade_data.`date`,td.trade_data.opening_price,m.name\nLIMIT 50", 0, 0.00043201446533203125]]}, {"query": "2020年12月16日的汽车零部件的更新时间和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2020-12-16') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-12-16\" ) AND t.trade.name == \"汽车\" \nRETURN td.trade_data.`date`,td.trade_data.minimum_price\nLIMIT 50", 0, 0.016545772552490234], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date( \"2020-12-16\" ) \nRETURN td.trade_data.`date`,td.trade_data.minimum_price\nLIMIT 50", 0, 0.017305850982666016]]}, {"query": "2020年12月16日的汽车零部件的更新时间和最低价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2020-12-16') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date( \"2020-12-16\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01785421371459961], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-12-16\" ) AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.017475366592407227]]}, {"query": "汽车零部件的更新时间和最低价在2020年12月16日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2020-12-16') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date( \"2020-12-16\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.016564130783081055], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-12-16\" ) AND t.trade.name == \"汽车\" \nRETURN t.trade\nLIMIT 50", 0, 0.015363454818725586]]}, {"query": "2020年12月16日汽车零部件的更新时间和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2020-12-16') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2020-12-16\" ) AND t.trade.name == \"汽车\" \nRETURN td.trade_data.`date`,td.trade_data.minimum_price\nLIMIT 50", 0, 0.016018152236938477], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date( \"2020-12-16\" ) \nRETURN td.trade_data.`date`,td.trade_data.minimum_price\nLIMIT 50", 0, 0.0167694091796875]]}, {"query": "汽车制造行业的涨跌幅在2021年4月12日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车制造' AND td.trade_data.`date` == date('2021-04-12') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-4-12\" ) AND ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.00739288330078125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"汽车\" OR t.trade.name == \"制造\" ) AND td.trade_data.`date` == date( \"2021-4-12\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006013154983520508]]}, {"query": "2021年4月14日电信行业的开盘价和收盘价和最低价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信' AND td.trade_data.`date` == date('2021-04-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2021-4-14\" ) \nRETURN td.trade_data.closing_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.021088123321533203], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-4-14\" ) AND indus.industry.name == \"电信\" \nRETURN td.trade_data.closing_price,td.trade_data.minimum_price\nLIMIT 50", 0, 0.019992589950561523]]}, {"query": "电信行业的开盘价和收盘价和最低价在2021年4月14日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信' AND td.trade_data.`date` == date('2021-04-14') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.closing_price, td.trade_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2021-4-14\" ) AND indus.industry.name == \"电信\" \nRETURN s.stock\nLIMIT 50", 0, 0.022639751434326172], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电信\" AND td.trade_data.`date` == date( \"2021-4-14\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.018914222717285156]]}, {"query": "国泰君安股票的成交量和最低价和更新时间在2023年4月30日怎么样", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国泰君安' AND sd.stock_data.`date` == date('2023-04-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.minimum_price, sd.stock_data.`date`\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date( \"2023-4-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.017091035842895508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-4-30\" ) AND s.stock.name == \"国泰君安\" \nRETURN s.stock\nLIMIT 50", 0, 0.01607036590576172]]}, {"query": "2023年4月30日国泰君安股票的成交量和最低价和更新时间", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国泰君安' AND sd.stock_data.`date` == date('2023-04-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.minimum_price, sd.stock_data.`date`\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date( \"2023-4-30\" ) \nRETURN sd.stock_data.minimum_price,sd.stock_data.`date`\nLIMIT 50", 1, 0.01741337776184082], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-4-30\" ) AND s.stock.name == \"国泰君安\" \nRETURN sd.stock_data.minimum_price,sd.stock_data.`date`\nLIMIT 50", 1, 0.017171621322631836]]}, {"query": "2023年4月30日的国泰君安股票的成交量和最低价和更新时间的情况", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '国泰君安' AND sd.stock_data.`date` == date('2023-04-30') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume, sd.stock_data.minimum_price, sd.stock_data.`date`\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"国泰君安\" AND sd.stock_data.`date` == date( \"2023-4-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01742267608642578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-4-30\" ) AND s.stock.name == \"国泰君安\" \nRETURN s.stock\nLIMIT 50", 0, 0.017088651657104492]]}, {"query": "2022年10月29日的零售行业的更新时间和开盘价和最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2022-10-29') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-29\" ) AND indus.industry.name == \"零售\" \nRETURN s.stock\nLIMIT 50", 0, 0.01885819435119629], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2022-10-29\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019850730895996094]]}, {"query": "零售行业的更新时间和开盘价和最高价在2022年10月29日怎么样", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2022-10-29') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-29\" ) AND indus.industry.name == \"零售\" \nRETURN s.stock\nLIMIT 50", 0, 0.019263744354248047], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2022-10-29\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02242588996887207]]}, {"query": "2022年10月29日零售行业的更新时间和开盘价和最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2022-10-29') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"零售\" AND td.trade_data.`date` == date( \"2022-10-29\" ) \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.019045114517211914], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-10-29\" ) AND indus.industry.name == \"零售\" \nRETURN td.trade_data.opening_price,td.trade_data.maximum_price\nLIMIT 50", 0, 0.02000284194946289]]}, {"query": "2023年3月5日化学行业的最高价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2023-03-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-5\" ) AND indus.industry.name == \"化学\" \nRETURN td.trade_data.maximum_price\nLIMIT 50", 1, 0.021110057830810547], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2023-3-5\" ) \nRETURN td.trade_data.maximum_price\nLIMIT 50", 1, 0.020369291305541992]]}, {"query": "2023年3月5日的化学行业的最高价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '化学' AND td.trade_data.`date` == date('2023-03-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"化学\" AND td.trade_data.`date` == date( \"2023-3-5\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01956462860107422], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-3-5\" ) AND indus.industry.name == \"化学\" \nRETURN s.stock\nLIMIT 50", 0, 0.019971370697021484]]}, {"query": "2023年12月5日的建筑材料行业的最高价和开盘价", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2023-12-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-12-5\" ) AND t.trade.name == \"建筑\" \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.002072572708129883], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND td.trade_data.`date` == date( \"2023-12-5\" ) \nRETURN td.trade_data.maximum_price,td.trade_data.opening_price\nLIMIT 50", 0, 0.001965761184692383]]}, {"query": "2023年12月5日的建筑材料行业的最高价和开盘价的情况", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '建筑材料' AND td.trade_data.`date` == date('2023-12-05') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.maximum_price, td.trade_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"建筑\" AND td.trade_data.`date` == date( \"2023-12-5\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0019855499267578125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-12-5\" ) AND t.trade.name == \"建筑\" \nRETURN t.trade\nLIMIT 50", 0, 0.001802206039428711]]}, {"query": "2022年2月20日的钢铁的开盘价和最高价和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '钢铁' AND td.trade_data.`date` == date('2022-02-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.maximum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.015919923782348633], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.01567983627319336], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004949569702148438], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0004563331604003906]]}, {"query": "2022年2月20日钢铁的开盘价和最高价和涨跌幅", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '钢铁' AND td.trade_data.`date` == date('2022-02-20') RETURN t.trade.name, td.trade_data.`date`, td.trade_data.opening_price, td.trade_data.maximum_price, td.trade_data.range\nLIMIT 50;", "candidates": [["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.014651775360107422], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.012973546981811523], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.000640869140625], ["MATCH (td:trade_data)\nWHERE td.trade_data.`date` == date( \"2022-2-20\" ) AND td.trade_data.`date` == date( \"2001-11-12\" ) WITH td.trade_data.closing_price AS p1\nMATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date( \"2023-11-7\" ) WITH ( td.trade_data.closing_price - p1 ) / td.trade_data.closing_price AS temp \nRETURN t.trade\nLIMIT 50", 0, 0.0005116462707519531]]}]