[{"query": "恒瑞医药2021年6月23日前1日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '恒瑞医药' AND sd.stock_data.`date` <= date('2021-06-23') AND sd.stock_data.`date` > date('2021-06-23')-1 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.01880502700805664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.019315481185913086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND s.stock.name == \"恒瑞医药\" AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN s.stock\nLIMIT 50", 0, 0.01922154426574707], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02219843864440918], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"恒瑞医药\" AND sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 \nRETURN s.stock\nLIMIT 50", 0, 0.02143239974975586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-23\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 1 AND s.stock.name == \"恒瑞医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.01939105987548828]]}, {"query": "金证股份上市公司2006年10月23日到2019年11月24日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金证股份' AND sd.stock_data.`date` >= date('2006-10-23') AND sd.stock_data.`date` <= date('2019-11-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-24\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2006-10-23\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019447803497314453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2006-10-23\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-11-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001890420913696289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2006-10-23\" ) AND sd.stock_data.`date` == date( \"2019-11-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001733541488647461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-24\" ) AND sd.stock_data.`date` == date( \"2006-10-23\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017066001892089844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-11-24\" ) AND sd.stock_data.`date` == date( \"2006-10-23\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015959739685058594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2006-10-23\" ) AND sd.stock_data.`date` == date( \"2019-11-24\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016677379608154297]]}, {"query": "金证股份上市公司2006年10月23日到2019年11月24日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金证股份' AND sd.stock_data.`date` >= date('2006-10-23') AND sd.stock_data.`date` <= date('2019-11-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-11-24\" ) AND sd.stock_data.`date` == date( \"2006-10-23\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.004611968994140625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2006-10-23\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-11-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002246379852294922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2006-10-23\" ) AND sd.stock_data.`date` == date( \"2019-11-24\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0021140575408935547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-24\" ) AND sd.stock_data.`date` == date( \"2006-10-23\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018024444580078125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-24\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2006-10-23\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0018107891082763672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2006-10-23\" ) AND sd.stock_data.`date` == date( \"2019-11-24\" ) AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021839141845703125]]}, {"query": "2006年10月23日到2019年11月24日的金证股份上市公司的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '金证股份' AND sd.stock_data.`date` >= date('2006-10-23') AND sd.stock_data.`date` <= date('2019-11-24') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-24\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2006-10-23\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019102096557617188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2006-10-23\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-11-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0019192695617675781], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2006-10-23\" ) AND sd.stock_data.`date` == date( \"2019-11-24\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0018432140350341797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-24\" ) AND sd.stock_data.`date` == date( \"2006-10-23\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0015888214111328125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2019-11-24\" ) AND sd.stock_data.`date` == date( \"2006-10-23\" ) \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0018184185028076172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2006-10-23\" ) AND sd.stock_data.`date` == date( \"2019-11-24\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0016851425170898438]]}, {"query": "长江电力上市公司1996年2月27日到2021年3月3日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长江电力' AND sd.stock_data.`date` >= date('1996-02-27') AND sd.stock_data.`date` <= date('2021-03-03') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2021-3-3\" ) AND sd.stock_data.`date` == date( \"1996-2-27\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001991748809814453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-3\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"1996-2-27\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002138853073120117], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"1996-2-27\" ) AND sd.stock_data.`date` == date( \"2021-3-3\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017151832580566406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-2-27\" ) AND sd.stock_data.`date` == date( \"2021-3-3\" ) AND s.stock.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.001810312271118164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-3\" ) AND sd.stock_data.`date` == date( \"1996-2-27\" ) AND s.stock.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019538402557373047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-2-27\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2021-3-3\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001967191696166992]]}, {"query": "长江电力上市公司1996年2月27日到2021年3月3日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长江电力' AND sd.stock_data.`date` >= date('1996-02-27') AND sd.stock_data.`date` <= date('2021-03-03') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-2-27\" ) AND sd.stock_data.`date` == date( \"2021-3-3\" ) AND s.stock.name == \"电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.002043485641479492], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-2-27\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2021-3-3\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017688274383544922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-3\" ) AND sd.stock_data.`date` == date( \"1996-2-27\" ) AND s.stock.name == \"电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017824172973632812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2021-3-3\" ) AND sd.stock_data.`date` == date( \"1996-2-27\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001623392105102539], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"1996-2-27\" ) AND sd.stock_data.`date` == date( \"2021-3-3\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017025470733642578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-3\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"1996-2-27\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017390251159667969]]}, {"query": "1996年2月27日到2021年3月3日的长江电力上市公司的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长江电力' AND sd.stock_data.`date` >= date('1996-02-27') AND sd.stock_data.`date` <= date('2021-03-03') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-2-27\" ) AND sd.stock_data.`date` == date( \"2021-3-3\" ) AND s.stock.name == \"电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0021440982818603516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1996-2-27\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2021-3-3\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001695394515991211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-3\" ) AND sd.stock_data.`date` == date( \"1996-2-27\" ) AND s.stock.name == \"电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015714168548583984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2021-3-3\" ) AND sd.stock_data.`date` == date( \"1996-2-27\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016832351684570312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"1996-2-27\" ) AND sd.stock_data.`date` == date( \"2021-3-3\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017821788787841797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-3\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"1996-2-27\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016734600067138672]]}, {"query": "近41日*ST宏图股票的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '*ST宏图' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-41 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宏\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.002363443374633789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宏\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0020275115966796875]]}, {"query": "*ST宏图股票近41日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '*ST宏图' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-41 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宏\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.002210855484008789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宏\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017597675323486328]]}, {"query": "*ST宏图股票近41日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '*ST宏图' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-41 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"ST宏\" \nRETURN s.stock\nLIMIT 50", 0, 0.001851797103881836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"ST宏\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017714500427246094]]}, {"query": "万里股份上市公司近18日的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '万里股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-18 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0019905567169189453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.0018088817596435547]]}, {"query": "万里股份上市公司近18日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '万里股份' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-18 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"股份\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018062591552734375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016994476318359375]]}, {"query": "2020年3月14日到2021年3月8日的西安银行股票的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西安银行' AND sd.stock_data.`date` >= date('2020-03-14') AND sd.stock_data.`date` <= date('2021-03-08') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-8\" ) AND s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2020-3-14\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.00246429443359375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-14\" ) AND sd.stock_data.`date` == date( \"2021-3-8\" ) AND s.stock.name == \"银行\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.002027273178100586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-8\" ) AND sd.stock_data.`date` == date( \"2020-3-14\" ) AND s.stock.name == \"银行\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0019905567169189453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2020-3-14\" ) AND sd.stock_data.`date` == date( \"2021-3-8\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0020880699157714844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2021-3-8\" ) AND sd.stock_data.`date` == date( \"2020-3-14\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.002153158187866211], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-14\" ) AND s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2021-3-8\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0018756389617919922]]}, {"query": "西安银行股票2020年3月14日到2021年3月8日的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '西安银行' AND sd.stock_data.`date` >= date('2020-03-14') AND sd.stock_data.`date` <= date('2021-03-08') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-8\" ) AND s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2020-3-14\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0018603801727294922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-14\" ) AND sd.stock_data.`date` == date( \"2021-3-8\" ) AND s.stock.name == \"银行\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0018458366394042969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-3-8\" ) AND sd.stock_data.`date` == date( \"2020-3-14\" ) AND s.stock.name == \"银行\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0017473697662353516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2020-3-14\" ) AND sd.stock_data.`date` == date( \"2021-3-8\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0018608570098876953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2021-3-8\" ) AND sd.stock_data.`date` == date( \"2020-3-14\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0019197463989257812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2020-3-14\" ) AND s.stock.name == \"银行\" AND sd.stock_data.`date` == date( \"2021-3-8\" ) \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0020227432250976562]]}, {"query": "平高电气股票近8日的最低价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '平高电气' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-8 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"平高电气\" \nRETURN s.stock\nLIMIT 50", 0, 0.01901555061340332], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"平高电气\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0219728946685791]]}, {"query": "近8日平高电气股票的最低价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '平高电气' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-8 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.minimum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"平高电气\" \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.019187450408935547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"平高电气\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.minimum_price\nLIMIT 50", 0, 0.019211292266845703]]}, {"query": "四川长虹近89日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '四川长虹' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-89 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川长虹\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01984381675720215], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"四川长虹\" \nRETURN s.stock\nLIMIT 50", 0, 0.01712203025817871]]}, {"query": "近89日四川长虹的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '四川长虹' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-89 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川长虹\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.020261287689208984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"四川长虹\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01846909523010254]]}, {"query": "四川长虹近89日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '四川长虹' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-89 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川长虹\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01687932014465332], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"四川长虹\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.01723790168762207]]}, {"query": "近23日钱江水利上市公司的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '钱江水利' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-23 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"钱江水利\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.017801523208618164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"钱江水利\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.01661229133605957]]}, {"query": "钱江水利上市公司近23日的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '钱江水利' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-23 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"钱江水利\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.016972780227661133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"钱江水利\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.017525672912597656]]}, {"query": "1991年7月3日到2022年4月7日的物产中大的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '物产中大' AND sd.stock_data.`date` >= date('1991-07-03') AND sd.stock_data.`date` <= date('2022-04-07') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1991-7-3\" ) AND sd.stock_data.`date` == date( \"2022-4-7\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002195119857788086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-4-7\" ) AND sd.stock_data.`date` == date( \"1991-7-3\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.023848772048950195]]}, {"query": "物产中大1991年7月3日到2022年4月7日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '物产中大' AND sd.stock_data.`date` >= date('1991-07-03') AND sd.stock_data.`date` <= date('2022-04-07') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"1991-7-3\" ) AND sd.stock_data.`date` == date( \"2022-4-7\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0025725364685058594], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2022-4-7\" ) AND sd.stock_data.`date` == date( \"1991-7-3\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.022738218307495117]]}, {"query": "中国船舶股票近34日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国船舶' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-34 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"船舶\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0020422935485839844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"船舶\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.001954317092895508]]}, {"query": "近34日中国船舶股票的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '中国船舶' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-34 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"船舶\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0022339820861816406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"船舶\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.0017545223236083984]]}, {"query": "华鼎股份2014年4月27日到2021年6月8日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华鼎股份' AND sd.stock_data.`date` >= date('2014-04-27') AND sd.stock_data.`date` <= date('2021-06-08') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-4-27\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-6-8\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.002125263214111328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-4-27\" ) AND sd.stock_data.`date` == date( \"2021-6-8\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.002011537551879883], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-8\" ) AND sd.stock_data.`date` == date( \"2014-4-27\" ) AND s.stock.name == \"股份\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001775503158569336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2014-4-27\" ) AND sd.stock_data.`date` == date( \"2021-6-8\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016107559204101562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-6-8\" ) AND s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2014-4-27\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016257762908935547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"股份\" AND sd.stock_data.`date` == date( \"2021-6-8\" ) AND sd.stock_data.`date` == date( \"2014-4-27\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001718282699584961]]}]