[{"query": "电信设备和汽车零部件行业的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车零部件' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0007510185241699219], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.0006227493286132812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" AND t.trade.name == \"电信\" \nRETURN temp\nLIMIT 50", 0, 0.0004343986511230469], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电信\" \nRETURN temp\nLIMIT 50", 0, 0.0003705024719238281], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND t.trade.name == \"汽车\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00036597251892089844], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电信\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"汽车\" \nRETURN temp\nLIMIT 50", 0, 0.00034618377685546875]]}, {"query": "电子城和法拉电子股票的开盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '电子城' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '法拉电子' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"法拉电子\" \nRETURN temp\nLIMIT 50", 0, 0.0006897449493408203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"法拉电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.0005843639373779297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"法拉电子\" AND s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004208087921142578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"法拉电子\" AND s.stock.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.0004360675811767578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND s.stock.name == \"法拉电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00030922889709472656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" AND s.stock.name == \"法拉电子\" \nRETURN temp\nLIMIT 50", 0, 0.0004124641418457031]]}, {"query": "电子城和法拉电子股票的开盘价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '电子城' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '法拉电子' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"法拉电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.0025177001953125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电子\" AND s.stock.name == \"法拉电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019693374633789062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" AND s.stock.name == \"法拉电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.001882314682006836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"法拉电子\" AND s.stock.name == \"电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01703500747680664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"法拉电子\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.017798662185668945], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"法拉电子\" AND s.stock.name == \"电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.017257213592529297]]}, {"query": "消费品和电力的开盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '消费品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电力' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.019320964813232422], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.02007913589477539]]}, {"query": "消费品和电力的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '消费品' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电力' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.0006947517395019531], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00034332275390625]]}, {"query": "江苏吴中和吉林高速上市公司的最低价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏吴中' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '吉林高速' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"江苏吴中\" \nRETURN temp\nLIMIT 50", 0, 0.001026153564453125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏吴中\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004062652587890625]]}, {"query": "江苏吴中和吉林高速上市公司的最低价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '江苏吴中' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '吉林高速' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"江苏吴中\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019189119338989258], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"江苏吴中\" \nRETURN s.stock\nLIMIT 50", 0, 0.016224145889282227]]}, {"query": "酒店和度假村和电力的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电力' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020902395248413086], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0024607181549072266], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" AND indus.industry.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.02769637107849121], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0027937889099121094], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.018689393997192383], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"酒店\" AND indus.industry.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0021109580993652344]]}, {"query": "酒店和度假村和电力的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电力' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.0006718635559082031], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0006041526794433594], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"酒店\" AND indus.industry.name == \"电力\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004246234893798828], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"酒店\" AND indus.industry.name == \"电力\" \nRETURN temp\nLIMIT 50", 0, 0.0003650188446044922], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"电力\" AND indus.industry.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.00031828880310058594], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"电力\" AND indus.industry.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0002651214599609375]]}, {"query": "星宇股份和中国卫星的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '星宇股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中国卫星' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"中国卫星\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.022454023361206055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"中国卫星\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.023174047470092773]]}, {"query": "星宇股份和中国卫星的开盘价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '星宇股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中国卫星' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"中国卫星\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02150249481201172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"中国卫星\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020741939544677734]]}, {"query": "汽车和零售行业的最高价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '汽车' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"汽车\" OR indus.industry.name == \"零售\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.21490859985351562], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"汽车\" OR indus.industry.name == \"零售\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.19003725051879883]]}, {"query": "天房发展和北大荒股票的开盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天房发展' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北大荒' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"天房发展\" OR s.stock.name == \"北大荒\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02209949493408203], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"天房发展\" OR s.stock.name == \"北大荒\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019812583923339844]]}, {"query": "天房发展和北大荒股票的开盘价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天房发展' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北大荒' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"天房发展\" OR s.stock.name == \"北大荒\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.020968914031982422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"天房发展\" OR s.stock.name == \"北大荒\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020333051681518555]]}, {"query": "天房发展和北大荒股票的开盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天房发展' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.opening_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北大荒' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"天房发展\" OR s.stock.name == \"北大荒\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006847381591796875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"天房发展\" OR s.stock.name == \"北大荒\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005128383636474609]]}, {"query": "电子设备和电视和广播行业的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0023775100708007812], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电子\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019941329956054688]]}, {"query": "电子设备和电视和广播行业的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电子设备' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"电子\" \nRETURN temp\nLIMIT 50", 0, 0.0006124973297119141], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"电子\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00041365623474121094]]}, {"query": "福成股份和中国化学上市公司的最低价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '福成股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中国化学' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"中国化\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.023019075393676758], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"中国化\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020583152770996094]]}, {"query": "福成股份和中国化学上市公司的最低价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '福成股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中国化学' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"中国化\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02350592613220215], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"中国化\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.022138357162475586]]}, {"query": "福成股份和中国化学上市公司的最低价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '福成股份' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中国化学' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"股份\" OR s.stock.name == \"中国化\" ) \nRETURN temp\nLIMIT 50", 0, 0.0006701946258544922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"股份\" OR s.stock.name == \"中国化\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005383491516113281]]}, {"query": "零售和电信设备的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006387233734130859], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"电信\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005366802215576172]]}, {"query": "零售和电信设备的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '零售' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '电信设备' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"零售\" OR indus.industry.name == \"电信\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.188934326171875], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"零售\" OR indus.industry.name == \"电信\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.18782806396484375]]}, {"query": "华微电子和中国巨石的收盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华微电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中国巨石' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华微电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.000751495361328125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华微电子\" \nRETURN temp\nLIMIT 50", 0, 0.0005898475646972656]]}, {"query": "华微电子和中国巨石的收盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '华微电子' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '中国巨石' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"华微电子\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01746535301208496], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"华微电子\" \nRETURN s.stock\nLIMIT 50", 0, 0.017230749130249023]]}, {"query": "电视和广播和污水处理的收盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade\nLIMIT 50", 0, 0.0023953914642333984], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0020182132720947266]]}, {"query": "电视和广播和污水处理的收盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN temp\nLIMIT 50", 0, 0.0007343292236328125], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0004856586456298828]]}, {"query": "电视和广播和污水处理的收盘价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电视和广播' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"水处理\" \nRETURN t.trade\nLIMIT 50", 0, 0.0022635459899902344], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"水处理\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0020515918731689453]]}, {"query": "酒店和度假村和能源行业的最低价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" AND t.trade.name == \"能源\" \nRETURN temp\nLIMIT 50", 0, 0.000667572021484375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0004534721374511719], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"能源\" \nRETURN temp\nLIMIT 50", 0, 0.000850677490234375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00042724609375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"能源\" AND t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0003464221954345703], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"能源\" AND t.trade.name == \"酒店\" \nRETURN temp\nLIMIT 50", 0, 0.0003559589385986328]]}]