[{"query": "北矿科技上市公司2021年12月11日前2日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '北矿科技' AND sd.stock_data.`date` <= date('2021-12-11') AND sd.stock_data.`date` > date('2021-12-11')-2 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND date('2023-11-11') - sd.stock_data.`date` <= 2 AND sd.stock_data.`date` == date( \"2021-12-11\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018963813781738281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-11\" ) AND s.stock.name == \"科技\" AND date('2023-11-11') - sd.stock_data.`date` <= 2 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0018854141235351562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 2 AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date( \"2021-12-11\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017328262329101562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date( \"2021-12-11\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 2 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001672506332397461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 2 AND sd.stock_data.`date` == date( \"2021-12-11\" ) AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016567707061767578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-11\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 2 AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016903877258300781]]}, {"query": "2021年12月11日前2日的北矿科技上市公司的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '北矿科技' AND sd.stock_data.`date` <= date('2021-12-11') AND sd.stock_data.`date` > date('2021-12-11')-2 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND date('2023-11-11') - sd.stock_data.`date` <= 2 AND sd.stock_data.`date` == date( \"2021-12-11\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017199516296386719], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-11\" ) AND s.stock.name == \"科技\" AND date('2023-11-11') - sd.stock_data.`date` <= 2 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015473365783691406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 2 AND s.stock.name == \"科技\" AND sd.stock_data.`date` == date( \"2021-12-11\" ) \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016353130340576172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date( \"2021-12-11\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 2 \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0015354156494140625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 2 AND sd.stock_data.`date` == date( \"2021-12-11\" ) AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016314983367919922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-11\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 2 AND s.stock.name == \"科技\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0016045570373535156]]}, {"query": "川投能源2021年12月2日前28日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '川投能源' AND sd.stock_data.`date` <= date('2021-12-02') AND sd.stock_data.`date` > date('2021-12-02')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2021-12-2\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 28 \nRETURN s.stock\nLIMIT 50", 0, 0.0019447803497314453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 28 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2021-12-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.001641988754272461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-2\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 28 AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016291141510009766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND date('2023-11-11') - sd.stock_data.`date` <= 28 AND sd.stock_data.`date` == date( \"2021-12-2\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015368461608886719], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-2\" ) AND s.stock.name == \"能源\" AND date('2023-11-11') - sd.stock_data.`date` <= 28 \nRETURN s.stock\nLIMIT 50", 0, 0.0015914440155029297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 28 AND sd.stock_data.`date` == date( \"2021-12-2\" ) AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.001486063003540039]]}, {"query": "川投能源2021年12月2日前28天的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '川投能源' AND sd.stock_data.`date` <= date('2021-12-02') AND sd.stock_data.`date` > date('2021-12-02')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 28 AND sd.stock_data.`date` == date( \"2021-12-2\" ) AND s.stock.name == \"能源\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001890420913696289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-2\" ) AND s.stock.name == \"能源\" AND date('2023-11-11') - sd.stock_data.`date` <= 28 \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015902519226074219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND date('2023-11-11') - sd.stock_data.`date` <= 28 AND sd.stock_data.`date` == date( \"2021-12-2\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016069412231445312], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2021-12-2\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 28 \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016872882843017578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-2\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 28 AND s.stock.name == \"能源\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016188621520996094], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 28 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2021-12-2\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015034675598144531]]}, {"query": "川投能源2021年12月2日前28日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '川投能源' AND sd.stock_data.`date` <= date('2021-12-02') AND sd.stock_data.`date` > date('2021-12-02')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 28 AND sd.stock_data.`date` == date( \"2021-12-2\" ) AND s.stock.name == \"能源\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0017414093017578125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-2\" ) AND s.stock.name == \"能源\" AND date('2023-11-11') - sd.stock_data.`date` <= 28 \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016551017761230469], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND date('2023-11-11') - sd.stock_data.`date` <= 28 AND sd.stock_data.`date` == date( \"2021-12-2\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015757083892822266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2021-12-2\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 28 \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016508102416992188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-12-2\" ) AND date('2023-11-11') - sd.stock_data.`date` <= 28 AND s.stock.name == \"能源\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0016162395477294922], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE date('2023-11-11') - sd.stock_data.`date` <= 28 AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date( \"2021-12-2\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015985965728759766]]}, {"query": "近50日四川金顶股票的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '四川金顶' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-50 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0005078315734863281], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.04820513725280762], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0007102489471435547], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 5.437128782272339]]}, {"query": "四川金顶股票近50日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '四川金顶' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-50 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"四川金顶\" \nRETURN s.stock\nLIMIT 50", 0, 0.45961499214172363], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0011532306671142578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0004112720489501953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-9-18\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"四川金顶\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"四川金顶\" \nRETURN s.stock\nLIMIT 50", 0, 0.051230669021606445]]}, {"query": "长江电力上市公司2014年10月30日到2019年11月9日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长江电力' AND sd.stock_data.`date` >= date('2014-10-30') AND sd.stock_data.`date` <= date('2019-11-09') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-10-30\" ) AND sd.stock_data.`date` == date( \"2019-11-9\" ) AND s.stock.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.002100229263305664], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-9\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2014-10-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0020072460174560547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-10-30\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2019-11-9\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0015723705291748047], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2019-11-9\" ) AND sd.stock_data.`date` == date( \"2014-10-30\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017476081848144531], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2014-10-30\" ) AND sd.stock_data.`date` == date( \"2019-11-9\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0017325878143310547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-9\" ) AND sd.stock_data.`date` == date( \"2014-10-30\" ) AND s.stock.name == \"电力\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017743110656738281]]}, {"query": "长江电力上市公司2014年10月30日到2019年11月9日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '长江电力' AND sd.stock_data.`date` >= date('2014-10-30') AND sd.stock_data.`date` <= date('2019-11-09') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2014-10-30\" ) AND sd.stock_data.`date` == date( \"2019-11-9\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0019123554229736328], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2019-11-9\" ) AND sd.stock_data.`date` == date( \"2014-10-30\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0044934749603271484], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-10-30\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2019-11-9\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001718759536743164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-9\" ) AND sd.stock_data.`date` == date( \"2014-10-30\" ) AND s.stock.name == \"电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015888214111328125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2019-11-9\" ) AND s.stock.name == \"电力\" AND sd.stock_data.`date` == date( \"2014-10-30\" ) \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.0015938282012939453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2014-10-30\" ) AND sd.stock_data.`date` == date( \"2019-11-9\" ) AND s.stock.name == \"电力\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.001543283462524414]]}, {"query": "百利电气上市公司2005年11月8日到2021年1月13日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '百利电气' AND sd.stock_data.`date` >= date('2005-11-08') AND sd.stock_data.`date` <= date('2021-01-13') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2005-11-8\" ) AND sd.stock_data.`date` == date( \"2021-1-13\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0029604434967041016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-1-13\" ) AND sd.stock_data.`date` == date( \"2005-11-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.026226282119750977]]}, {"query": "2005年11月8日到2021年1月13日的百利电气上市公司的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '百利电气' AND sd.stock_data.`date` >= date('2005-11-08') AND sd.stock_data.`date` <= date('2021-01-13') RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2005-11-8\" ) AND sd.stock_data.`date` == date( \"2021-1-13\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.002305269241333008], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2021-1-13\" ) AND sd.stock_data.`date` == date( \"2005-11-8\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.0192716121673584]]}, {"query": "近71日重庆啤酒上市公司的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆啤酒' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-71 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆啤酒\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.016992568969726562], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆啤酒\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01604747772216797]]}, {"query": "重庆啤酒上市公司近71日的最高价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆啤酒' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-71 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆啤酒\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015999555587768555], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆啤酒\" \nRETURN s.stock\nLIMIT 50", 0, 0.016480445861816406]]}, {"query": "重庆啤酒上市公司近71日的最高价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '重庆啤酒' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-71 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.maximum_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"重庆啤酒\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01629805564880371], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"重庆啤酒\" \nRETURN sd.stock_data.maximum_price\nLIMIT 50", 0, 0.01686716079711914]]}, {"query": "嘉化能源股票近72日的开盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '嘉化能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-72 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0020902156829833984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017104148864746094]]}, {"query": "嘉化能源股票近72日的开盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '嘉化能源' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-72 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.opening_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.001859426498413086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN sd.stock_data.opening_price\nLIMIT 50", 0, 0.0017499923706054688]]}, {"query": "近28日美尔雅的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '美尔雅' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"美尔雅\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.016069889068603516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"美尔雅\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.016216516494750977]]}, {"query": "美尔雅近28日的收盘价是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '美尔雅' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"美尔雅\" \nRETURN s.stock\nLIMIT 50", 0, 0.01667642593383789], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"美尔雅\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016860246658325195]]}, {"query": "美尔雅近28日的收盘价", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '美尔雅' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-28 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.closing_price\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"美尔雅\" \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.019077539443969727], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"美尔雅\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.closing_price\nLIMIT 50", 0, 0.02084946632385254]]}, {"query": "常熟银行近29日的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '常熟银行' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.002139568328857422], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.002015829086303711]]}, {"query": "近29日常熟银行的成交量", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '常熟银行' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0019817352294921875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN sd.stock_data.volume\nLIMIT 50", 0, 0.0018279552459716797]]}, {"query": "常熟银行近29日的成交量是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '常熟银行' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-29 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.volume\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0019102096557617188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.001837015151977539]]}, {"query": "近37日南京新百的涨跌幅", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '南京新百' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-37 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 5.778510570526123], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0008327960968017578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.13582110404968262], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN sd.stock_data.range\nLIMIT 50", 0, 0.0007300376892089844]]}, {"query": "南京新百近37日的涨跌幅是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '南京新百' AND sd.stock_data.`date` <= date('2023-11-11') AND sd.stock_data.`date` > date('2023-11-11')-37 RETURN s.stock.name, sd.stock_data.`date`, sd.stock_data.range\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.0006699562072753906], ["MATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (sd:stock_data)\nWHERE sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"南京新百\" \nRETURN s.stock\nLIMIT 50", 0, 0.4553191661834717], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp\nMATCH (s:stock)\nWHERE s.stock.name == \"南京新百\" \nRETURN s.stock\nLIMIT 50", 0, 0.050158023834228516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-10-1\" ) WITH sd.stock_data.closing_price AS p1\nMATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"南京新百\" AND sd.stock_data.`date` == date( \"2023-11-7\" ) WITH ( sd.stock_data.closing_price - p1 ) / sd.stock_data.closing_price AS temp \nRETURN s.stock\nLIMIT 50", 0, 0.000762939453125]]}]