[{"query": "鲁抗医药的最高价是否大于55", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鲁抗医药' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 55\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁抗医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01735711097717285], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁抗医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.018193960189819336]]}, {"query": "鲁抗医药的最高价是不是大于55", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鲁抗医药' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price > 55\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁抗医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016505718231201172], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁抗医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.017473220825195312]]}, {"query": "鲁抗医药上市公司的最低价是否大于23", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鲁抗医药' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price > 23\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁抗医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015537023544311523], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁抗医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.015935659408569336]]}, {"query": "鲁抗医药上市公司的涨跌幅是否不大于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鲁抗医药' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁抗医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01584315299987793], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁抗医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.017375707626342773]]}, {"query": "鲁抗医药上市公司的涨跌幅是不是不大于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鲁抗医药' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁抗医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01583576202392578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁抗医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.01496267318725586]]}, {"query": "鲁抗医药股票的成交量是不是不小于95", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鲁抗医药' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume >= 95\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁抗医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.018602609634399414], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁抗医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.016382694244384766]]}, {"query": "鲁抗医药股票的成交量是否不小于95", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '鲁抗医药' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume >= 95\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"鲁抗医药\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017021894454956055], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"鲁抗医药\" \nRETURN s.stock\nLIMIT 50", 0, 0.01558375358581543]]}, {"query": "海油工程的开盘价是否大于25", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price > 25\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017336368560791016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.016941070556640625]]}, {"query": "海油工程的开盘价是不是大于25", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price > 25\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01544332504272461], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.01510167121887207]]}, {"query": "海油工程的最高价是否小于4", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 4\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01580214500427246], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.01601123809814453]]}, {"query": "海油工程上市公司的最低价是不是不小于63", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 63\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016233444213867188], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.015384912490844727]]}, {"query": "海油工程的涨跌幅是不是大于85", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range > 85\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016751766204833984], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.01718616485595703]]}, {"query": "海油工程的涨跌幅是否大于85", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range > 85\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016172170639038086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.017302274703979492]]}, {"query": "海油工程股票的成交量是否大于72", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 72\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016372203826904297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.015278100967407227]]}, {"query": "海油工程股票的成交量是不是大于72", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '海油工程' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 72\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"海油工程\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017017602920532227], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"海油工程\" \nRETURN s.stock\nLIMIT 50", 0, 0.015572309494018555]]}, {"query": "首旅酒店的开盘价是否大于50", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price > 50\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017802715301513672], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017724037170410156]]}, {"query": "首旅酒店的开盘价是不是大于50", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price > 50\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017664432525634766], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.00159454345703125]]}, {"query": "首旅酒店上市公司的收盘价是不是小于97", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.closing_price < 97\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017504692077636719], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014586448669433594]]}, {"query": "首旅酒店上市公司的最高价是不是小于49", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 49\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016512870788574219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014667510986328125]]}, {"query": "首旅酒店上市公司的最高价是否小于49", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 49\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016779899597167969], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014641284942626953]]}, {"query": "首旅酒店上市公司的最低价是不是不小于47", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 47\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015869140625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.001680135726928711]]}, {"query": "首旅酒店上市公司的最低价是否不小于47", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price >= 47\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016942024230957031], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017702579498291016]]}, {"query": "首旅酒店股票的涨跌幅是否不大于69", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 69\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016818046569824219], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014750957489013672]]}, {"query": "首旅酒店上市公司的成交量是否小于98", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume < 98\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.001688241958618164], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0014197826385498047]]}, {"query": "首旅酒店上市公司的成交量是不是小于98", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '首旅酒店' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume < 98\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"酒店\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0017676353454589844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"酒店\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018541812896728516]]}, {"query": "复旦复华的开盘价是否小于48", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price < 48\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.018347740173339844], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01558828353881836]]}, {"query": "复旦复华的开盘价是不是小于48", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price < 48\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.015851736068725586], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0156557559967041]]}, {"query": "复旦复华的最高价是不是小于89", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 89\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.0160369873046875], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0166628360748291]]}, {"query": "复旦复华的最高价是否小于89", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 89\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.01481485366821289], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016019582748413086]]}, {"query": "复旦复华上市公司的最低价是否不大于94", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price <= 94\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.015178442001342773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01488494873046875]]}, {"query": "复旦复华上市公司的最低价是不是不大于94", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price <= 94\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.015499114990234375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015570402145385742]]}, {"query": "复旦复华上市公司的涨跌幅是不是小于78", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range < 78\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.014863252639770508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0177614688873291]]}, {"query": "复旦复华股票的成交量是不是大于33", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '复旦复华' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 33\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"复旦复华\" \nRETURN s.stock\nLIMIT 50", 0, 0.014762163162231445], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"复旦复华\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016443967819213867]]}, {"query": "氯碱化工的开盘价是否不小于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price >= 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017174243927001953], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.017304420471191406]]}, {"query": "氯碱化工的开盘价是不是不小于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price >= 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01592707633972168], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.01609659194946289]]}, {"query": "氯碱化工的收盘价是不是大于57", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.closing_price > 57\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01719188690185547], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.016692161560058594]]}, {"query": "氯碱化工股票的最高价是不是小于95", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 95\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016353845596313477], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.016483783721923828]]}, {"query": "氯碱化工股票的最高价是否小于95", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 95\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016377925872802734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.015367746353149414]]}, {"query": "氯碱化工上市公司的最低价是否大于21", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price > 21\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015824556350708008], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.01616501808166504]]}, {"query": "氯碱化工上市公司的最低价是不是大于21", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price > 21\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016796588897705078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.01573967933654785]]}, {"query": "氯碱化工的涨跌幅是否不大于18", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 18\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01671004295349121], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.017813920974731445]]}, {"query": "氯碱化工的涨跌幅是不是不大于18", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range <= 18\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016289710998535156], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.01500701904296875]]}, {"query": "氯碱化工股票的成交量是不是不大于83", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '氯碱化工' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume <= 83\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"氯碱化工\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01590728759765625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"氯碱化工\" \nRETURN s.stock\nLIMIT 50", 0, 0.015306234359741211]]}, {"query": "广东明珠上市公司的开盘价是不是小于33", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广东明珠' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price < 33\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"广东明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.01566457748413086], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"广东明珠\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016524791717529297]]}, {"query": "广东明珠上市公司的开盘价是否小于33", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广东明珠' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price < 33\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"广东明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.018078327178955078], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"广东明珠\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.017133474349975586]]}, {"query": "广东明珠上市公司的最高价是否小于26", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广东明珠' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.maximum_price < 26\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"广东明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.019124507904052734], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"广东明珠\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01630997657775879]]}, {"query": "广东明珠股票的最低价是否大于37", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广东明珠' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price > 37\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"广东明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.015767812728881836], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"广东明珠\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.016286849975585938]]}, {"query": "广东明珠股票的最低价是不是大于37", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广东明珠' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.minimum_price > 37\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"广东明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.015993595123291016], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"广东明珠\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.01680135726928711]]}, {"query": "广东明珠的涨跌幅是不是大于96", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广东明珠' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.range > 96\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"广东明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.016246557235717773], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"广东明珠\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.015962600708007812]]}, {"query": "广东明珠的成交量是否大于67", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '广东明珠' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.volume > 67\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"广东明珠\" \nRETURN s.stock\nLIMIT 50", 0, 0.015804052352905273], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"广东明珠\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0184786319732666]]}, {"query": "博闻科技股票的开盘价是不是不大于10", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '博闻科技' AND sd.stock_data.`date` == date('2023-11-11') RETURN sd.stock_data.opening_price <= 10\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"科技\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019540786743164062], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"科技\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016219615936279297]]}]