[{"query": "酒店和度假村和能源行业的最低价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" AND t.trade.name == \"能源\" \nRETURN t.trade\nLIMIT 50", 0, 0.002382993698120117], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"能源\" AND t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.020595073699951172], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.0182802677154541], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0019860267639160156], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"能源\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.015780925750732422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"能源\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019333362579345703]]}, {"query": "酒店和度假村和能源行业的最低价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '酒店和度假村' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.minimum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '能源' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" AND t.trade.name == \"能源\" \nRETURN t.trade\nLIMIT 50", 0, 0.0023033618927001953], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"能源\" AND t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0201570987701416], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.017371416091918945], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND t.trade.name == \"能源\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.0020503997802734375], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"能源\" AND t.trade.name == \"酒店\" \nRETURN t.trade\nLIMIT 50", 0, 0.018901586532592773], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE t.trade.name == \"酒店\" AND td.trade_data.`date` == date('2023-11-11') AND t.trade.name == \"能源\" \nRETURN t.trade\nLIMIT 50", 0, 0.0019118785858154297]]}, {"query": "盛和资源和北巴传媒上市公司的涨跌幅差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北巴传媒' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0028634071350097656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"资源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0029096603393554688]]}, {"query": "盛和资源和北巴传媒上市公司的涨跌幅差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北巴传媒' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"资源\" \nRETURN temp\nLIMIT 50", 0, 0.0006325244903564453], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.00040602684020996094]]}, {"query": "盛和资源和北巴传媒上市公司的涨跌幅差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '盛和资源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北巴传媒' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"资源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0024077892303466797], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"资源\" \nRETURN s.stock\nLIMIT 50", 0, 0.002027750015258789]]}, {"query": "新华医疗和保税科技股票的收盘价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '新华医疗' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '保税科技' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"新华医疗\" OR s.stock.name == \"保税科技\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.022619009017944336], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"新华医疗\" OR s.stock.name == \"保税科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02138233184814453]]}, {"query": "新华医疗和保税科技股票的收盘价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '新华医疗' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '保税科技' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"新华医疗\" OR s.stock.name == \"保税科技\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.02520608901977539], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"新华医疗\" OR s.stock.name == \"保税科技\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.019674301147460938]]}, {"query": "新华医疗和保税科技股票的收盘价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '新华医疗' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.closing_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '保税科技' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"新华医疗\" OR s.stock.name == \"保税科技\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006234645843505859], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"新华医疗\" OR s.stock.name == \"保税科技\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003139972686767578]]}, {"query": "金属和矿业和金融技术行业的开盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.0073282718658447266], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.006960630416870117]]}, {"query": "金属和矿业和金融技术行业的开盘价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '金属和矿业' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '金融技术' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0008289813995361328], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"金属\" OR t.trade.name == \"矿业\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005941390991210938]]}, {"query": "航发动力和北京银行的最低价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航发动力' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北京银行' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0025680065155029297], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.002110719680786133]]}, {"query": "航发动力和北京银行的最低价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航发动力' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北京银行' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0006992816925048828], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN temp\nLIMIT 50", 0, 0.00046133995056152344]]}, {"query": "航发动力和北京银行的最低价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '航发动力' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.minimum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '北京银行' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.minimum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"银行\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0024170875549316406], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"银行\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020837783813476562]]}, {"query": "旅游和酒店和银行的现价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '旅游和酒店' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.closing_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '银行' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.closing_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"酒店\" WITH as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00043773651123046875], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"酒店\" WITH as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) \nRETURN temp\nLIMIT 50", 0, 0.00033354759216308594], ["MATCH (indus:industry)\nWHERE indus.industry.name == \"酒店\" WITH as temp1\nMATCH (indus:industry)\nWHERE indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) \nRETURN temp\nLIMIT 50", 0, 0.00026106834411621094], ["MATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"酒店\" WITH as temp1\nMATCH (indus:industry)\nWHERE ( indus.industry.name == \"旅游\" OR indus.industry.name == \"酒店\" ) AND indus.industry.name == \"银行\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0003676414489746094]]}, {"query": "天富能源和新力金融的最高价差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '新力金融' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"金融\" \nRETURN temp\nLIMIT 50", 0, 0.0006060600280761719], ["MATCH (s:stock)\nWHERE s.stock.name == \"金融\" AND s.stock.name == \"能源\" \nRETURN temp\nLIMIT 50", 0, 0.0004730224609375]]}, {"query": "天富能源和新力金融的最高价差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '新力金融' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金融\" AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002363920211791992], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" AND s.stock.name == \"金融\" \nRETURN s.stock\nLIMIT 50", 0, 0.0020699501037597656], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金融\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019435882568359375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金融\" \nRETURN s.stock\nLIMIT 50", 0, 0.00180816650390625], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金融\" AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0016891956329345703], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"金融\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0015196800231933594]]}, {"query": "天富能源和新力金融的最高价差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '天富能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.maximum_price AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '新力金融' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金融\" AND s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.002324342727661133], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" AND s.stock.name == \"金融\" \nRETURN s.stock\nLIMIT 50", 0, 0.0019741058349609375], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"金融\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018129348754882812], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金融\" \nRETURN s.stock\nLIMIT 50", 0, 0.0017871856689453125], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND s.stock.name == \"金融\" AND s.stock.name == \"能源\" \nRETURN s.stock\nLIMIT 50", 0, 0.0018045902252197266], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE s.stock.name == \"能源\" AND s.stock.name == \"金融\" AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.0016448497772216797]]}, {"query": "公用事业和房地产行业的最高价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '房地产' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"房地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.020131587982177734], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"房地产\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.020076751708984375]]}, {"query": "公用事业和房地产行业的最高价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '公用事业' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '房地产' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND indus.industry.name == \"房地产\" \nRETURN s.stock\nLIMIT 50", 0, 0.020485401153564453], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE indus.industry.name == \"房地产\" AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.019385099411010742]]}, {"query": "上海能源和国电南自上市公司的成交量差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '国电南自' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"上海能源\" OR s.stock.name == \"国电南自\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.027619600296020508], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"上海能源\" OR s.stock.name == \"国电南自\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02311873435974121]]}, {"query": "上海能源和国电南自上市公司的成交量差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '上海能源' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.volume AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '国电南自' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.volume - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"上海能源\" OR s.stock.name == \"国电南自\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.022072553634643555], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"上海能源\" OR s.stock.name == \"国电南自\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.021402359008789062]]}, {"query": "媒体和娱乐和汽车制造的最高价差额是多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车制造' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN t.trade\nLIMIT 50", 0, 0.006991863250732422], ["MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN t.trade\nLIMIT 50", 0, 0.006552934646606445]]}, {"query": "媒体和娱乐和汽车制造的最高价差多少", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '媒体和娱乐' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '汽车制造' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (t:trade)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND t.trade.name == \"汽车\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND t.trade.name == \"制造\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN temp\nLIMIT 50", 0, 0.0005679130554199219], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND t.trade.name == \"汽车\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"制造\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.0003910064697265625], ["MATCH (t:trade)\nWHERE t.trade.name == \"汽车\" WITH as temp1\nMATCH (t:trade)\nWHERE t.trade.name == \"制造\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp\nMATCH (t:trade)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003459453582763672], ["MATCH (t:trade)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND t.trade.name == \"汽车\" WITH as temp1\nMATCH (t:trade)\nWHERE ( t.trade.name == \"媒体\" OR t.trade.name == \"娱乐\" ) AND t.trade.name == \"制造\" WITH as temp2 WITH ABS( temp1 - temp2 ) as temp \nRETURN temp\nLIMIT 50", 0, 0.00027179718017578125]]}, {"query": "沧州大化和重庆百货股票的涨跌幅差距", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '重庆百货' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"沧州大化\" OR s.stock.name == \"重庆百货\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.021847248077392578], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"沧州大化\" OR s.stock.name == \"重庆百货\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.022282123565673828]]}, {"query": "沧州大化和重庆百货股票的涨跌幅差多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '重庆百货' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"沧州大化\" OR s.stock.name == \"重庆百货\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN temp\nLIMIT 50", 0, 0.0005877017974853516], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"沧州大化\" OR s.stock.name == \"重庆百货\" ) \nRETURN temp\nLIMIT 50", 0, 0.0003867149353027344]]}, {"query": "沧州大化和重庆百货股票的涨跌幅差额是多少", "golden": "MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data) WHERE s.stock.name == '沧州大化' AND sd.stock_data.`date` == date('2023-11-11') WITH sd.stock_data.range AS temp1 MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)WHERE s.stock.name == '重庆百货' AND sd.stock_data.`date` == date('2023-11-11') WITH ABS(sd.stock_data.range - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE ( s.stock.name == \"沧州大化\" OR s.stock.name == \"重庆百货\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.02079176902770996], ["MATCH (s:stock)-[hsd:has_stock_data]->(sd:stock_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"沧州大化\" OR s.stock.name == \"重庆百货\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.02063155174255371]]}, {"query": "电力和医疗保健设施的最高价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '电力' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.maximum_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '医疗保健设施' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.maximum_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( indus.industry.name == \"电力\" OR indus.industry.name == \"医疗\" ) \nRETURN s.stock\nLIMIT 50", 0, 0.20760178565979004], ["MATCH (indus:industry)<-[a:associate]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( indus.industry.name == \"电力\" OR indus.industry.name == \"医疗\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 0.1957852840423584]]}, {"query": "污水处理和农产品的开盘价差距", "golden": "MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data) WHERE t.trade.name == '污水处理' AND td.trade_data.`date` == date('2023-11-11') WITH td.trade_data.opening_price AS temp1 MATCH (t:trade)-[htd:has_trade_data]->(td:trade_data)WHERE t.trade.name == '农产品' AND td.trade_data.`date` == date('2023-11-11') WITH ABS(td.trade_data.opening_price - temp1) as abs_diff RETURN abs_diff\nLIMIT 50;", "candidates": [["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"水处理\" OR s.stock.name == \"农产品\" ) \nRETURN s.stock\nLIMIT 50", 0, 7.18162989616394], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"水处理\" OR s.stock.name == \"农产品\" ) \nRETURN s.stock\nLIMIT 50", 0, 7.250460386276245], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE sd.stock_data.`date` == date('2023-11-11') AND ( s.stock.name == \"水处理\" OR s.stock.name == \"农产品\" ) AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.376224994659424], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"水处理\" OR s.stock.name == \"农产品\" ) AND sd.stock_data.`date` == date('2023-11-11') AND td.trade_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.437990188598633], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE td.trade_data.`date` == date('2023-11-11') AND ( s.stock.name == \"水处理\" OR s.stock.name == \"农产品\" ) AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.212538242340088], ["MATCH (sd:stock_data)<-[hsd:has_stock_data]-(s:stock)-[bt:belong_to]->(t:trade)-[htd:has_trade_data]->(td:trade_data)\nWHERE ( s.stock.name == \"水处理\" OR s.stock.name == \"农产品\" ) AND td.trade_data.`date` == date('2023-11-11') AND sd.stock_data.`date` == date('2023-11-11') \nRETURN s.stock\nLIMIT 50", 0, 7.305621385574341]]}]